{"requirement": "Once an Application becomes the selected Application on the Basic Logical Channel, the responsibility for subsequent command dispatching still rests with the OPEN.", "cate": "functional", "id": "SecReq-478"}
{"requirement": "The CNG shall support mechanisms to authenticate CNDs to the NGN for service usage purposes if they are not able to fully support the related procedures in an autonomous way.", "cate": "security", "id": "SecReq-135"}
{"requirement": "The system shall allow the user to sign a document", "cate": "security", "id": "DOSSPRE-584"}
{"requirement": "The system will be using local Microsoft based certificates, thus the intention is to ensure availability of the certificate authority at all times.", "cate": "security", "id": "DOSSPRE-740"}
{"requirement": "The system shall have a data collection process allowing for benign and malicious data to be collected and submitted into the system for Malware detection.", "cate": "functional", "id": "DOSSPRE-414"}
{"requirement": "The system should be able to match fingerprint at login.", "cate": "security", "id": "DOSSPRE-557"}
{"requirement": "Otherwise, the Supplementary Logical Channel indicated by the command is opened and the Application currently selected on the original Supplementary Logical Channel shall become the selected Application on the newly opened Supplementary Logical Channel.", "cate": "functional", "id": "SecReq-500"}
{"requirement": "The product shall maintain a list of players.", "cate": "functional", "id": "promise-271"}
{"requirement": "The system is able to automatically adapt to the email environment to constantly tune and improve spam detection.", "cate": "security", "id": "DOSSPRE-744"}
{"requirement": "The System shall allow creation of users (Administrator, Lecturer, Student) accounts.", "cate": "functional", "id": "DOSSPRE-299"}
{"requirement": "The system shall report motion and alert the responsible parties after analyzing the conditions without the aid of external motion detection sensors.", "cate": "functional", "id": "DOSSPRE-70"}
{"requirement": "The system shall ensure that the authentication server interact with the database to check for registered user from the database", "cate": "security", "id": "DOSSPRE-666"}
{"requirement": "The system services shall be accessible offline since it will be a desktop application.", "cate": "functional", "id": "DOSSPRE-418"}
{"requirement": "The card issuer must establish its policies for assigning and adjusting slot maximum balances. These policies may require the card issuer to maintain a card database", "cate": "functional", "id": "SecReq-295"}
{"requirement": "The system shall allow a user to view content or dashboard.", "cate": "security", "id": "DOSSPRE-735"}
{"requirement": "The system shall capture and store all transactions.", "cate": "functional", "id": "DOSSPRE-62"}
{"requirement": "Traffic marking: depending on what are the parameters used to perform classification, CNDs or CNG itself on behalf of the CNDs shall be able to modify the packets' priority.", "cate": "functional", "id": "SecReq-95"}
{"requirement": "The system shall be able to capture data packs", "cate": "functional", "id": "DOSSPRE-146"}
{"requirement": "The GlobalPlatform Environment (OPEN) supports GlobalPlatform Trusted Framework functions (Secure inter-application communication) if the underlying runtime environment does not support them:", "cate": "functional", "id": "SecReq-431"}
{"requirement": "The system shall provide maturity, fault tolerance and recoverability in the face of a fault.", "cate": "security", "id": "DOSSPRE-455"}
{"requirement": "The system shall provide reports on failure and success of forensic image acquisition", "cate": "functional", "id": "DOSSPRE-235"}
{"requirement": "Send transactions to other processors in a standard format defined in agreement with the scheme provider", "cate": "functional", "id": "SecReq-254"}
{"requirement": "The system shall be up and running all the time since its checking or monitoring the child’s behavior and prevent any media from being sent or received using Bluetooth", "cate": "security", "id": "DOSSPRE-453"}
{"requirement": "The system shall be web based and therefore guarantees maximum availability of data to the cloud data owners", "cate": "security", "id": "DOSSPRE-426"}
{"requirement": "The system shall allow the user to input the Licence number/national I.D Number of the driver in the system", "cate": "functional", "id": "DOSSPRE-97"}
{"requirement": "The system shall allow the user to view the signature parameters and their values.", "cate": "functional", "id": "DOSSPRE-183"}
{"requirement": "The system shall be available at all times, meaning the user can access it using a device application which addresses the user concern for how dependable the system is during normal operating times.", "cate": "security", "id": "DOSSPRE-750"}
{"requirement": "The system shall provide maturity, fault tolerance and recoverability.", "cate": "security", "id": "DOSSPRE-534"}
{"requirement": "The available recycled parts information and their suppliers shall be returned to the user.", "cate": "functional", "id": "promise-149"}
{"requirement": "\"For both the SELECT [by name] [first or only occurrence] command and the SELECT [by name] [next occurrence] command, an Application becomes the selected Application on the Basic Logical Channel if:   The requested AID matches (fully or partially) the Application’s AID,   The Application being selected is in the correct Life Cycle State,   The Application has no restrictions due to multi-selection, and supports the current card interface.\"", "cate": "functional", "id": "SecReq-460"}
{"requirement": "The system will have a homepage which will be responsible for redirecting the user to the desired page, this can be a login page where the user will login to his email account or a registration page where the user creates an email account.", "cate": "functional", "id": "DOSSPRE-193"}
{"requirement": "The system shall  show warning to users.", "cate": "functional", "id": "DOSSPRE-374"}
{"requirement": "The web application will be secured by hardening and protecting the servers and restricting access from the outside.", "cate": "security", "id": "DOSSPRE-604"}
{"requirement": "The system shall enforce encryption on all files, communication channels and backups.", "cate": "security", "id": "DOSSPRE-563"}
{"requirement": "The system shall that the information collected from the previous stage of life should be readily available in any stage and whenever it is required by the rightful user", "cate": "security", "id": "DOSSPRE-823"}
{"requirement": "The system shall be able to filter outgoing traffic if it contains proxy related request.", "cate": "security", "id": "DOSSPRE-847"}
{"requirement": "The system super administrator should be able to grant access privilege to users and restrict access of information and data users can view or modify at any given time.", "cate": "security", "id": "DOSSPRE-652"}
{"requirement": "The system shall ensure that the exchange of data is between mobile and web-based application software, humans and combinations of these.", "cate": "functional", "id": "DOSSPRE-157"}
{"requirement": "The system should not violate laws by not infringing the privacy of sensitive user information and intellectual property rights.", "cate": "security", "id": "DOSSPRE-473"}
{"requirement": "The system shall be able to allocate resources to the actual student who has requested the service.", "cate": "security", "id": "DOSSPRE-813"}
{"requirement": "The system shall allow the administrator to embed the invisible digital watermark whenever an author submits his /her piece of art", "cate": "functional", "id": "DOSSPRE-22"}
{"requirement": "The system shall be able to detect whether the input credentials are authentic, then accept or else reject if the credentials are incorrect.", "cate": "security", "id": "DOSSPRE-506"}
{"requirement": "The system shall enable web data mining from Twitter, Twitter API provides different levels of accessing data through its Twitter Data Grants program.", "cate": "functional", "id": "DOSSPRE-143"}
{"requirement": "The system shall enable encryption and decryption capabilities to protect files.", "cate": "security", "id": "DOSSPRE-915"}
{"requirement": "The system shall provide all the internal users a backup of the operational and transactional data.", "cate": "security", "id": "DOSSPRE-648"}
{"requirement": "The NGN network QoS functions shall be possible to use to enhance the end-user experience.", "cate": "functional", "id": "SecReq-85"}
{"requirement": "The system shall be able to update eligible vehicles from different driving schools which are permitted to conduct Road Test", "cate": "functional", "id": "DOSSPRE-166"}
{"requirement": "\"A Controlling Authority is responsible for Generating the keys for its own Security Domain or obtaining Security Domain keys from a trusted third party,\"", "cate": "security", "id": "SecReq-359"}
{"requirement": "The system is effective because it will detect normal attacks which current systems do not detect.", "cate": "security", "id": "DOSSPRE-570"}
{"requirement": "The website shall protect itself from intentional abuse  and notify the administrator at all occurrences.", "cate": "security", "id": "promise-226"}
{"requirement": "The system shall verify the SSL certificate on a given web server to make sure it is correctly installed, valid, trusted and doesn't give any errors to any of the users.", "cate": "security", "id": "DOSSPRE-773"}
{"requirement": "Multiple identities should be supported within the same subscription. Personal service profiles per each identity within the same subscription should be supported. A shared public identity on several terminals, with different private identities, shall be supported (shared IMPU).", "cate": "functional", "id": "SecReq-162"}
{"requirement": "The card verification method indicator (CVMI) in the CEP card must specify support of online PIN verification and at least one method of off-line PIN verification (encrypted or unencrypted)", "cate": "security", "id": "SecReq-288"}
{"requirement": "\"Security Domains shall support security services such as key handling, encryption, decryption, digital signature generation and verification for their providers' such as card issuer, applicaiton providers and controlling authority\"", "cate": "security", "id": "SecReq-338"}
{"requirement": "A transaction that passes merchant acquirer validations and is forwarded to the card issuer is paid for by the card issuer. If the transaction does not pass card issuer validations, the card issuer may follow the scheme provider\u0083??s dispute procedures", "cate": "functional", "id": "SecReq-283"}
{"requirement": "The system shall provide currency calculator for Bitcoin conversion to USD.", "cate": "functional", "id": "DOSSPRE-60"}
{"requirement": "The user (pedestrians, vehicle owners and traffic police)should provide a valid information.'", "cate": "functional", "id": "SRRP-162"}
{"requirement": "The system shall notify the administrator of who accesses the system in case a data breach occurs.", "cate": "security", "id": "DOSSPRE-791"}
{"requirement": "The system data well integrated with the web-based application in a seamless manner since both systems use the same database for sharing data.", "cate": "functional", "id": "DOSSPRE-158"}
{"requirement": "The system shall provide file type filtering so as to avoid overloading the normal flow information with unnecessary files.", "cate": "security", "id": "DOSSPRE-704"}
{"requirement": "The system principle of authentication applies in that the system notifies if there is a watermark on the image or not.", "cate": "security", "id": "DOSSPRE-695"}
{"requirement": "The GlobalPlatform Environment (OPEN) supports Security Management functions (Security Domain locking and unlocking, Application locking and unlocking, Card locking and unlocking, Card termination, Privilege usage, Security Domain, privilege usage, Tracing and event logging) if the underlying runtime environment does not support them:", "cate": "functional", "id": "SecReq-430"}
{"requirement": "The system uses HMAC to maintain integrity of log files.", "cate": "security", "id": "DOSSPRE-524"}
{"requirement": "The product shall prevent a player from viewing the offensive or defensive grids of the other player.", "cate": "functional", "id": "promise-280"}
{"requirement": "The system shall  guarantee confidentiality through encryption of stored data with AES.", "cate": "security", "id": "DOSSPRE-858"}
{"requirement": "Protocols adaptation for control plane or management plane may be performed by CNG.", "cate": "functional", "id": "SecReq-181"}
{"requirement": "The card and the PSAM must use a public key algorithm for mutual authentication and session key exchange, as no permanent shared secret key may exist between the CEP card and the PSAM", "cate": "security", "id": "SecReq-214"}
{"requirement": "\"Each Trusted Framework present on the card shall Enforce the Trusted Framework security rules for inter-application communication, including the rules, defined in appendix G,\"", "cate": "security", "id": "SecReq-370"}
{"requirement": "The system allows user re-verification by the usage of AVS and distinct security questions.", "cate": "security", "id": "DOSSPRE-762"}
{"requirement": "User can enter into his account only by login", "cate": "functional", "id": "SRRP-176"}
{"requirement": "Front Desk staff shall be able to view all information in HPIMS add new patients to HPIMS but shall not be able to modify any information in it", "cate": "security", "id": "SRRP-94"}
{"requirement": "The system shall communicate with the Django API to get the corresponding Ethereum address of the entered National ID.", "cate": "functional", "id": "DOSSPRE-348"}
{"requirement": "The product shall ensure that only company employees or external users with company-approved user IDs may have product access.  100\\% of all logons shall be by either company employees or external users with company-approved user IDs.", "cate": "security", "id": "promise-170"}
{"requirement": "The CNG shall support mechanisms to authenticate itself to the NGN for connectivity purposes.", "cate": "security", "id": "SecReq-133"}
{"requirement": "Be the entity that maintains control over the flow of a transaction, ensuring that all security is enforced", "cate": "security", "id": "SecReq-248"}
{"requirement": "The card issuer generates S2, which is sent to the card to allow the card to validate the card issuer\u0083??s authenticity and to ensure that the data used by the card in the transaction is the same as the card issuer intended", "cate": "security", "id": "SecReq-228"}
{"requirement": "The system shall display the most frequently searched items by the user in the profile.", "cate": "functional", "id": "SRRP-30"}
{"requirement": "The system should be able to analyze the network traffic and detects intrusion, attacks and threats to the network.", "cate": "security", "id": "DOSSPRE-567"}
{"requirement": "The card issuer must have the ability to deactivate a CEP application in the response to a load or currency exchange transaction", "cate": "functional", "id": "SecReq-302"}
{"requirement": "The system shall be secured against environmental threats and this is one of its prime function.", "cate": "security", "id": "DOSSPRE-708"}
{"requirement": "The system shall allow uploading or viewing messages", "cate": "functional", "id": "DOSSPRE-189"}
{"requirement": "When applicable a Security Domain shall Manage on-card data securely,", "cate": "security", "id": "SecReq-381"}
{"requirement": "The CNG shall implement an authorization management handling policy.", "cate": "security", "id": "SecReq-10"}
{"requirement": "The CNG may interact with network elements inside the CPN to support QoS control inside the CPN.", "cate": "functional", "id": "SecReq-87"}
{"requirement": "The system shall allow pairing of smartphone with the laptop.", "cate": "functional", "id": "DOSSPRE-124"}
{"requirement": "The system shall be able to produce a log of number of passes and failures, in relation to the Examiner", "cate": "functional", "id": "DOSSPRE-164"}
{"requirement": "Each team owner will need to use a username and password in order to be authenticated to reach the team owner’s page", "cate": "security", "id": "promise-317"}
{"requirement": "When present, services to encrypt and decrypt any pattern of data using these algorithms shall be available to Applications.", "cate": "security", "id": "SecReq-399"}
{"requirement": "The system shall be able to authenticate pin entered.", "cate": "security", "id": "DOSSPRE-446"}
{"requirement": "The system shall maintain a strict documentation including comments in the source code so as to make the code easy to modify and debugging.", "cate": "security", "id": "DOSSPRE-463"}
{"requirement": "System shall start a clock when an employee logs in and stop the clock when employee logs out.", "cate": "functional", "id": "DOSSPRE-333"}
{"requirement": "The system database storing keywords will be secured against SQL injection attacks to reduce false positives.", "cate": "security", "id": "DOSSPRE-583"}
{"requirement": "The system shall identify acceptable low false positive rates", "cate": "functional", "id": "DOSSPRE-1"}
{"requirement": "The system shall generate a report outlining what effect the malware has done during execution in an isolated environment.", "cate": "security", "id": "DOSSPRE-428"}
{"requirement": "The customer environment (CNG and/or CNDs) should support a mechanism to allow service roaming", "cate": "functional", "id": "SecReq-167"}
{"requirement": "System must allow clients to run a separate routing protocol from one in ISP network.", "cate": "security", "id": "DOSSPRE-664"}
{"requirement": "The CNG shall support both routed and bridged modes of operation.", "cate": "functional", "id": "SecReq-33"}
{"requirement": "Functionalities related to Electronic Programming Guide and DRM management shall be implemented in STB or media gateway and not in CNG.", "cate": "functional", "id": "SecReq-179"}
{"requirement": "The system offers little room for a delayed data transmissions and system failures due to error handling procedures and feedbacks.", "cate": "security", "id": "DOSSPRE-705"}
{"requirement": "The CPN (CND and/or CNG) shall support a method to access a Self Configuration Server.", "cate": "functional", "id": "SecReq-116"}
{"requirement": "The system shall allow that once the agents are being released, they should be able to search the watermarked images from the hosts connected within the network.", "cate": "functional", "id": "DOSSPRE-388"}
{"requirement": "The system shall be able to distinguish the legitimate user from an illegitimate one by the use of unique behavioral biometrics", "cate": "security", "id": "DOSSPRE-479"}
{"requirement": "The system shall allow a user to login.", "cate": "functional", "id": "DOSSPRE-220"}
{"requirement": "The system shall allow health care providers to access the system through a screen based software application.", "cate": "functional", "id": "DOSSPRE-131"}
{"requirement": "In case of multicast streams the CNG should support proxy functionalities to optimize the management of information related to signalling.", "cate": "functional", "id": "SecReq-176"}
{"requirement": "The System shall be able to control a water pump for the application of water to the crops being irrigated.", "cate": "functional", "id": "DOSSPRE-296"}
{"requirement": "The CPN may support encrypted communication with remote access devices, and the encrypted communication can be terminated either at the CNG or CND.", "cate": "functional", "id": "SecReq-51"}
{"requirement": "The system shall enable motion detection", "cate": "functional", "id": "DOSSPRE-356"}
{"requirement": "The system shall be able to sniff the traffic to and from the network in real-time.", "cate": "security", "id": "DOSSPRE-883"}
{"requirement": "The system shall be developed to be available all the time.", "cate": "security", "id": "DOSSPRE-888"}
{"requirement": "The system shall allow for access levels to be implemented on patient information.", "cate": "security", "id": "DOSSPRE-564"}
{"requirement": "The system shall ensure easy maintainability by enforcing best practices in documentation, applying complexity avoidance strategy, and following basic programming practices.", "cate": "security", "id": "DOSSPRE-460"}
{"requirement": "The system shall monitor the virtual machine from hypervisor level.", "cate": "functional", "id": "DOSSPRE-231"}
{"requirement": "The system shall allow approved certified health providers to append information into the encrypted central server.", "cate": "security", "id": "DOSSPRE-560"}
{"requirement": "The system shall allow the user to embed the encrypted message and retrieve encrypted message from the image using LBS technique", "cate": "security", "id": "DOSSPRE-634"}
{"requirement": "The CPN shall support secure remote access control, based on NGN network functions.", "cate": "functional", "id": "SecReq-155"}
{"requirement": "The system shall be able to check with students laptop and university PC register and search for device matching the rogue node and corresponding student and student personal details.", "cate": "functional", "id": "DOSSPRE-31"}
{"requirement": "Each POS transaction completed at the POS device is given a S5 MAC by the PSAM, which is used by the merchant acquirer to validate that the transactions were made at a POS device with a valid PSAM. The batch total count and amount must be protected by the S4 MAC, which must also be validated by the merchant acquirer", "cate": "security", "id": "SecReq-278"}
{"requirement": "The system shall enable loading/ feeding video files for processing into the system.", "cate": "functional", "id": "DOSSPRE-355"}
{"requirement": "The system shall authenticate all users.", "cate": "security", "id": "DOSSPRE-843"}
{"requirement": "The system shall allow the user to capture Vehicle Registration Number using camera", "cate": "functional", "id": "DOSSPRE-98"}
{"requirement": "The system shall allow anomalies to be curbed after detection.", "cate": "security", "id": "DOSSPRE-761"}
{"requirement": "\"If a SELECT [by name] [first or only occurrence] or SELECT [by name] [next occurrence] is received and the data field of the command message is not present, the Issuer Security Domain shall become the currently selected Application and the SELECT command is dispatched to the Issuer Security Domain,\"", "cate": "functional", "id": "SecReq-462"}
{"requirement": "The system shall  distribute authentic copies of each supplied video.", "cate": "security", "id": "DOSSPRE-870"}
{"requirement": "The system ensure a secure storage of the user patterns so as to protect against compromise attackers.", "cate": "security", "id": "DOSSPRE-589"}
{"requirement": "The system shall allow capturing of stand details such as location, district, ward and stand number.", "cate": "functional", "id": "DOSSPRE-346"}
{"requirement": "The system shall have basic data integrity checking to reduce the possibility of incorrect or invalid data being introduced.", "cate": "security", "id": "promise-41"}
{"requirement": "The framework ought to be accessible wherever it is required.  At whatever point the clients needs to make a purchase", "cate": "security", "id": "DOSSPRE-763"}
{"requirement": "The system shall allow for operation at all times.", "cate": "security", "id": "DOSSPRE-476"}
{"requirement": "The CPN (trough CNDs and/or CNG) shall support manual configuration to insert information to access IMS network (e.g. IMPU, IMPI, Shared keys, Home Network Domain or P-CSCF IP Address, etc.).", "cate": "functional", "id": "SecReq-205"}
{"requirement": "The system shall allow a user to recover unique identifiers of the node which was used to generate the node’s unique ID/fingerprint upon registration when the owner entered/joined the university with it", "cate": "security", "id": "DOSSPRE-755"}
{"requirement": "The system shall allow a lookup of registered users if requested by the authentication server.", "cate": "security", "id": "DOSSPRE-667"}
{"requirement": "The system capture and store users’ fingerprint template at the initial signing in.", "cate": "functional", "id": "DOSSPRE-128"}
{"requirement": "The system shall allow authorized user to edit patient details.", "cate": "security", "id": "DOSSPRE-686"}
{"requirement": "The system shall provide authentication service which is tested when logging into the Django admin panel (back-end) of the system when the user logs into the system by entering credentials created from command prompt when running the manage code.", "cate": "security", "id": "DOSSPRE-671"}
{"requirement": "The system shall allow a user to check netstat and recent network connections to see if rogue node it a victim of pivoting and if so trace the attacking machine.", "cate": "security", "id": "DOSSPRE-754"}
{"requirement": "The system shall provide reports on currently stored network captures", "cate": "functional", "id": "DOSSPRE-233"}
{"requirement": "The embedding module of the invisible digital watermark is implemented using the Discrete Cosine Transform (DCT).", "cate": "functional", "id": "DOSSPRE-229"}
{"requirement": "The system shall have a log in screen to allow the network administrator to log into the system", "cate": "security", "id": "DOSSPRE-575"}
{"requirement": "The system is supposed to alert the user on malicious activities and recommend an action to be taken.", "cate": "functional", "id": "DOSSPRE-175"}
{"requirement": "The system shall provide administrator with security to data to make sure that unauthorized users do not access the information.", "cate": "security", "id": "DOSSPRE-647"}
{"requirement": "\"Commands are either received on the Basic Logical Channel (logical channel number zero) or on a Supplementary Logical Channel (logical channel number other than zero). In compliance with ISO/IEC 7816-4, logical channel information shall be indicated in the class byte of the APDU command header.\"", "cate": "functional", "id": "SecReq-440"}
{"requirement": "The system shall allow a user to view mother or baby details, to add new information and update records.", "cate": "functional", "id": "DOSSPRE-315"}
{"requirement": "The system shall be able to display a printable summary for individual clinical sites  which will include information on labs being held at that site for the given quarter (Clinical site  general information on labs held at that location  dates and times of all labs held there).", "cate": "functional", "id": "promise-76"}
{"requirement": "The system shall allow the customer to upload documents.", "cate": "functional", "id": "DOSSPRE-337"}
{"requirement": "\"If no full or partial match is found at all, the currently selected Application on the Supplementary Logical Channel shall remain the selected Application and - If the SELECT [by name] command has the [first or only occurrence] parameter set, the SELECT command is dispatched to the Application, - If the SELECT [by name] command has the [next occurrence] parameter set, the OPEN shall return the appropriate error to the off-card entity.\"", "cate": "functional", "id": "SecReq-495"}
{"requirement": "The system shall allow that the user only has access to his or her permitted data.", "cate": "security", "id": "DOSSPRE-538"}
{"requirement": "The system shall be easy to transfer to another environment, including install ability", "cate": "security", "id": "DOSSPRE-436"}
{"requirement": "(i.e. using the same CND in two different CPNs declaring the same public identity). Supporting this scenario for non IMS capable CNDs is still to be discussed.", "cate": "functional", "id": "SecReq-168"}
{"requirement": "The system database should be backed up continuously at least once every for hour in order to minimize data loss in the case of a catastrophic failure.", "cate": "security", "id": "DOSSPRE-660"}
{"requirement": "The system should be easy to maintain and it should be modifiable.", "cate": "security", "id": "DOSSPRE-649"}
{"requirement": "\"The Card Issuer is responsible for Enforcing standards and policies for Application Providers governing all aspects of Applications to be provided to the Card Issuer or operated on the Card Issuer's cards,\"", "cate": "security", "id": "SecReq-348"}
{"requirement": "The system shall be able to authenticate users so that any unauthorized persons should not be granted by the system", "cate": "security", "id": "DOSSPRE-605"}
{"requirement": "The system should have access control mechanism that take into account the use of passwords and individuals access rights.", "cate": "security", "id": "DOSSPRE-650"}
{"requirement": "The system shall ensure encryption of data during transmission.", "cate": "security", "id": "DOSSPRE-502"}
{"requirement": "The system shall generate performance reports.", "cate": "functional", "id": "DOSSPRE-395"}
{"requirement": "The CND should support protocol for local authentication in CPN/CNG.", "cate": "functional", "id": "SecReq-126"}
{"requirement": "The system shall load datasets and preprocess them through tokenization and lemmatization", "cate": "functional", "id": "DOSSPRE-184"}
{"requirement": "CPN should support storage of UGC within the CPN.", "cate": "functional", "id": "SecReq-79"}
{"requirement": "The system modules are designed so that they can communicate with each other,  It applies to the hardware, software interfaces that will between the user and the machine.", "cate": "functional", "id": "DOSSPRE-172"}
{"requirement": "Multiple public identities on the same terminal shall be supported.", "cate": "functional", "id": "SecReq-58"}
{"requirement": "The system shall be able to allow logging of each user activity.", "cate": "security", "id": "DOSSPRE-614"}
{"requirement": "The system shall ensure that a secure and effective interface is established to reduce the affiliated risk of errors from inaccurate data formats.", "cate": "security", "id": "DOSSPRE-528"}
{"requirement": "The product shall remove players who have been inactive for 24 hours from the list of players.", "cate": "functional", "id": "promise-276"}
{"requirement": "The scheme provider must ensure that the entire process between merchants, merchant acquirers, card issuers, and processors is auditable and reconcilable", "cate": "security", "id": "SecReq-256"}
{"requirement": "Information relating to passwords must be confidential", "cate": "security", "id": "DOSSPRE-607"}
{"requirement": "The system shall provide web of trust reputation statistics", "cate": "functional", "id": "DOSSPRE-61"}
{"requirement": "The system should be able to carefully diagnose the real vulnerabilities when they exist based on conducting formula-based experiments.", "cate": "security", "id": "DOSSPRE-681"}
{"requirement": "The system shall allow a user to be able to retrieve information from the database.", "cate": "functional", "id": "DOSSPRE-121"}
{"requirement": "During a purchase transaction, the CEP card must ensure that it is dealing with an authentic POS device, and it must generate a signature to allow the card issuer to verify the integrity of the transaction", "cate": "security", "id": "SecReq-230"}
{"requirement": "The Network Configuration Server should be able to upload different parameter sets related to service subscription.", "cate": "functional", "id": "SecReq-113"}
{"requirement": "The Load File Data Block Hash is used in the computation of The Load File Data Block Signature", "cate": "security", "id": "SecReq-402"}
{"requirement": "The system shall allow room for error recovery", "cate": "security", "id": "DOSSPRE-899"}
{"requirement": "The system shall allow GSM to send an SMS alert message when 3 consecutive wrong attempts are entered", "cate": "functional", "id": "DOSSPRE-38"}
{"requirement": "The system will allow for a block reservation of more than one (1) car at a time", "cate": "functional", "id": "SRRP-132"}
{"requirement": "The CNG shall be equipped with an application client to be remotely manageable by the service providers for configuration, monitoring, firmware upgrade purposes. In case of multiple service providers multiple clients configuring different sets of parameters (for example referring to different services) may be present. A single parameter can be modified by a single client only.", "cate": "functional", "id": "SecReq-194"}
{"requirement": "When the hit results in sinking a ship  the product shall notify the players that the ship was sunk.", "cate": "functional", "id": "promise-295"}
{"requirement": "The system shall enable implementation of clear secure data exchange protocols and document the interfaces and the protocols being utilized.", "cate": "security", "id": "DOSSPRE-530"}
{"requirement": "The system shall reveal private information only in compliance with the organization’s information policy.", "cate": "security", "id": "promise-230"}
{"requirement": "The system shall provide visualisation in the form of graphs.", "cate": "functional", "id": "DOSSPRE-391"}
{"requirement": "The system downloader shall allow downloading of contents from the server (music store).", "cate": "functional", "id": "DOSSPRE-210"}
{"requirement": "The system shall  provide an invisible digital watermark based on Discrete Wavelet Transformation.", "cate": "functional", "id": "DOSSPRE-384"}
{"requirement": "The system shall allow a user to use Bluetooth to enable smartphone that communicates with a laptop over a short-range wireless link.", "cate": "functional", "id": "DOSSPRE-123"}
{"requirement": "The system shall be used to detect the presence of malware in an Android application, identify possible malware families and classify them accordingly into their families.", "cate": "security", "id": "DOSSPRE-427"}
{"requirement": "The system shall guarantee reliability and resilient to failure", "cate": "security", "id": "DOSSPRE-887"}
{"requirement": "The CNG Remote Management requires to manage a specific set of parameters. At least the following list of parameters shall be available: Customer Identification, Physical Line Identification, list of subscribed services, CNG IP address.", "cate": "functional", "id": "SecReq-199"}
{"requirement": "The system shall ask user to provide password.", "cate": "security", "id": "DOSSPRE-663"}
{"requirement": "The system should be able to enforce privacy of data by encryption of data during transmission.", "cate": "security", "id": "DOSSPRE-500"}
{"requirement": "At any time during a Card Session that has already contained a SELECT [by name] [first or only occurrence] command, the OPEN may receive a request to select a next Application (SELECT [by name] [next occurrence] command) on the Basic Logical Channel. The OPEN shall determine if the requested AID matches or partially matches another entry within the GlobalPlatform Registry and whether this entry is selectable.", "cate": "functional", "id": "SecReq-459"}
{"requirement": "The system shall have analysis module that will use metadata contained with the extracted information detect location data so as to create a movement map from this information", "cate": "functional", "id": "DOSSPRE-137"}
{"requirement": "The leads washing functionality will validate all leads received by the web service for valid data", "cate": "functional", "id": "promise-257"}
{"requirement": "\"The Application Provider is responsible for Providing load file data block signatures according to its own security policy for integrity and source authenticity,\"", "cate": "security", "id": "SecReq-356"}
{"requirement": "The proposed system’ logistics are easily accessed hence its availability is guaranteed when and as required.", "cate": "security", "id": "DOSSPRE-496"}
{"requirement": "Only authorized personnel can access customer records in the database.", "cate": "security", "id": "promise-222"}
{"requirement": "The vehicle inspection form will require information including model license number, vin number, damage to the vehicle, level of fuel in the tank, mileage and a section for other issues.’", "cate": "functional", "id": "SRRP-142"}
{"requirement": "The customer�s web browser shall never display a customer�s password.  It shall always be echoed with special characters representing typed characters.", "cate": "security", "id": "SRRP-75"}
{"requirement": "The Load File Data Block Hash is used in the computation of The Load Token", "cate": "functional", "id": "SecReq-403"}
{"requirement": "The system shall be designed with ease of access in mind as the data may be needed in emergency situations.", "cate": "security", "id": "DOSSPRE-794"}
{"requirement": "The system must be considered downtime impact on the business, transport unavailability and minimizing unavailability.", "cate": "security", "id": "DOSSPRE-751"}
{"requirement": "The system shall allow a user to view spam.", "cate": "functional", "id": "DOSSPRE-270"}
{"requirement": "The CNG shall able to store information related to private identities of non-IMS capable CNDs.", "cate": "functional", "id": "SecReq-60"}
{"requirement": "The CNG shall support direct intra-LAN connectivity between any appropriate pair of devices on the Customer Premises Network.", "cate": "functional", "id": "SecReq-146"}
{"requirement": "The system shall allow log capture to be a background process making the auditor’s job much easier.", "cate": "security", "id": "DOSSPRE-523"}
{"requirement": "The system shall inspect SSL certificate", "cate": "functional", "id": "DOSSPRE-8"}
{"requirement": "CNDs connected to the CPN and devoted to specific NGN managed services shall be remotely manageable.", "cate": "functional", "id": "SecReq-108"}
{"requirement": "The system shall not support reverse engineering of its source code", "cate": "security", "id": "DOSSPRE-629"}
{"requirement": "The customer�s web browser shall never display a customer�s credit card number after retrieving from the database.  It shall always be shown with just the last 4 digits of the credit card number.", "cate": "security", "id": "SRRP-76"}
{"requirement": "The diagnostic operations on the CPN by an operator shall be performed in accordance with rules protecting the users' privacy.", "cate": "security", "id": "SecReq-28"}
{"requirement": "The system shall encrypt files using AES algorithm.", "cate": "security", "id": "DOSSPRE-846"}
{"requirement": "The system shall allow authorised users to manage their files that is update and delete data from their accounts.", "cate": "security", "id": "DOSSPRE-808"}
{"requirement": "The System shall be able to allow student to view final results and degree class.", "cate": "functional", "id": "DOSSPRE-301"}
{"requirement": "If errors in the card issuer MAC are discovered by the card issuer during its processing of the transactions, a dispute mechanism, established by the scheme provider, may be used to have money refunded", "cate": "security", "id": "SecReq-257"}
{"requirement": "All additions of new users and modifications to user’s access shall be recorded on the User Report.", "cate": "security", "id": "promise-97"}
{"requirement": "The system shall  enable activation of credit or debit cards.", "cate": "functional", "id": "DOSSPRE-377"}
{"requirement": "The player will hide the trimmed files from any direct contact with user or attacker, thereby reliably depriving any illegal sharing of files.", "cate": "security", "id": "DOSSPRE-685"}
{"requirement": "The system shall provide a secure student authentication and authorisation by using security SAML tokens containing assertions about a subject for communication between trusted parties.", "cate": "security", "id": "DOSSPRE-814"}
{"requirement": "An IPTV media flow shall be terminated by a STB or by a specific device called \"media gateway\" (or \"application gateway\"). The CNG shall not terminate any IPTV flow by itself.", "cate": "functional", "id": "SecReq-173"}
{"requirement": "The system shall   be able to deny websites listed in the database.", "cate": "security", "id": "DOSSPRE-849"}
{"requirement": "The system shall be easy to maintain since the application has a clear separation of its database and logic code making it easy to sandbox the system and maintain it without affecting the whole system.", "cate": "security", "id": "DOSSPRE-481"}
{"requirement": "The CNG and the Customer Network shall provide the opportunity for a customer network administrator to perform service and network-related configuration. According to the service/network provider choices, the CNG and Customer Network may prevent - user initiated modification of network and service related parameters.", "cate": "functional", "id": "SecReq-153"}
{"requirement": "Codec requirements and capabilities for the User Equipment (including the CNG) are already defined in TS 181 005 [1] which describes service requirements and capabilities for the TISPAN NGN.", "cate": "functional", "id": "SecReq-65"}
{"requirement": "When forwarding packets from the WAN interface to the customer network, the CNG shall perform one of the following three actions, depending on the classification results: manage a number of queues corresponding to the different priorities detected in the classification phase for each packet processed, send the packets to some internal buffers or simply drop the packet.", "cate": "functional", "id": "SecReq-90"}
{"requirement": "The system shall ensure that the downtime of internet will not affect its availability as any user can still be granted or denied access to the system.", "cate": "security", "id": "DOSSPRE-477"}
{"requirement": "The system shall allow new accounts for patients, medical centres and health practitioners to be created.", "cate": "functional", "id": "DOSSPRE-127"}
{"requirement": "The MANAGE CHANNEL commands are only processed by the OPEN and are not dispatched to an Application.", "cate": "functional", "id": "SecReq-502"}
{"requirement": "The system shall  be able to register wireless connection.", "cate": "functional", "id": "DOSSPRE-383"}
{"requirement": "If a SELECT [by name] [first or only occurrence] or SELECT [by name] [next occurrence] is received and the data field of the command message is not present, the Issuer Security Domain shall become the currently selected Application and the SELECT command is dispatched to the Issuer Security Domain,", "cate": "functional", "id": "SecReq-488"}
{"requirement": "The system shall encrypt and decrypt files over a wireless connection.", "cate": "security", "id": "DOSSPRE-840"}
{"requirement": "The leads washing functionality will return the lead data supplied to the vendor along with the reason of rejection.", "cate": "functional", "id": "promise-264"}
{"requirement": "The system shall prevent any applications from being installed or uninstalled", "cate": "functional", "id": "DOSSPRE-53"}
{"requirement": "The user shall search for the preferred repair facility using vehicle  vehicle location  and radius in miles", "cate": "functional", "id": "promise-134"}
{"requirement": "The system shall generate decoy files to supply to an intruder whenever a suspicious download is detected.", "cate": "security", "id": "DOSSPRE-809"}
{"requirement": "The system shall provide storage of all important information in a secure database", "cate": "security", "id": "DOSSPRE-512"}
{"requirement": "The GlobalPlatform Environment (OPEN) supports Command Dispatch functions (Application and Security Domain selection, (Optional) Logical channel management, Command dispatching) if the underlying runtime environment does not support them:", "cate": "functional", "id": "SecReq-428"}
{"requirement": "LAN interfaces. The CNG shall be equipped with at least one Ethernet (minimum 100 Mbit/s) is interface. Optional interfaces could be present, e.g.: wireless LAN Wi-Fi Alliance certified, Powerlines, Plastic Optical Fiber, USB device and/or host, one or more FXS for analog telephony, DECT Cat-iq.", "cate": "functional", "id": "SecReq-144"}
{"requirement": "Pay on detail is the default payment arrangement for merchant acquirers to provide payment to their merchants. In this arrangement, the merchant acquirer relies on the POS transaction S5 MAC to determine acceptance. Merchants are paid only for valid POS transactions", "cate": "security", "id": "SecReq-284"}
{"requirement": "The system should be able to match current faceprint with the faceprints in database", "cate": "security", "id": "DOSSPRE-609"}
{"requirement": "The system shall allow a whistle-blower to send the message digest (message m + signature ?) using his mobile phone to Zimbabwe Anti-Corruption Commission.", "cate": "functional", "id": "DOSSPRE-68"}
{"requirement": "Program Administrators/Nursing Staff Members shall have the ability to modify information relating to a Nursing Student  including student ID  student name  phone number  e-mail  status (full time or part time)  and program of study.", "cate": "functional", "id": "promise-91"}
{"requirement": "The Disputes application shall manipulate and view business data. Users will not have direct access to data files or databases.", "cate": "security", "id": "promise-100"}
{"requirement": "The main system is centered around security on online transactions hence it is secure.", "cate": "security", "id": "DOSSPRE-764"}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add new classes for the nursing department into the system.", "cate": "functional", "id": "promise-55"}
{"requirement": "All authorized users  once authenticated must be able to logon to the Disputes System", "cate": "security", "id": "promise-95"}
{"requirement": "The OPEN may also support additional selection processes.", "cate": "functional", "id": "SecReq-452"}
{"requirement": "The system scanner may accept a certain number of URLS that should test them for selected vulnerabilities.", "cate": "security", "id": "DOSSPRE-680"}
{"requirement": "The system shall allow only authorised users to access information and it shall protect users’ data from intruders.", "cate": "security", "id": "DOSSPRE-811"}
{"requirement": "The system shall allow verification of watermarked image which is submitted twice or more by different authors to protect the owner’s copyrights", "cate": "security", "id": "DOSSPRE-437"}
{"requirement": "The system shall be detecting denial of service attacks to include service overloads, broadcast storms and also message flooding", "cate": "security", "id": "DOSSPRE-620"}
{"requirement": "The system should be able to monitor the network in real time.", "cate": "functional", "id": "DOSSPRE-133"}
{"requirement": "The system shall allow only the legitimate user to modify stored information", "cate": "security", "id": "DOSSPRE-830"}
{"requirement": "The framework shall  be accessible, wherever and whenever a client needs to make a purchase.", "cate": "security", "id": "DOSSPRE-862"}
{"requirement": "shall be able to stream purchased movie via Windows Media Player  for up to 2 days aftere purchase date.", "cate": "functional", "id": "promise-237"}
{"requirement": "The system will generate a backup of all data weekly for the purpose of data loss prevention at the headquarters", "cate": "functional", "id": "SRRP-125"}
{"requirement": "The terminal must secure transactions by retaining the card\u0083??s symmetric MACing key signature as part of the transaction", "cate": "security", "id": "SecReq-314"}
{"requirement": "\"If the card is in the Life Cycle State CARD_LOCKED or TERMINATED: - Close the Supplementary Logical Channel, if currently open, - Return the appropriate error,\"", "cate": "functional", "id": "SecReq-487"}
{"requirement": "The system shall filter harmful websites against URLs of known harmful websites.", "cate": "security", "id": "DOSSPRE-919"}
{"requirement": "A customer can only stream a movie if they purchased it  and are within the 2 day viewing period.", "cate": "security", "id": "promise-221"}
{"requirement": "The system components are not going to be degraded by weather changes such as heat or humidity even the casing will be designed to suit the prevailing weather conditions.", "cate": "security", "id": "DOSSPRE-709"}
{"requirement": "On reception at the CNG of a message to access configuration information for update and detection of authorization failure the CNG shall reject the request and manage the failure in accordance with the CPN authorization management handling policy.", "cate": "security", "id": "SecReq-11"}
{"requirement": "The system shall provide the integrity service through use of md5 hash values to prevent unauthorised modification", "cate": "security", "id": "DOSSPRE-822"}
{"requirement": "The system does not need frequent updates to its signatures as it will be learning on its own and updating its signatures on its own.", "cate": "security", "id": "DOSSPRE-572"}
{"requirement": "These merchant acquirers must then assign unique identifiers to PSAMs", "cate": "security", "id": "SecReq-242"}
{"requirement": "The CEP card verifies that the PSAM is the PSAM used in the original transaction, computes a S1 MAC using the same DES session key that was used for the purchase transaction being cancelled, and responds to the POS device with the S1 and the identification of the last transaction. If the purchase transaction to be canceled has been canceled or is not part of the active batch, the command is not allowed", "cate": "security", "id": "SecReq-268"}
{"requirement": "The system shall allow a user to do CRUD operations on record.", "cate": "functional", "id": "DOSSPRE-260"}
{"requirement": "The Zimbabwe Anti-Corruption Commission then verifies the signature using the group public key so that it will be convinced that it actually came from the organisation without the knowledge of the actual signer", "cate": "security", "id": "DOSSPRE-435"}
{"requirement": "System shall add up all hours worked by an employee per month.", "cate": "functional", "id": "DOSSPRE-334"}
{"requirement": "A purchase transaction may be reversed, prior to the removal of the CEP card from the POS device, by sending a purchase reversal command to the CEP card, The CEP card must authenticate the PSAM using certificates previously exchanged", "cate": "security", "id": "SecReq-261"}
{"requirement": "On transmission of management information from the CNG to a CND the CNG shall append a timestamp or sequence number to the outgoing message.", "cate": "security", "id": "SecReq-13"}
{"requirement": "The load device must support on-line PIN encryption or off-line PIN verification", "cate": "security", "id": "SecReq-330"}
{"requirement": "The system shall manage user profiles.", "cate": "functional", "id": "DOSSPRE-63"}
{"requirement": "The CNG shall implement an authentication failure handling policy.", "cate": "security", "id": "SecReq-4"}
{"requirement": "For the CNG management it is recommended to use a single protocol, so as to minimize the complexity and the cost of the service.", "cate": "functional", "id": "SecReq-200"}
{"requirement": "The Disputes System must provide a confirmation to the user upon the creation of a chargeback request. The confirmation must contain the following information; the dispute case number  the type of chargeback requested (pending or immediate)  and the date that the merchant response is due.", "cate": "functional", "id": "promise-115"}
{"requirement": "The CPN should support a capability to ensure QoS and call prioritization for sessions originating or terminating in the H(e)NB.", "cate": "functional", "id": "SecReq-117"}
{"requirement": "Upon registration, the system must generate a shared encryption key.", "cate": "functional", "id": "DOSSPRE-14"}
{"requirement": "When forwarding packets from the customer network to the WAN interface, the CNG shall manage a number of queues corresponding to the different priorities detected in the classification phase for each packet processed.", "cate": "functional", "id": "SecReq-188"}
{"requirement": "\"The OPEN shall Provide an interface to all Applications that ensures that the GlobalPlatform security mechanism cannot be bypassed, deactivated, corrupted or otherwise circumvented,\"", "cate": "security", "id": "SecReq-373"}
{"requirement": "The amount to be reversed is the amount of the last step of the transaction. The reversal command sent to the CEP card contains a S2 MAC computed by the PSAM", "cate": "security", "id": "SecReq-262"}
{"requirement": "The system shall allow secure uploaded files using AES algorithm with a 256-bit key.", "cate": "security", "id": "DOSSPRE-422"}
{"requirement": "The CND shall support protocol to access the NGN service layer platforms.", "cate": "functional", "id": "SecReq-128"}
{"requirement": "If the shot was marked as a miss  the product shall change the status of the offensive player to defensive", "cate": "functional", "id": "promise-300"}
{"requirement": "\"The OPEN shall use the implicit selection registration of each Application for controlling the following runtime behavioral requirements:   Identifying the Application which is implicitly selectable on the Basic Logical Channel of the current card I/O interface during the card reset or activation sequence,   Identifying the Application which is implicitly selectable when opening on the current card I/O interface a new Supplementary Logical Channel from the Basic Logical Channel.\"", "cate": "functional", "id": "SecReq-448"}
{"requirement": "The system shall automatically log out all customers after a period of inactivity.", "cate": "security", "id": "SRRP-71"}
{"requirement": "The System shall be able to autonomously schedule irrigation without farmer input.", "cate": "functional", "id": "DOSSPRE-298"}
{"requirement": "This system will provide the user with a notification on account information updates, scheduled review dates, disease outbreaks, health practitioners advice and hints on practicing proper baby health care.", "cate": "functional", "id": "DOSSPRE-318"}
{"requirement": "Only authorized users shall have access to students’ personal information.", "cate": "security", "id": "promise-37"}
{"requirement": "The system shall authenticate user credentials to view the profile.", "cate": "functional", "id": "SRRP-25"}
{"requirement": "The system shall provide a comprehensive web interface to be used to track buses on their routes.", "cate": "functional", "id": "DOSSPRE-361"}
{"requirement": "The system shall allow clients or administrator to enter the data or upload or download files from or into the system", "cate": "functional", "id": "DOSSPRE-118"}
{"requirement": "The system shall detect SQL Injection and XSS vulnerabilities for a given website or a web application", "cate": "security", "id": "DOSSPRE-420"}
{"requirement": "Only valid data shall be entered into the system.  No invalid data shall be entered into the system.", "cate": "security", "id": "promise-130"}
{"requirement": "The CNG should negotiate session parameters (bandwidth, screen resolution, codecs…) with the NGN transparently to the user.", "cate": "functional", "id": "SecReq-154"}
{"requirement": "The system ensures that the user is properly authenticated for every system access.", "cate": "security", "id": "DOSSPRE-778"}
{"requirement": "The CND directly or through the CNG must be able to access to Network Configuration Service Function avoiding any user interaction. (and so the Network Configuration Server should be able to upload different parameter related to service subscription).", "cate": "functional", "id": "SecReq-206"}
{"requirement": "The system shall be able to locate an Examiner during Road Test", "cate": "functional", "id": "DOSSPRE-162"}
{"requirement": "The system ensures that the time taken to embed the watermark is displayed along with the hash value of the image.", "cate": "functional", "id": "DOSSPRE-228"}
{"requirement": "The security level of the communication with an off-card entity does not necessarily apply to each individual message being transmitted but can only apply to the environment and/or context in which messages are transmitted.", "cate": "functional", "id": "SecReq-408"}
{"requirement": "The system should allow for quick error recovery.", "cate": "security", "id": "DOSSPRE-767"}
{"requirement": "The terminal must participate in a two-way authentication process with the card", "cate": "security", "id": "SecReq-312"}
{"requirement": "The Disputes System shall generate a User Report that details any new users that have been added and any changes to an existing user’s access level.  The report will be reviewed for auditing purposes.", "cate": "security", "id": "promise-96"}
{"requirement": "The system shall be easy to maintain as it can easily be integrated with other systems, modified or reused on other different platforms,", "cate": "security", "id": "DOSSPRE-425"}
{"requirement": "A Global Services Application shall Be able to provide services to other Applications, such as CVM services,", "cate": "functional", "id": "SecReq-388"}
{"requirement": "The system shall be installed in every employee’s mobile phone device to monitor the device apps and record the activities on the device.", "cate": "functional", "id": "DOSSPRE-407"}
{"requirement": "The system shall detect instructions based on their signatures and classify them according to severity.", "cate": "functional", "id": "DOSSPRE-232"}
{"requirement": "If the card is aware of logical channels but only supports the Basic Logical Channel, the OPEN shall respond with the appropriate error,", "cate": "functional", "id": "SecReq-436"}
{"requirement": "\"Secure memory management shall ensure that Each application's code and data (including transient session data) as well as the runtime environment itself and its data (including transient session data) is protected from unauthorized access from within the card,\"", "cate": "security", "id": "SecReq-364"}
{"requirement": "The data provided by the system should be validated and verified were possible.", "cate": "security", "id": "DOSSPRE-624"}
{"requirement": "The appropriate Security Domain may generate Receipts during Delegated Management.", "cate": "functional", "id": "SecReq-406"}
{"requirement": "The GlobalPlatform Environment (OPEN) supports Card Content Management functions (Content verification, Content loading, Content installation, Content removal, Access control rules for card content management) if the underlying runtime environment does not support them:", "cate": "functional", "id": "SecReq-429"}
{"requirement": "The capacity of the authorized entities should depend on the security policies defined by the service providers, managing the CNG.", "cate": "security", "id": "SecReq-138"}
{"requirement": "Partial AID selection as defined in section 6.4.2.1.2 - Explicit Selection, shall be supported. (Partial AID selection does not require knowledge of the full AID by the off-card entity.)", "cate": "functional", "id": "SecReq-453"}
{"requirement": "The system shall allow user to create profile and set his credential.", "cate": "functional", "id": "SRRP-24"}
{"requirement": "The system shall ensure integrity and consistency in all its processes.", "cate": "security", "id": "DOSSPRE-803"}
{"requirement": "The CNG may support mechanisms supporting nomadism of the users and their subscribed services from one physical customer environment to another.", "cate": "functional", "id": "SecReq-53"}
{"requirement": "The software is a safety-critical one and is used to perform last line of defense protection against attacks, since defects in safety-critical software can lead to serious service disruption or server down time.", "cate": "security", "id": "DOSSPRE-757"}
{"requirement": "The system shall allow the bank server to verify the credentials of users when logging in for a short period of time.", "cate": "security", "id": "DOSSPRE-831"}
{"requirement": "The product shall ensure that it can only be accessed by authorized users.  The product will be able to distinguish between authorized and unauthorized users in all access attempts", "cate": "security", "id": "promise-0"}
{"requirement": "The system shall guarantee the privacy of user data at all times.", "cate": "security", "id": "DOSSPRE-804"}
{"requirement": "The card must authenticate the terminal at the point of sale, ensuring that it is genuine and valid, and use a two-way authentication process", "cate": "security", "id": "SecReq-310"}
{"requirement": "If a full or partial match is found and this Application is in the Life Cycle State LOCKED, continue searching through the GlobalPlatform Registry for a subsequent full or partial match. In the eventuality that this locked Application is already currently selected on the Basic Logical Channel, the OPEN shall terminate this Application Session. If no subsequent full or partial match is found, the OPEN shall return the appropriate error to the off-card entity,", "cate": "functional", "id": "SecReq-466"}
{"requirement": "To on the system, The system shall provide redundancy to avoid a single point of failure and reduce interruptions which will render the system unusable.", "cate": "security", "id": "DOSSPRE-741"}
{"requirement": "Partial AID selection as defined in section 6.4.3.1.2 - Explicit Selection, shall be supported on Supplementary Logical Channels.", "cate": "functional", "id": "SecReq-483"}
{"requirement": "All load transactions are on-line transactions. Authorization of funds for load transactions must require a form of cardholder verification. The load device must support on-line encrypted PIN or off-line PIN verification", "cate": "security", "id": "SecReq-286"}
{"requirement": "System modules will be loosely coupled to allow for easy maintainability when used by the users.", "cate": "security", "id": "DOSSPRE-580"}
{"requirement": "The system shall be able to alert the control room through webpage notification if Objects exit defined routes", "cate": "functional", "id": "DOSSPRE-165"}
{"requirement": "The system shall be able to analyse the detected vulnerability.", "cate": "security", "id": "DOSSPRE-674"}
{"requirement": "The system shall differentiate systems that represent different stages of life.", "cate": "functional", "id": "DOSSPRE-369"}
{"requirement": "The system shall make it easy to trace an individual’s activities after a crime has taken place.", "cate": "security", "id": "DOSSPRE-488"}
{"requirement": "The system shall offer FuGUI statistical presentation of email spam detection and filtered emails.", "cate": "functional", "id": "DOSSPRE-262"}
{"requirement": "The system has clearly defined links and buttons that show the various functionalities that the user may require.", "cate": "functional", "id": "DOSSPRE-275"}
{"requirement": "The system’s QoS shall guarantee its availability at  99.9% uptime.", "cate": "security", "id": "DOSSPRE-857"}
{"requirement": "The system shall be able to function as desired all the time.", "cate": "security", "id": "DOSSPRE-495"}
{"requirement": "The Blockchain Land Registry system smart contract stores the data.", "cate": "functional", "id": "DOSSPRE-351"}
{"requirement": "If a user account is revoked  it can only be re-instantiated by the System Administrator.", "cate": "security", "id": "promise-98"}
{"requirement": "The system shall  use QR codes to facilitate access granting.", "cate": "security", "id": "DOSSPRE-859"}
{"requirement": "If an Application implicitly selectable on specific logical channel(s) of specific card I/O interface(s) is deleted, the Issuer Security Domain becomes the implicitly selectable Application on that logical channel(s) of that card I/O interface(s).", "cate": "functional", "id": "SecReq-447"}
{"requirement": "The system shall allow Analysis of locations prevalent crime using crowd-sourced data and reports data.", "cate": "security", "id": "DOSSPRE-748"}
{"requirement": "When a game is ended  the product shall allow each player to remove himself or herself from the list of players.", "cate": "functional", "id": "promise-308"}
{"requirement": "Once an Application becomes the selected Application on a Supplementary Logical Channel, the responsibility for subsequent command dispatching still rests with the OPEN.", "cate": "functional", "id": "SecReq-501"}
{"requirement": "When applicable a Security Domain shall Verify the authorization for Card Content changes initiated by an off-card authority,", "cate": "security", "id": "SecReq-385"}
{"requirement": "The system shall have high availability in such a way that it remains accessible online even during maintenance.", "cate": "security", "id": "DOSSPRE-796"}
{"requirement": "The system shall run over the MPLS network.", "cate": "functional", "id": "DOSSPRE-199"}
{"requirement": "The System shall allow entering  storing and modifying product formulas.", "cate": "functional", "id": "promise-207"}
{"requirement": "The system shall allow a user to be authenticated through the use of digitally signed certificates, and again single-sign-on functionality will be fused into the system to allow once off authentication as long as the session is deemed active and valid.", "cate": "security", "id": "DOSSPRE-737"}
{"requirement": "The system is a very secure system with log on credentials allowing access to only authorised members. It ensures that information is kept secured at every moment and only the right people have access to records.", "cate": "security", "id": "DOSSPRE-770"}
{"requirement": "The Load File Data Block Hash is intended to verify the integrity of a complete Load File Data Block when loaded to a GlobalPlatform card.", "cate": "security", "id": "SecReq-401"}
{"requirement": "The CNG shall classify packets entering the CPN through its WAN interface (downstream direction) according to a number of predefined priorities. Classification can be done on the basis of different layer 2 and/or layer 3 parameters.", "cate": "functional", "id": "SecReq-88"}
{"requirement": "The system shall be given a platform to select a unique watermark that will be inserted onto a document to protect data by providing ownership to the rightful people.", "cate": "security", "id": "DOSSPRE-835"}
{"requirement": "The system shall allow for easy maintenance.", "cate": "security", "id": "DOSSPRE-532"}
{"requirement": "All Applications including all Security Domains, and all Executable Load Files, shall have an entry in the GlobalPlatform Registry.", "cate": "functional", "id": "SecReq-506"}
{"requirement": "The load device sends S1 in an authorization request to the issuer", "cate": "security", "id": "SecReq-220"}
{"requirement": "The system shall be able to generate a report of the detected and analysed vulnerabilities.", "cate": "security", "id": "DOSSPRE-677"}
{"requirement": "The system shall allow a member to spontaneously form a group of n signers using group public keys which associate the group members", "cate": "functional", "id": "DOSSPRE-144"}
{"requirement": "The system shall provide invisible digital watermarking devised with use of the Discrete Cosine Transformation which encompasses the factors of complex computations and robustness.", "cate": "functional", "id": "DOSSPRE-225"}
{"requirement": "The system shall enable potential blood donors to register and answer a health history questionnaire", "cate": "functional", "id": "DOSSPRE-150"}
{"requirement": "When applicable a Security Domain shall Verify the load file data block signature when requested by the OPEN.", "cate": "security", "id": "SecReq-387"}
{"requirement": "The CNG shall allow the customer remote access to a CND in the Customer Network, for example a surveillance video camera.", "cate": "functional", "id": "SecReq-156"}
{"requirement": "The OPEN shall own the GlobalPlatform register that contains information for managing the card, Executable Load Files,Applications, Security Domain associations, and privileges.", "cate": "functional", "id": "SecReq-342"}
{"requirement": "The system shall have a modular design catering for corrective, perfective, adaptive and preventive maintenance.", "cate": "security", "id": "DOSSPRE-486"}
{"requirement": "The GlobalPlatform API shall provides services  to the card content management such as  card locking and application life cycle state update", "cate": "functional", "id": "SecReq-344"}
{"requirement": "The system shall be built to be compatible with many operating systems such as windows, android and linux.", "cate": "security", "id": "DOSSPRE-483"}
{"requirement": "The system shall allow the web application access to the social sites public profiles", "cate": "functional", "id": "DOSSPRE-83"}
{"requirement": "The system shall not permit input of wrong data type.", "cate": "security", "id": "DOSSPRE-657"}
{"requirement": "Ensure that each batch of transactions is cleared and settled once and only once", "cate": "functional", "id": "SecReq-250"}
{"requirement": "The system database must be located in a special secure server and must be backups to other servers directly at specific times to avoid loss and damage of data", "cate": "security", "id": "DOSSPRE-749"}
{"requirement": "POS transactions that were rejected for payment by the merchant acquirer are flagged with an error code indicating the type of validation failure and are forwarded to the card issuer for CEP card history information only", "cate": "functional", "id": "SecReq-285"}
{"requirement": "The Card Issuer is responsible for Generating and loading the Issuer Security Domain keys,", "cate": "security", "id": "SecReq-347"}
{"requirement": "The CNG shall classify packets coming from the CPN through its LAN interfaces (upstream direction) according to a number of predefined priorities. Classification can be done on the basis of different layer 2 and/or layer 3 parameters.", "cate": "functional", "id": "SecReq-91"}
{"requirement": "The system shall be able to record phone call in audio file forwarded with notification if parent asked for those (forward by email only)", "cate": "functional", "id": "DOSSPRE-44"}
{"requirement": "The system shall allow high availability of the application whenever the user needs it so a recovery module will be set in case of loss of the mobile phone.", "cate": "security", "id": "DOSSPRE-448"}
{"requirement": "The system shall be maintained through frequent updates.", "cate": "security", "id": "DOSSPRE-482"}
{"requirement": "The issuer host must authenticate the card upon the load/unload request", "cate": "security", "id": "SecReq-318"}
{"requirement": "The system shall create hashes of the passwords and store them upon signing up, once a user types password(s) in plain text format.", "cate": "security", "id": "DOSSPRE-775"}
{"requirement": "The system shall notify the user about any conflict in the current configuration.", "cate": "functional", "id": "SRRP-4"}
{"requirement": "The CNG shall support the connection to a STB (or media gateway) both in a bridged or in a routed mode of operation.", "cate": "functional", "id": "SecReq-174"}
{"requirement": "CNG shall be equipped with an application client to be remotely manageable by the service providers for configuration, monitoring, firmware upgrade purposes. In case of multiple service providers multiple clients configuring different sets of parameters (for example referring to different services) may be present. A single parameter can be modified by a single client only.", "cate": "functional", "id": "SecReq-99"}
{"requirement": "The table side of the display shall be split into 2 regions: sequential and temporal.", "cate": "functional", "id": "promise-7"}
{"requirement": "The system should ensure that there is maximum confidentiality and safety assurance on the information.", "cate": "security", "id": "DOSSPRE-573"}
{"requirement": "The system shall only be accessed by authorized Corporate Community Grants (CCR) employees. Users must be authenticated using their IBM intranet user name and password.", "cate": "security", "id": "promise-315"}
{"requirement": "The system shall  restrict illegal sharing of video content protected by copyright providing a secure algorithm for downloading and playback.", "cate": "security", "id": "DOSSPRE-864"}
{"requirement": "The system shall create a snapshot of the user’s usual average CPU utilization percentage, in order to subsequently be used as a basis for comparison, enabling the detection of the tremendous CPU load increase caused by cryptojacking.", "cate": "functional", "id": "DOSSPRE-71"}
{"requirement": "The system shall be able to disable/Enable applications list with keyword in SMS", "cate": "functional", "id": "DOSSPRE-50"}
{"requirement": "The system requires the patient to identify himself /herself using PHN", "cate": "security", "id": "SRRP-91"}
{"requirement": "\"At any time on an open Supplementary Logical Channel the OPEN may receive a request to either open or close a Supplementary Logical Channel. If a MANAGE CHANNEL [open] is received and the Application selected on the original Supplementary Logical Channel has no multi-selection restrictions, this Application becomes the selected Application on the newly opened Supplementary Logical Channel. If a MANAGE CHANNEL [close] is received, terminate the Application Session currently selected on the Supplementary Logical Channel indicated by the command and then close that logical channel. The Basic Logical Channel can never be closed.\"", "cate": "functional", "id": "SecReq-496"}
{"requirement": "In order to support the NGN services and intra-CPN communications, all the CNDs in the CPN shall be addressable directly or by the mean of the CNG using L2/L3 mechanisms.", "cate": "functional", "id": "SecReq-124"}
{"requirement": "The system in terms of responsiveness is a real time system such that clients can easily access medical records of baby’s at any given point in time.", "cate": "security", "id": "DOSSPRE-768"}
{"requirement": "The system shall prevent manipulation of the watermark by an unauthorised user.", "cate": "security", "id": "DOSSPRE-838"}
{"requirement": "The system shall ensure that once the account holder has provided a correct login password, he or she will receive a OTP or code sent either via the email or via the data owner’s mobile phone depending on their settings.", "cate": "security", "id": "DOSSPRE-727"}
{"requirement": "The system shall  ensure that the firewall should be able to withstand any load of traffic given to it and be able to filter it efficiently.", "cate": "security", "id": "DOSSPRE-851"}
{"requirement": "The system shall be able to implement clear secure data exchange protocols, it is ideal to implement secure protocols and document the interfaces and the protocols being utilized.", "cate": "functional", "id": "DOSSPRE-169"}
{"requirement": "To ensure card security and integrity, the GlobalPlatform is designed to support a range of secure mechanisms for: Data integrity, Resource availability, Confidentiality, Authentication.", "cate": "security", "id": "SecReq-346"}
{"requirement": "The smart contract issues the block member in which the transaction was mined in.", "cate": "functional", "id": "DOSSPRE-353"}
{"requirement": "The system shall generate a report of the detected and analyzed vulnerabilities", "cate": "functional", "id": "DOSSPRE-9"}
{"requirement": "The system shall be able to detect an approaching figure.", "cate": "functional", "id": "DOSSPRE-35"}
{"requirement": "The system shall allow whistle-blower to be able to send the message digest using his mobile phone to Zimbabwe Anti-Corruption Commission", "cate": "functional", "id": "DOSSPRE-145"}
{"requirement": "The proposed system shall provide access permissions for application data may only be changed by the system’s data administrator and data stored in the database to be hashed.", "cate": "security", "id": "DOSSPRE-501"}
{"requirement": "The CNG and CPN shall support mechanisms that prevent access to the network by unauthorized users.", "cate": "security", "id": "SecReq-137"}
{"requirement": "The system shall allow a user to log into his or her own account providing his or her own email address and password.", "cate": "security", "id": "DOSSPRE-836"}
{"requirement": "The system shall ensure that the communication of the agents and the agency or server is such that only the registered agents can report to the agency.", "cate": "security", "id": "DOSSPRE-882"}
{"requirement": "The system shall offer authentication, authorization, configuration management to prevent access to admin console.", "cate": "security", "id": "DOSSPRE-715"}
{"requirement": "The system shall allow an author who desires to protect his/her work from unauthorized use, to upload an image to embed the invisible digital watermark whenever  submitting a piece of art.", "cate": "security", "id": "DOSSPRE-692"}
{"requirement": "At any time on an open Supplementary Logical Channel, the OPEN may receive a request to select an Application on this Supplementary Logical Channel (SELECT [by name] [first or only occurrence] command). The OPEN shall determine if the requested AID matches or partially matches an entry within the GlobalPlatform Registry and whether this entry is selectable.", "cate": "functional", "id": "SecReq-484"}
{"requirement": "Only authorized personnel can access sales information.", "cate": "security", "id": "promise-224"}
{"requirement": "The system shall allow the user to view the paired devices at any time", "cate": "functional", "id": "DOSSPRE-113"}
{"requirement": "The system should have the ability to validate entered data hence reducing redundancy and duplication in the database.", "cate": "security", "id": "DOSSPRE-653"}
{"requirement": "The system shall be easy to maintain as it shall be built following best practices in documentation, complexity avoidance and good programming strategies.", "cate": "security", "id": "DOSSPRE-897"}
{"requirement": "The system should be able to secure the messages by encrypting them.", "cate": "security", "id": "DOSSPRE-490"}
{"requirement": "The system shall  encompass factors of complex computations, robustness and security.", "cate": "security", "id": "DOSSPRE-878"}
{"requirement": "The system shall use a two-way authentication system by combining keyboard activities and mouse movement biometrics to improve security.", "cate": "security", "id": "DOSSPRE-474"}
{"requirement": "The system shall allow the Zimbabwe Anti-Corruption Commission to verify the signature using the group public key so that it will be convinced that it actually came from the organisation without the knowledge of the actual signer", "cate": "security", "id": "DOSSPRE-458"}
{"requirement": "The system shall keep logs for every operation made by the user for audit trailing commitments.", "cate": "security", "id": "DOSSPRE-485"}
{"requirement": "The system shall allow every type of file to be entered for analysis", "cate": "functional", "id": "DOSSPRE-114"}
{"requirement": "Presence related information shall be sent to the NGN by the STB or the CNG (depending on the specific architectural choices, CNG could manage the presence related information on behalf of the specific device used) to enable specific services tailored on the specific user's profile.", "cate": "functional", "id": "SecReq-182"}
{"requirement": "The Disputes application shall ensure that only users with the appropriate access level are allowed to initiate dispute requests.", "cate": "security", "id": "promise-92"}
{"requirement": "The system shall implement a combination of cryptographic algorithms that are secure and have proven to be unbreakable by the current technologies, hence using these algorithms collectively strengthens the security of the system.", "cate": "security", "id": "DOSSPRE-725"}
{"requirement": "The program coding should be well documented and laid out particularly to facilitate future upgrades and additional functionality being added at a later date.", "cate": "security", "id": "DOSSPRE-626"}
{"requirement": "The system shall validate user passwords.", "cate": "security", "id": "DOSSPRE-828"}
{"requirement": "The CNG should be able to assist in establishing Rich Communication Suite sessions between CNDs, including joining/splitting voice & media streams.", "cate": "functional", "id": "SecReq-54"}
{"requirement": "The PSAM either retrieves or re-derives the DES session key used for the purchase transaction being cancelled. The POS device authenticates the CEP card using this key and the S1 MAC", "cate": "security", "id": "SecReq-269"}
{"requirement": "At OP_READY state, the runtime environment shall be  ready for execution", "cate": "functional", "id": "SecReq-417"}
{"requirement": "The system shall process all inputs to produce a WAVE audio file  Functionality", "cate": "functional", "id": "DOSSPRE-403"}
{"requirement": "The system shall be able to create and enforce secure coding practices throughout the development by strictly identifying the originator of the data that is required, recognizing the data items and data structures that are necessary for exchange.", "cate": "functional", "id": "DOSSPRE-159"}
{"requirement": "The system should be able to identify the current location of the patient in times of emergencies", "cate": "functional", "id": "DOSSPRE-155"}
{"requirement": "The system should be simple and user friendly.", "cate": "functional", "id": "DOSSPRE-322"}
{"requirement": "The system shall be able to connect to Twitter Streaming API.", "cate": "functional", "id": "DOSSPRE-409"}
{"requirement": "The system shall not leave any cookies on the customer�s computer containing the user�s password.", "cate": "security", "id": "SRRP-73"}
{"requirement": "A GlobalPlatform card should support symmetric cryptography such as the Data Encryption Standard (DES) algorithm.", "cate": "security", "id": "SecReq-397"}
{"requirement": "Card issuers must provide an alphabetic currency code in each message that establishes a new currency. This alphabetic currency code and the currency exponent will be used by the load device to display currency balances. This allows the cardholder to identify the currency being displayed", "cate": "functional", "id": "SecReq-298"}
{"requirement": "Each purchase transaction is signed by the CEP card with a S6 MAC, which is used by the card issuer to validate that the transaction was made with a legitimate, not counterfeit, CEP card. The card issuer validates the CEP card\u0083??s MAC", "cate": "security", "id": "SecReq-280"}
{"requirement": "The system user interface shall communicate with the Blockchain Land Registry smart contract using web3.js.", "cate": "functional", "id": "DOSSPRE-350"}
{"requirement": "The Disputes System must prevent users from accessing any dispute cases that do not belong to their cardholder base.", "cate": "functional", "id": "promise-103"}
{"requirement": "The software will work as long as the server upon which it is installed in running.  There are no time limits to using the software; however it is also possible to stop the software from running should there be need.", "cate": "functional", "id": "DOSSPRE-287"}
{"requirement": "The transaction signatures ensure end to end integrity of transmitted data for load, unload, and currency exchange transactions", "cate": "security", "id": "SecReq-238"}
{"requirement": "The system reports shall be delivered in industry-standard format", "cate": "functional", "id": "DOSSPRE-11"}
{"requirement": "The system shall have the ability of scanning imagines of vehicle registration numbers and undergo pattern recognition for database matching", "cate": "functional", "id": "DOSSPRE-104"}
{"requirement": "The system shall apply a mechanism to establish proof of identities, to verify who a particular user is.", "cate": "security", "id": "DOSSPRE-555"}
{"requirement": "The system should work all the time and provide a means to handle errors with little or no input from the user.", "cate": "security", "id": "DOSSPRE-541"}
{"requirement": "A suitably authorized CPN user (e.g. the system administrator) shall be able to manage and configure the provisioning, capabilities and use of NGN managed services from an NGN access point outside the CPN.", "cate": "functional", "id": "SecReq-104"}
{"requirement": "The system shall enable administration services from login, doing the exchange and in addition client re-verification.", "cate": "functional", "id": "DOSSPRE-294"}
{"requirement": "If the card is in the Life Cycle State CARD_LOCKED or TERMINATED, return the appropriate error.", "cate": "functional", "id": "SecReq-475"}
{"requirement": "If the POS device supports multiple applications or multiple transaction types, an interaction between the terminal and consumer or sales agent determines the CEP application and the function to be performed (cancel last purchase transaction)", "cate": "functional", "id": "SecReq-267"}
{"requirement": "If the card is in the Life Cycle State CARD_LOCKED or TERMINATED, return the appropriate error,", "cate": "functional", "id": "SecReq-497"}
{"requirement": "The system should be able to capture windows log files independent from the Window Operating System", "cate": "functional", "id": "DOSSPRE-105"}
{"requirement": "The system shall allow individual facility  servers to remain unaffected when the central server fails.", "cate": "security", "id": "DOSSPRE-561"}
{"requirement": "The system shall allow capturing of the National ID for a person the stand is issued to.", "cate": "functional", "id": "DOSSPRE-345"}
{"requirement": "\"In the card Life Cycle State CARD_LOCKED: - If the Application being selected has the Final Application privilege, this Application is re-selected and a warning is returned to the off-card entity, - If any other Application is being selected, the Application with the Final Application privilege remains selected and an error is returned to the off- card entity,\"", "cate": "functional", "id": "SecReq-461"}
{"requirement": "Media flows (data plane) transcoding shall be performed by STB or media gateway and not by the CNG.", "cate": "functional", "id": "SecReq-75"}
{"requirement": "The NGN network should be provided with a CND location information.", "cate": "functional", "id": "SecReq-169"}
{"requirement": "The system shall ensure device in one ODPF area must not communicate with another in a different OSPF area.", "cate": "security", "id": "DOSSPRE-665"}
{"requirement": "In the eventuality that the current Application Session has been terminated and no subsequent full or partial match is found, the OPEN shall make an attempt to select the Application that is marked as implicitly selectable on the Basic Logical Channel for the current card interface.", "cate": "functional", "id": "SecReq-470"}
{"requirement": "After the CEP card is inserted in the POS device, the POS device initiates the cancel last purchase transaction", "cate": "functional", "id": "SecReq-266"}
{"requirement": "The system shall execute its tasks accurately when issued a command. Testing will ensure that all functions are properly included.", "cate": "security", "id": "DOSSPRE-780"}
{"requirement": "If a SELECT [by name] [next occurrence] is received, the search always begins from the entry following the currently selected Application on this Supplementary Logical Channel in the GlobalPlatform Registry,", "cate": "functional", "id": "SecReq-490"}
{"requirement": "At any time during a Card Session the OPEN may receive a request to select an Application on the Basic Logical Channel (SELECT [by name] [first or only occurrence] command). The OPEN shall determine if the requested AID matches or partially matches an entry within the GlobalPlatform Registry and whether this entry is selectable.", "cate": "functional", "id": "SecReq-458"}
{"requirement": "Share one or more MAC keys with connecting processors, create a MAC on each transmission sent to another processor, and verify the MAC on each transmission received from another processor", "cate": "security", "id": "SecReq-253"}
{"requirement": "The PSAM in the POS device generates a merchant acquirer S5 MAC for the transaction, computes a new S4 MAC on the updated batch total count and amount, and logs the transaction", "cate": "security", "id": "SecReq-263"}
{"requirement": "The system will cater for its ability to be extended with more features and functionalities without compromising its original one or affecting the operations of the user.", "cate": "security", "id": "DOSSPRE-713"}
{"requirement": "The issuer needs only to authenticate the card, and the card needs only to authenticate the issuer and that the data is the same as used by the issuer", "cate": "security", "id": "SecReq-226"}
{"requirement": "The system should be able to analyse the captured logs using a visual approach", "cate": "functional", "id": "DOSSPRE-106"}
{"requirement": "The Disputes System shall accurately provide a list of possible reason codes for a given transaction.  The list of possible reason codes must be derived based on the type of transaction and the industry that the merchant belongs to  according to the business rules defined for the Disputes System.", "cate": "functional", "id": "promise-117"}
{"requirement": "The system users shall be able to access the system using an existing hard to guess password.", "cate": "security", "id": "DOSSPRE-777"}
{"requirement": "Tokens shall be verified by the appropriate Security Domain.", "cate": "security", "id": "SecReq-405"}
{"requirement": "The CEP card authenticates the PSAM using the certificates previously received and the S2, The CEP card increments the value of the purse and logs the transaction", "cate": "security", "id": "SecReq-264"}
{"requirement": "The system shall allow a user to sign a document on behalf of the group using his secret key", "cate": "security", "id": "DOSSPRE-457"}
{"requirement": "The system shall be able to store transaction information.", "cate": "functional", "id": "DOSSPRE-321"}
{"requirement": "\\tOnly authorized user shall access the RFS system. ONLY users that exist in the UAS system  with the RFS system assigned to their role(s)  shall access the RFS system and use it.", "cate": "security", "id": "promise-319"}
{"requirement": "Operational rights for each user/terminal can be defined", "cate": "security", "id": "SRRP-189"}
{"requirement": "The system survives under its boundaries, which also sets limits to its operations, and the limits make up the restrictions.", "cate": "security", "id": "DOSSPRE-553"}
{"requirement": "The system shall offer user authentication before any user is granted access to the services.", "cate": "security", "id": "DOSSPRE-873"}
{"requirement": "The Disputes application shall ensure that only authorized users are allowed to logon to the application.", "cate": "security", "id": "promise-94"}
{"requirement": "The product shall have audit capabilities.The product shall store messages for a minimum of one year for audit and transaction tracking purposes.", "cate": "security", "id": "promise-314"}
{"requirement": "An Application AID may be the same as that of an Executable Module but may not be the same as that of an Executable Load File or the same as another Application already present in the GlobalPlatform Registry.", "cate": "functional", "id": "SecReq-508"}
{"requirement": "The system shall have encrypt and decrypt modules in place to attain better and improved security, for containing privacy invasions in overall.", "cate": "security", "id": "DOSSPRE-703"}
{"requirement": "When applicable a Security Domain shall Generate receipts for load, install, extradition, and delete,", "cate": "functional", "id": "SecReq-386"}
{"requirement": "This system provides ability to register a mother who comes to the Healthcare Centre for the first time.", "cate": "functional", "id": "DOSSPRE-311"}
{"requirement": "The system shall allow the user to set an email-change password, so that it will subsequently be requested when attempting to change the set user’s email address.", "cate": "security", "id": "DOSSPRE-467"}
{"requirement": "The system shall employ good coding principles like loose coupling of modules for easy maintainance.", "cate": "security", "id": "DOSSPRE-904"}
{"requirement": "A GlobalPlatform card offers Integrity and authentication - in which the receiving entity (the card or off-card entity) ensures that the data being received from the sending entity (respectively the off-card entity or card) actually came from an authenticated entity in the correct sequence and has not been altered,", "cate": "security", "id": "SecReq-411"}
{"requirement": "The system shall have high availability wherever it is needed.", "cate": "security", "id": "DOSSPRE-670"}
{"requirement": "The system shall enable the radiologist to verify the integrity of stored images through the PoR functionality.", "cate": "security", "id": "DOSSPRE-746"}
{"requirement": "The system shall use symmetric key encryption AES and asymmetric encryption key on the browser/client side to secure confidentiality of information.", "cate": "security", "id": "DOSSPRE-815"}
{"requirement": "At OP_READY state, issuer security domain shall be implicitly selected application for all card interfaces", "cate": "functional", "id": "SecReq-418"}
{"requirement": "In the case of an unsuccessful completion, exception processing outlined in the On-line Exception Processing section is performed", "cate": "functional", "id": "SecReq-229"}
{"requirement": "The system should be easy to maintain such that the modules should easily interact effectively and in case of failure, a re-initialization of the program is recommended.", "cate": "security", "id": "DOSSPRE-514"}
{"requirement": "The system shall capture user’s keyboard typing pattern and mouse movement pattern during registration.", "cate": "functional", "id": "DOSSPRE-75"}
{"requirement": "The system shall be able to accept data from previous projects for the learning process.", "cate": "functional", "id": "DOSSPRE-307"}
{"requirement": "The system shall implement clear secure data exchange protocols, it is ideal to implement secure protocols and document the interfaces and the protocols being utilized.", "cate": "functional", "id": "DOSSPRE-160"}
{"requirement": "Only authorized users shall have access to clinical site information.", "cate": "security", "id": "promise-35"}
{"requirement": "The system components shall be built with reusability so it can be integrated into other systems.", "cate": "security", "id": "DOSSPRE-802"}
{"requirement": "The display shall have two regions:  left 2/3 of the display is graphical  right 1/3 of the display is a data table", "cate": "functional", "id": "promise-5"}
{"requirement": "If a SELECT [by name] [first or only occurrence] is received, the search always begins from the start of the GlobalPlatform Registry,", "cate": "functional", "id": "SecReq-489"}
{"requirement": "When present during the loading of a Load File to the card, each signature shall be verified by the appropriate Security Domain.", "cate": "security", "id": "SecReq-404"}
{"requirement": "The system shall maintain audit logs", "cate": "security", "id": "DOSSPRE-798"}
{"requirement": "The system shall be flexible and adapts to changes.", "cate": "security", "id": "DOSSPRE-875"}
{"requirement": "The system shall secure the network by SSL to encrypt sensitive data before it travels within a network and decrypt it when it arrives at an agent server.", "cate": "security", "id": "DOSSPRE-881"}
{"requirement": "The system shall have an optional email field for recovery in case one forgets password the reset link will be sent to that email with instructions", "cate": "security", "id": "DOSSPRE-645"}
{"requirement": "The system shall enable specific logs from the computers to be captured and faultlessly interfaced with the web-based application with the help of security mechanism including HMAC and PGP.", "cate": "security", "id": "DOSSPRE-527"}
{"requirement": "The architecture for the electronic purse should not preclude the eventual deployment of a variety of devices to meet the needs of many card acceptance environments. Unload must not be precluded from being supported on any or all of these devices at the option of the acquirer", "cate": "functional", "id": "SecReq-333"}
{"requirement": "The system shall be able to encrypt communication", "cate": "security", "id": "DOSSPRE-599"}
{"requirement": "The CND directly or through the CNG must be able to access to Network Configuration Service Function without involving any user interaction.", "cate": "functional", "id": "SecReq-112"}
{"requirement": "Use of a central database to enable real time data capturing and manipulation to facilitate access to laptop details from any computer connected to the database.", "cate": "security", "id": "DOSSPRE-655"}
{"requirement": "The system shall generate and send periodic logs to the parent’s smartphone.", "cate": "security", "id": "DOSSPRE-921"}
{"requirement": "The CND should be able to support bootstrap capabilities in order to retrieve network configuration data to connect the NGN.", "cate": "functional", "id": "SecReq-114"}
{"requirement": "In case of unmanaged services, user shall be able to access a QoS configuration function implemented in the CNG.", "cate": "functional", "id": "SecReq-193"}
{"requirement": "The system shall allow traffic data in the form of HTTP requests/packets are sent back and forth from client to server during normal service provision.", "cate": "functional", "id": "DOSSPRE-205"}
{"requirement": "The system shall ensure that the user can only download if registered with the server.", "cate": "security", "id": "DOSSPRE-866"}
{"requirement": "The OPEN shall Check application access rules according to the Applications' privileges,", "cate": "security", "id": "SecReq-374"}
{"requirement": "The system shall allow a user to manage their own password.", "cate": "security", "id": "DOSSPRE-736"}
{"requirement": "The system shall be able to do random check on connection.", "cate": "security", "id": "DOSSPRE-841"}
{"requirement": "The reports for theIntrusionD Module as well as the reports and result of the Evidence Collection Module will be presented on a web based graphical user interface using the python web framework, Flask.", "cate": "functional", "id": "DOSSPRE-238"}
{"requirement": "When the hit results in sinking a ship  the product shall indicate the type of ship sunk on the defensive grid of the defensive player.", "cate": "functional", "id": "promise-297"}
{"requirement": "The system security shall add an extra layer of defense making it difficult for an adversary to successfully gain unauthorized access to the system and compromise the integrity of the stored data.", "cate": "security", "id": "DOSSPRE-728"}
{"requirement": "The system player shall rearrange correctly the random trimmed song parts.", "cate": "functional", "id": "DOSSPRE-216"}
{"requirement": "The product shall ensure that only supervisors can enter a caller’s schedule.The product must ensure that supervisors are allowed to access advertise empty time slots.", "cate": "security", "id": "promise-310"}
{"requirement": "CNG shall support mechanisms allowing the CNDs remote management when applicable.", "cate": "functional", "id": "SecReq-203"}
{"requirement": "The System shall be able to allow lecturer to add students’ final marks.", "cate": "functional", "id": "DOSSPRE-300"}
{"requirement": "The system shall offer error handling capabilities.", "cate": "security", "id": "DOSSPRE-912"}
{"requirement": "The system should be able to carry out authentication of the user through user name and password", "cate": "security", "id": "DOSSPRE-493"}
{"requirement": "The CNG shall support intra-CPN communication between IMS and non-IMS capable CNDs.", "cate": "functional", "id": "SecReq-166"}
{"requirement": "Each patient shall have the following mandatory information: first name, last name, phone number, personal health number, address, postal code, city, country, patient identification number.", "cate": "functional", "id": "SRRP-89"}
{"requirement": "The system should be able to produce an audit report summary to send to the user of the system.", "cate": "security", "id": "DOSSPRE-521"}
{"requirement": "Authorizations for load transactions require a form of cardholder authentication for funds requests", "cate": "security", "id": "SecReq-329"}
{"requirement": "The system shall be updated with patches and newer versions when required", "cate": "security", "id": "DOSSPRE-445"}
{"requirement": "The system shall allow users to upload data files of any type to their cloud accounts with a description of not less than 5 words.", "cate": "functional", "id": "DOSSPRE-358"}
{"requirement": "The system shall enable the systems administrator to log on to the website in order to view the notification messages.", "cate": "security", "id": "DOSSPRE-918"}
{"requirement": "The system shall allow access to authorised users only.", "cate": "security", "id": "DOSSPRE-891"}
{"requirement": "The website shall allow any updating of a client’s KYC information.", "cate": "functional", "id": "DOSSPRE-343"}
{"requirement": "The system shall be able to calculate performance of each user.", "cate": "functional", "id": "DOSSPRE-303"}
{"requirement": "If a full or partial match is found and this Application cannot be selected due to a multi-selection restriction or because the Application refuses selection (e.g. because it does not support the current card interface), continue searching through the GlobalPlatform Registry for a subsequent full or partial match. If no subsequent full or partial match is found, the OPEN shall return the appropriate error to the off-card entity,", "cate": "functional", "id": "SecReq-467"}
{"requirement": "The system shall distribute keys for the RSA digital signature.", "cate": "functional", "id": "DOSSPRE-359"}
{"requirement": "The capacity to do things right will depend on the monitoring tasks definition.", "cate": "functional", "id": "DOSSPRE-289"}
{"requirement": "The system executable files can be uploaded on online storages and can be downloaded and used by the next person on the other end.", "cate": "functional", "id": "DOSSPRE-241"}
{"requirement": "The system shall be capable of Malware detection and classify of both known and unknown Malware into their respective families.", "cate": "security", "id": "DOSSPRE-929"}
{"requirement": "On reception at the CNG of a message containing management information the CNG shall extract the timestamp or sequence number and verify that the message has not been replayed.", "cate": "security", "id": "SecReq-14"}
{"requirement": "A transaction collection process must exist. Data being transmitted from the POS devices must be transmitted in a manner that ensures integrity of the data", "cate": "security", "id": "SecReq-273"}
{"requirement": "The system shall support embedding or retrieving message from the image without user errors.", "cate": "functional", "id": "DOSSPRE-190"}
{"requirement": "The CNG shall be associated with a unique Hardware ID to be used for identification NGN side.", "cate": "functional", "id": "SecReq-197"}
{"requirement": "The system’s digital watermark agency shall control the remote network as an administrator and that is where the agents are stored.", "cate": "functional", "id": "DOSSPRE-387"}
{"requirement": "The CNG shall support mechanisms to authenticate itself to the NGN for service usage purposes.", "cate": "security", "id": "SecReq-22"}
{"requirement": "The system shall allow easy storage retrieval and manipulation of data", "cate": "functional", "id": "DOSSPRE-120"}
{"requirement": "The CPN shall support remote access, based on NGN network functions.", "cate": "functional", "id": "SecReq-43"}
{"requirement": "A list of all disputes cases that meet the entered search criteria must be provided to the user.  The list of cases must differentiate the type and/or status of the case by color -coding the line item in the list.  For example all open cases will be yellow and all closed cases will be gray.", "cate": "functional", "id": "promise-120"}
{"requirement": "The system shall allow users to answer questions on their profile after they are requested to fill in questions at registration which will be used as challenge questions when password is forgotten.", "cate": "security", "id": "DOSSPRE-806"}
{"requirement": "The system shall ensure that if login credentials are valid, the flow control of the user logging in will pass into the system, otherwise it directs the user back to the login page, and if no information is found, the user should input another licence number, or vehicle registration number.", "cate": "security", "id": "DOSSPRE-510"}
{"requirement": "The CNG shall support a mechanism allowing the support of call forking towards customer non-IMS capable devices and shall able to store information related to private identities of non-IMS capable CNDs.", "cate": "functional", "id": "SecReq-164"}
{"requirement": "Only registered customers can purchase streaming movies.", "cate": "security", "id": "promise-220"}
{"requirement": "The number of possible values defining the packet priority and, by consequence, the number of queues managed in the downstream direction shall be coherent with the number of concurrent services (data, communication, entertainment) to be treated and supported.", "cate": "functional", "id": "SecReq-89"}
{"requirement": "The CNG should support redirection of IP Multimedia sessions, as defined by TS 181 005 [1], independently from the type of device used (NGN terminal or other CND).", "cate": "functional", "id": "SecReq-39"}
{"requirement": "The system shall generate Using Time-based Passwords via the Google- Authenticator Application.", "cate": "security", "id": "DOSSPRE-825"}
{"requirement": "The merchant acquirer validates the batch to ensure that it has been transmitted correctly and enters it into the log", "cate": "functional", "id": "SecReq-275"}
{"requirement": "The system has got an audit or logging mechanism which enables the user to check and view if there were other malicious activities that have been happening when after they logged out of the system.", "cate": "security", "id": "DOSSPRE-729"}
{"requirement": "This AID may be specified in a SELECT command to select the Application. It is not possible to select Executable Load Files or Executable Modules.", "cate": "functional", "id": "SecReq-509"}
{"requirement": "The system shall analyse the captured activities and then give a notification to the system administrator by uploading the information on the web.", "cate": "functional", "id": "DOSSPRE-408"}
{"requirement": "The system shall automatically acquire a forensic image of the compromised VM main memory upon detection of a severe intrusion.", "cate": "security", "id": "DOSSPRE-697"}
{"requirement": "For each class within a sequence for a cohort  Program Administrators and Nursing Staff Members shall be able to specify which quarter that class will be offered.", "cate": "functional", "id": "promise-50"}
{"requirement": "The system shall be able to identify acceptable low false positive rates.", "cate": "security", "id": "DOSSPRE-675"}
{"requirement": "The system should be computer based.", "cate": "functional", "id": "DOSSPRE-197"}
{"requirement": "The system shall be able to carefully diagnose the real vulnerabilities when they exist based on conducting formula-based experiments.", "cate": "functional", "id": "DOSSPRE-6"}
{"requirement": "The system shall be up and running all the time as long as the smartphone is in use to monitor the child’s activities.", "cate": "security", "id": "DOSSPRE-924"}
{"requirement": "A CPN user shall be able to configure any unmanaged service provided to the user.", "cate": "functional", "id": "SecReq-105"}
{"requirement": "The system shall allow users to create a cloud account.", "cate": "functional", "id": "DOSSPRE-357"}
{"requirement": "The CNG and the CPN shall be able to support parental control related functionalities limiting the use of the broadband connection on a user or time basis. Limitations on a content basis may be shared with devoted network servers.", "cate": "security", "id": "SecReq-30"}
{"requirement": "The system shall allow a Program Administrator or Nursing staff member to remove a student from a clinical lab section.", "cate": "functional", "id": "promise-70"}
{"requirement": "Internally to the CPN, a CNG transmitting private or other critical information (i.e. to a CND) shall protect the data from unauthorised disclosure.", "cate": "security", "id": "SecReq-0"}
{"requirement": "The system shall have a database for storing of user accounts and particulars of the registered users.", "cate": "functional", "id": "DOSSPRE-202"}
{"requirement": "Load and unload functions must be authenticated using end-to-end security between the card and the card issuer", "cate": "security", "id": "SecReq-317"}
{"requirement": "The system should allow for error recovery.", "cate": "security", "id": "DOSSPRE-771"}
{"requirement": "At any time during a Card Session the OPEN may receive a request on the Basic Logical Channel to either open or close a Supplementary Logical Channel.", "cate": "functional", "id": "SecReq-471"}
{"requirement": "Only registered realtors shall be able to access the system.", "cate": "security", "id": "promise-21"}
{"requirement": "The system shall capture network traffic between the hypervisor and the subject/monitored virtual machine.", "cate": "security", "id": "DOSSPRE-696"}
{"requirement": "\"When applicable a Security Domain shall Communicate with off-card entities in accordance with its Security Domain Provider's security policy in Pre-Issuance and Post-Issuance,\"", "cate": "security", "id": "SecReq-380"}
{"requirement": "The system shall  lock automatically after the connection is lost.", "cate": "security", "id": "DOSSPRE-872"}
{"requirement": "Each Trusted Framework present on the card shall Ensure that incoming messages are properly routed unaltered to their intended destinations,", "cate": "security", "id": "SecReq-371"}
{"requirement": "The system should be able to match RFID card/tag id with the user’s face/person id to make for access to be granted", "cate": "security", "id": "DOSSPRE-610"}
{"requirement": "The CNG and devices shall support mechanisms to identify and share information about the customer network devices (e.g. type of device and basic capabilities, services supported etc.) within the customer environment. Some of this information can be used locally, while a subset of it can be forwarded to the NGN.", "cate": "functional", "id": "SecReq-148"}
{"requirement": "The product shall have the ability to send meeting reminders to employees.", "cate": "functional", "id": "promise-177"}
{"requirement": "The system’s classification process shall generate a report of what the effects of the malware activity during execution.", "cate": "functional", "id": "DOSSPRE-417"}
{"requirement": "The GlobalPlatform API shall provides services to the application such as card verification and security services", "cate": "security", "id": "SecReq-343"}
{"requirement": "Scheme providers must assign unique identifying numbers to merchant acquirers who provide PSAMs", "cate": "security", "id": "SecReq-241"}
{"requirement": "The classifiers (algorithms in place) must be able to classify data according to its attributes and how they can learnt.", "cate": "functional", "id": "DOSSPRE-176"}
{"requirement": "Perform the verification of signatures and certificates during a purchase and cancel last purchase transaction", "cate": "security", "id": "SecReq-249"}
{"requirement": "The system must generate reports (date time file hash status) or other outputs after the file has been scanned.", "cate": "functional", "id": "DOSSPRE-117"}
{"requirement": "A Global Services Application shall Hold the Global Services application-related data securely,", "cate": "security", "id": "SecReq-389"}
{"requirement": "The system shall analyse and record suspicious packets signatures and detects an anomaly if the following packets data matches the recorded threat related signatures.", "cate": "security", "id": "DOSSPRE-687"}
{"requirement": "On cards that are aware of logical channels, the MANAGE CHANNEL commands are only processed by the OPEN and are not dispatched to an Application.", "cate": "functional", "id": "SecReq-479"}
{"requirement": "The system shall enable verifying of the signature using the group public key so that it will be convinced that it actually came from the organization without the knowledge of the actual singer.", "cate": "security", "id": "DOSSPRE-585"}
{"requirement": "The system shall display the reviews and ratings of each product when it is selected.", "cate": "functional", "id": "SRRP-60"}
{"requirement": "The CND should be able to support one or more codecs for communication services (as defined by TS 181 005 [1]).", "cate": "functional", "id": "SecReq-132"}
{"requirement": "The system shall prompt for a password to log in to access the services", "cate": "security", "id": "DOSSPRE-516"}
{"requirement": "The system should allow users to store critical information such as allergies and conditions on a central server.", "cate": "functional", "id": "DOSSPRE-129"}
{"requirement": "The proposed system is meant to use a two-factor user authentication system which ensures that only the registered and legitimate user is able to access the system and upload or view the data.", "cate": "security", "id": "DOSSPRE-726"}
{"requirement": "The software will look at port scanning only on the host it will be deployed on, this will devote all the listen to one part of the many policies in a computer.", "cate": "security", "id": "DOSSPRE-759"}
{"requirement": "The off-card entity under the SECURE state shall be used to ensure the availability of all keys by the issuer security domain", "cate": "security", "id": "SecReq-423"}
{"requirement": "If this is not a cash load, the funds issuer needs to verify that the funds are requested by the legitimate account owner, which is normally done by the presentation of an enciphered PIN", "cate": "security", "id": "SecReq-217"}
{"requirement": "When the hit results in sinking a ship  the product shall mark the ship as sunk on the offensive grid of the offensive player.", "cate": "functional", "id": "promise-298"}
{"requirement": "Only one version of the CA public key is required in the card. This requires that the PSAMs with which the CEP card exchanges cryptograms must be capable of generating and validating cryptograms using the relevant keys from all current cards", "cate": "security", "id": "SecReq-307"}
{"requirement": "The system shall be introduced in each representative’s mobile device to screen the gadget’s applications and record the activities performed by the gadget.", "cate": "security", "id": "DOSSPRE-855"}
{"requirement": "Protection mechanisms shall be implemented to avoid that a management client could access and modify parameters that is not allow to configure.", "cate": "functional", "id": "SecReq-204"}
{"requirement": "System should allow users to download reports.", "cate": "functional", "id": "DOSSPRE-95"}
{"requirement": "The system shall be able to simulate road rules diagrams.", "cate": "functional", "id": "DOSSPRE-304"}
{"requirement": "The state TERMINATED shall be used to permanently disable all card functionality with respect to any card content management and any life cycle changes.", "cate": "functional", "id": "SecReq-427"}
{"requirement": "The system shall provide imaging ability so as to make a copy of the information contained on the mobile device which will be used during the forensics process as the test data source.", "cate": "functional", "id": "DOSSPRE-396"}
{"requirement": "The system shall offer the ability to pause and resume the refresh of data.", "cate": "functional", "id": "promise-18"}
{"requirement": "The system shall be able to allocate examination time for applicants", "cate": "functional", "id": "DOSSPRE-168"}
{"requirement": "The product shall record meeting entries.", "cate": "functional", "id": "promise-175"}
{"requirement": "In the case of a reversal, the CEP card must re-authenticate the PSAM", "cate": "security", "id": "SecReq-232"}
{"requirement": "Unload and currency exchange transactions are optional for CEP card issuers. The CEP card must indicate whether the card issuer supports these transactions. However, if a card issuer issues multi-currency capable cards, it must provide its cardholder with a facility to remove any remaining value. As a result, if a card issuer supports loading of multiple currencies onto a card, then it must support the unload or currency exchange transaction or both", "cate": "functional", "id": "SecReq-294"}
{"requirement": "The time period during which a cardholder can unload electronic value, perform a purchase or a currency exchange from an expired card may be determined by each issuer", "cate": "functional", "id": "SecReq-325"}
{"requirement": "The system shall be able to display final cost estimate for the cost engineers.", "cate": "functional", "id": "DOSSPRE-310"}
{"requirement": "The Issuer Security Domain is by default the implicitly selectable Application on all logical channels of all card I/O interfaces supported by the card. Implicit selection on a specific logical channel of a specific card I/O interface may be assigned only if the Issuer Security Domain is the implicitly selectable Application on that logical channel of that card I/O interface and no other Locked Application is registered as implicitly selectable for the same logical channel and card I/O interface", "cate": "functional", "id": "SecReq-444"}
{"requirement": "If a full or partial match is found and this Application is selectable (i.e. in the correct Life Cycle State and has no multi-selection restrictions), then it shall become the currently selected Application on the Basic Logical Channel and the SELECT [by name] command, whether [first or only occurrence] or [next occurrence], shall be processed according to the requirements of the runtime environment (e.g. dispatched to the Application),", "cate": "functional", "id": "SecReq-468"}
{"requirement": "The system should generate a road map from RRT to the patient and then to the nearest hospital", "cate": "functional", "id": "DOSSPRE-156"}
{"requirement": "CPN environment shall be protected with a stateful firewall function, that may be implemented in the CNG.", "cate": "security", "id": "SecReq-141"}
{"requirement": "The CND shall support protocols to access Self Configuration application (as defined in clause 4.1).", "cate": "functional", "id": "SecReq-129"}
{"requirement": "The system shall notify administrators of a proxy requesting IP address or identity.", "cate": "security", "id": "DOSSPRE-850"}
{"requirement": "The system shall display the personally identifiable information on a graphical user interface.", "cate": "functional", "id": "DOSSPRE-86"}
{"requirement": "The system shall produce encrypted payload and the message signature.", "cate": "security", "id": "DOSSPRE-905"}
{"requirement": "Send transactions to card issuers or their processors in a standard format defined in agreement with the scheme provider", "cate": "functional", "id": "SecReq-251"}
{"requirement": "The product shall ensure that only supervisors can view schedule of all callers.The product must ensure that supervisors are allowed to access advertise empty time slots.", "cate": "security", "id": "promise-311"}
{"requirement": "It shall be possible to configure the CNG (e.g. firmware downloading) according to the subscribed services. This operation may be performed when the CNG is connected to the network for the first time, for each new service subscription/modification, or for any technical management (e.g. security, patches, etc.).", "cate": "functional", "id": "SecReq-100"}
{"requirement": "The system shall generate a QR code with the md5 hash.", "cate": "functional", "id": "DOSSPRE-368"}
{"requirement": "The commands received by a GlobalPlatform card shall be processed by the OPEN or dispatched to the selected Application for processing.", "cate": "functional", "id": "SecReq-434"}
{"requirement": "The leads washing functionality will have an interface in which lead data parameters can be maintained.", "cate": "functional", "id": "promise-265"}
{"requirement": "Only adjusters can request recycled parts audit reports. No users without an adjuster role shall request recycled parts audits.", "cate": "security", "id": "promise-127"}
{"requirement": "The management of keys must be accomplished in a secure, certified environment", "cate": "security", "id": "SecReq-321"}
{"requirement": "The system shall allow the administrator to browse for the file within their local system and submit it to the analysis platform.", "cate": "functional", "id": "DOSSPRE-207"}
{"requirement": "There may be multiple certification authorities that manage keys for the system, including the possibility of one overall highest level certification authority (perhaps on an international level), and domestic certification authorities for each country or region", "cate": "security", "id": "SecReq-322"}
{"requirement": "The system shall allow a user to create an account.", "cate": "functional", "id": "DOSSPRE-219"}
{"requirement": "\"The runtime environment is responsible for Providing communication services with off-card entities that ensures the proper transmission (according to the specific communication protocol rules) of unaltered command and response messages.\"", "cate": "security", "id": "SecReq-368"}
{"requirement": "New exchange interfaces should be easily integrated into the already existing system without modifying core functionality of the product software.", "cate": "security", "id": "DOSSPRE-456"}
{"requirement": "The system should provide a functionality to allow the user to view and read temperature, humidity and soil moisture content states of the plants from nursery stage up to Harvesting.", "cate": "functional", "id": "DOSSPRE-323"}
{"requirement": "The system shall allow local Law Enforcement Agencies to track cases, location of reporter, receive crimes reported based on the reporter’s current location.", "cate": "functional", "id": "DOSSPRE-277"}
{"requirement": "It should be possible for more than one identity to be associated with a single CPN subscription.", "cate": "functional", "id": "SecReq-55"}
{"requirement": "The system shall be simple and easy to maintain.", "cate": "security", "id": "DOSSPRE-917"}
{"requirement": "The system should be able to generate USSD codes for the transaction.", "cate": "functional", "id": "DOSSPRE-88"}
{"requirement": "The system shall   notify administrator through SMS.", "cate": "functional", "id": "DOSSPRE-373"}
{"requirement": "The system shall be able to determine whether the login credentials are valid or not, and search for matching results of the particular licence owner, or vehicle information.", "cate": "security", "id": "DOSSPRE-509"}
{"requirement": "Depending on the operation mode chosen (bridged or touted) and on the type of flow treated (unicast or multicast) the CNG shall forward packets only to the physical interfaces which are connected to devices interested to the IPTV flow.", "cate": "functional", "id": "SecReq-175"}
{"requirement": "The RMS System shall have Windows XP look and feel and use GUI futures making its use intuitive.", "cate": "functional", "id": "promise-216"}
{"requirement": "The system shall be able to provide help in a short period of time.", "cate": "security", "id": "DOSSPRE-601"}
{"requirement": "The system shall put proper controls for user input validations and configuration management to resist software tempering", "cate": "security", "id": "DOSSPRE-612"}
{"requirement": "The system shall enable users to retrieve the data on demand including in cases of emergency where it should be retrieved and decrypted before it can be accessed by the medical practitioner.", "cate": "security", "id": "DOSSPRE-793"}
{"requirement": "CNDs connected to the CPN and devoted to specific managed services shall be remotely manageable", "cate": "functional", "id": "SecReq-201"}
{"requirement": "The System shall granularly control access rights to all major subsystems.  It should be possible to assign access rights to all subsystems independently.", "cate": "security", "id": "promise-203"}
{"requirement": "CNG shall perform a link layer multicast to unicast translation if the STB or media gateway are connected using customer network technologies not supporting multicast flows (e.g. powerlines, wireless).", "cate": "functional", "id": "SecReq-177"}
{"requirement": "The system shall have fault tolerance and shall have ability to do a  safe exit of the program if a problem is encountered", "cate": "security", "id": "DOSSPRE-539"}
{"requirement": "The system shall be able to inspect SSL certificate.", "cate": "security", "id": "DOSSPRE-676"}
{"requirement": "Unloads are permitted only to an account controlled by the card issuer and are performed only at a load device under the control of the card issuer", "cate": "security", "id": "SecReq-224"}
{"requirement": "Only adjusters with a supervisor role can update preferred repair facility ratings. Users without the supervisor role cannot access the repair facility ratings.", "cate": "security", "id": "promise-128"}
{"requirement": "The system should allow use of stringent passwords and different view levels to control access to data to reduce electronic fraudulent activities and unauthorized access to data.", "cate": "security", "id": "DOSSPRE-658"}
{"requirement": "The system shall be able to note hostname of rogue node as well as the SSID of the network it is connected to so as to know from which section on campus is the attack being done.", "cate": "security", "id": "DOSSPRE-443"}
{"requirement": "If a full or partial match is found and this Application is in the Life Cycle State INSTALLED, continue searching through the GlobalPlatform Registry for a subsequent full or partial match. If no subsequent full or partial match is found, the OPEN shall return the appropriate error to the off-card entity,", "cate": "functional", "id": "SecReq-491"}
{"requirement": "At OP_READY state, the OPEN shall be available and ready for execution", "cate": "functional", "id": "SecReq-416"}
{"requirement": "The system shall allow secure storage of client information.", "cate": "security", "id": "DOSSPRE-786"}
{"requirement": "The off-card entity under the OP_READY state may insert Security Domain keys  in order to maintain a cryptographic key separation from the Issuer Security Domain keys", "cate": "security", "id": "SecReq-421"}
{"requirement": "The system shall be able to send an alert message.", "cate": "functional", "id": "DOSSPRE-344"}
{"requirement": "PME Subsystem shall allow keeping submenus within menus and products within submenus in a managed and persisted order.", "cate": "functional", "id": "promise-214"}
{"requirement": "The system shall allow the publishing and viewing of Wanted/Missing Persons.", "cate": "functional", "id": "DOSSPRE-278"}
{"requirement": "The system shall be able to generate monthly reports which can be viewed by network admin when necessary.", "cate": "functional", "id": "DOSSPRE-33"}
{"requirement": "In case of huge amount of traffic in upstream or downstream directions, a congestion management mechanism shall be implemented in the CNG to minimize the impact from the user experience point of view.", "cate": "functional", "id": "SecReq-191"}
{"requirement": "The CNG shall take action according to local authentication failure handling policy (which may include silently discarding the authentication and explicit failure notification, or in the case of a replay of credentials may include notification of the true owner of the credentials) upon detection of failure during identification, authentication and authorization.", "cate": "security", "id": "SecReq-5"}
{"requirement": "The card issuer and the merchant acquirer also authenticate the transaction when they receive it", "cate": "security", "id": "SecReq-236"}
{"requirement": "The system shall ensure that the authentication server communicate with the door controller for opening and closing the door.", "cate": "functional", "id": "DOSSPRE-201"}
{"requirement": "The system shall be able to store transaction information .", "cate": "functional", "id": "DOSSPRE-404"}
{"requirement": "The system shall allow every history of scans to be recoverable in case of system interrupt", "cate": "security", "id": "DOSSPRE-550"}
{"requirement": "The system shall ensure that the watermark as an essential part of the data remains even after signal processing and data manipulation including any malicious activity", "cate": "security", "id": "DOSSPRE-879"}
{"requirement": "When the CNG detects violation of the privacy protection policy the CNG shall discard all signalling, including signalling from the NGN.", "cate": "security", "id": "SecReq-9"}
{"requirement": "The system can be configured to work with a camera, a PC and other access control system to enhance multiple factor authentication.", "cate": "security", "id": "DOSSPRE-712"}
{"requirement": "The OPEN shall support Application selection on the Basic Logical Channel via Explicit Selection through the SELECT [by name] command.", "cate": "functional", "id": "SecReq-451"}
{"requirement": "Only managers are able to perform search queries for reservations by user.  100\\% of all search queries for reservations by user shall be from logons of only management logons.", "cate": "security", "id": "promise-171"}
{"requirement": "It is a card issuer\u0083??s decision to determine the currencies that are allowed to occupy slots in the CEP card. This decision is made by the card issuer during the load or currency exchange transaction, by approving or rejecting the request to authorize the transaction", "cate": "functional", "id": "SecReq-304"}
{"requirement": "The system shall resist unofficial and unlawful usage even the action is by accident or intended.", "cate": "security", "id": "DOSSPRE-602"}
{"requirement": "The system should comply with laws governing the technology to be used", "cate": "functional", "id": "DOSSPRE-90"}
{"requirement": "The product shall ensure that only supervisors can advertise empty time slots.The product must ensure that supervisors are allowed to access advertise empty time slots.", "cate": "security", "id": "promise-309"}
{"requirement": "The card must authenticate the issuer host upon the response to the request", "cate": "security", "id": "SecReq-319"}
{"requirement": "The system shall provide maturity, fault tolerance and recoverability despite the challenges of balancing development time.", "cate": "security", "id": "DOSSPRE-459"}
{"requirement": "The system shall be able to recognize the faces detected with the image.", "cate": "functional", "id": "DOSSPRE-250"}
{"requirement": "On reception at the CNG of a message to access or update configuration information the CNG shall allow access only if the sender is an administrator.", "cate": "security", "id": "SecReq-15"}
{"requirement": "The back-end systems (multiple back-end systems may exist for a single card), which communicate with the cards, perform the verifications, and manage the off-card key databases, also shall be trusted.", "cate": "security", "id": "SecReq-393"}
{"requirement": "The system shall enable users such as medical practitioners to enter data into the system", "cate": "functional", "id": "DOSSPRE-354"}
{"requirement": "The system shall be able to input digits and display the punched digits.", "cate": "functional", "id": "DOSSPRE-36"}
{"requirement": "The CNG should support or not prevent redirection of IP Multimedia sessions, as defined by TS 181 005 [1], independently from the type of device used (NGN terminal or other CND).", "cate": "functional", "id": "SecReq-151"}
{"requirement": "The system shall be reliable as routine maintenance shall be done often.", "cate": "security", "id": "DOSSPRE-710"}
{"requirement": "The system shall have a registration page to capture and verify the details of the new user to see if the provided information conforms to the requirements of the system.", "cate": "functional", "id": "DOSSPRE-194"}
{"requirement": "The system shall be self-protective and failure proof, exception handling will ensure that the system is fail safe and gracefully stops under error conditions.", "cate": "security", "id": "DOSSPRE-781"}
{"requirement": "CPN should support user generated content (UGC) using  an NGN service.", "cate": "functional", "id": "SecReq-78"}
{"requirement": "The system server shall generate the TOTP value that lasts for the specified amount of time.", "cate": "security", "id": "DOSSPRE-832"}
{"requirement": "Expired cards must not be used for loading electronic value", "cate": "functional", "id": "SecReq-324"}
{"requirement": "PlutoMail will offer spam protection at server level and eliminates the need to install and update antispam software on each desktop.", "cate": "security", "id": "DOSSPRE-743"}
{"requirement": "The system shall be able to pre-process the unstructured data into meaning information and match with existing keywords in database.", "cate": "functional", "id": "DOSSPRE-56"}
{"requirement": "The system shall retain video logs that only have motion.", "cate": "security", "id": "DOSSPRE-461"}
{"requirement": "The system shall allow parameter inputs to be supplied using different user-friendly input components that are based on Graphical User Interface (GUI) concepts", "cate": "functional", "id": "DOSSPRE-4"}
{"requirement": "The system shall be able to forward pictures", "cate": "functional", "id": "DOSSPRE-46"}
{"requirement": "The system shall allow for checking data integrity", "cate": "security", "id": "DOSSPRE-635"}
{"requirement": "The system shall activate known commands on speech command dictation.", "cate": "functional", "id": "DOSSPRE-331"}
{"requirement": "The streaming server will have anti-virus software to prevent infection of malicious viruses.", "cate": "security", "id": "promise-233"}
{"requirement": "Subject to applicable regulation, UGC media streams may be sent directly from one CPN to one or multiple other CPN.", "cate": "functional", "id": "SecReq-80"}
{"requirement": "The system shall be able to capture and verify client KYC information.", "cate": "functional", "id": "DOSSPRE-340"}
{"requirement": "The system guarantees reliability and availability because the tools used in developing the system (Apache Kafka and Apache Storm) allows the system to be resilient to failure and to be available all the time.", "cate": "security", "id": "DOSSPRE-569"}
{"requirement": "The system should be reliable in detecting known cryptojacking malware activity.", "cate": "security", "id": "DOSSPRE-470"}
{"requirement": "The system functions as an IDS/IPD and aids in relieving traffic targeting the server, in the event that a distributed DOS attack occurs and the server is flooded with the requests and is therefore unable to provide its usual service(s) to the client.", "cate": "security", "id": "DOSSPRE-669"}
{"requirement": "The system shall allow Fingerprint Verification of the Licence Owner", "cate": "functional", "id": "DOSSPRE-99"}
{"requirement": "The run time environment shall be responsible to separate secure storage for the application code and data", "cate": "security", "id": "SecReq-335"}
{"requirement": "The CEP card authenticates the terminal using the S2 MAC and the session key from the purchase transaction being cancelled. The CEP card increments the value of the purse and logs the transaction. The CEP card verifies that the cancellation amount is equal to the amount of the last step of the purchase transaction", "cate": "security", "id": "SecReq-272"}
{"requirement": "Both IMS capable devices with or without UICC and non-IMS capable devices without UICC shall be supported.", "cate": "functional", "id": "SecReq-120"}
{"requirement": "The system shall  display message for blocked website to user.", "cate": "functional", "id": "DOSSPRE-372"}
{"requirement": "The system shall be able to predict fraudulent and non-fraudulent transactions in real time.", "cate": "functional", "id": "DOSSPRE-320"}
{"requirement": "The realtor shall be notified of new client appointments after automatic synchronization with office system", "cate": "functional", "id": "promise-31"}
{"requirement": "The system shall be able to generate periodic logs as well as collect and analyse data alerting parents whenever certain keywords are typed.", "cate": "security", "id": "DOSSPRE-923"}
{"requirement": "Vendor will submit a credit validation record to be applied to the enterprise billing system.", "cate": "functional", "id": "promise-255"}
{"requirement": "The web interface is done using CSS and bootstrap which makes it possible to use the system on mobile phones.", "cate": "functional", "id": "DOSSPRE-258"}
{"requirement": "Applications and Security Domains may access andor modify some content known or managed by the OPEN.", "cate": "functional", "id": "SecReq-433"}
{"requirement": "The HPIMS shall generate reports on bed availability about the following information: ward name, bed number, occupied/unoccupied", "cate": "functional", "id": "SRRP-88"}
{"requirement": "The CARD_LOCKED state shall has the ability to disable the selected security domain and application", "cate": "functional", "id": "SecReq-424"}
{"requirement": "The system shall provide reports on intrusions their classifications and action taken", "cate": "functional", "id": "DOSSPRE-234"}
{"requirement": "A Security Domain other than the Issuer Security Domain shall implement [at least] one Secure Channel Protocol.", "cate": "security", "id": "SecReq-396"}
{"requirement": "The system shall allow a user to delete email.", "cate": "functional", "id": "DOSSPRE-269"}
{"requirement": "Security Domains enforce the security policies of their off-card Security Domain Provider.", "cate": "security", "id": "SecReq-379"}
{"requirement": "The system shall enable a user to find web history of a machine", "cate": "functional", "id": "DOSSPRE-110"}
{"requirement": "The system should be developed with future upgrades and additional functionality being added at a later date.", "cate": "security", "id": "DOSSPRE-627"}
{"requirement": "When applicable a Security Domain shall Return to the off-card entity any receipt for load, install, extradition, and delete,", "cate": "functional", "id": "SecReq-384"}
{"requirement": "An Application installed or made selectable with a specific Implicit Selection parameter is registered in the GlobalPlatform Registry as the implicitly selectable Application on the logical channel(s) of the card I/O interface(s) indicated in the parameter if no other Application (other than the Issuer Security Domain) is already registered as implicitly selectable on that logical channel(s) of that card I/O interface(s),", "cate": "functional", "id": "SecReq-445"}
{"requirement": "The batch is sent to the merchant acquirer. Delivery may involve transmission to multiple intermediate locations or it may be direct to the merchant acquirer", "cate": "functional", "id": "SecReq-274"}
{"requirement": "The CEP card sends a response to the reversal command to the POS device. The reversal is considered to be successful even in the event of a negative response or no response from the CEP card", "cate": "functional", "id": "SecReq-265"}
{"requirement": "The system’s main screen shall include HELP and Static Analysis Tabs.", "cate": "functional", "id": "DOSSPRE-392"}
{"requirement": "On indication received at the CNG of a resource allocation expiry the CNG shall delete all residual data associated with the invocation of the resource.", "cate": "security", "id": "SecReq-17"}
{"requirement": "The system shall be available to users all the time to ensure a 24/7 service delivery and give results in a short period of time.", "cate": "security", "id": "DOSSPRE-716"}
{"requirement": "The system shall perform analysis of network traffic payloads across the organization network", "cate": "functional", "id": "DOSSPRE-222"}
{"requirement": "The system shall provide audit trails when required.", "cate": "security", "id": "DOSSPRE-565"}
{"requirement": "The system shall be able to sync with other exchange platforms for exchange prices.", "cate": "functional", "id": "DOSSPRE-65"}
{"requirement": "If the CND does not contain an ISIM/UICC, it shall support the HTTP Digest authentication or the NBA", "cate": "functional", "id": "SecReq-122"}
{"requirement": "The system connects to web application server and displays the results of the SSL connection including what SSL certificate is installed and whether it gives out the correct intermediate certificates.", "cate": "security", "id": "DOSSPRE-774"}
{"requirement": "The system enforces security administration to manage all the rights to the system features.", "cate": "security", "id": "DOSSPRE-616"}
{"requirement": "The product shall provide players no access to information that might reveal the identity of another player", "cate": "security", "id": "promise-270"}
{"requirement": "The system shall provide through the database ability to search and find a certain competent doctor who can provide help promptly, with the capability to give feedback to user in the case that no doctor is assigned in the first place.", "cate": "functional", "id": "DOSSPRE-240"}
{"requirement": "The system must also allow users to communicate securely knowing that their confidential data is safe from eavesdroppers.", "cate": "security", "id": "DOSSPRE-637"}
{"requirement": "The system shall allow the administrator to assign roles to users.", "cate": "security", "id": "DOSSPRE-790"}
{"requirement": "The product shall send a meeting confirmation to the meeting organizer.", "cate": "functional", "id": "promise-191"}
{"requirement": "The system shall utilize a centralized database", "cate": "functional", "id": "DOSSPRE-28"}
{"requirement": "The system should be able to log all activities taking place on the system for audit trial purposes", "cate": "security", "id": "DOSSPRE-608"}
{"requirement": "The proposed system will allow only a registered user to be granted access into some restricted zones within the organization.", "cate": "security", "id": "DOSSPRE-615"}
{"requirement": "The system shall  encrypt and decrypt files using a wireless connection.", "cate": "security", "id": "DOSSPRE-871"}
{"requirement": "The system shall be able to push warning script to the rogue node.'", "cate": "functional", "id": "DOSSPRE-29"}
{"requirement": "The system shall perform verification to determine user and access rights.", "cate": "security", "id": "DOSSPRE-484"}
{"requirement": "In case of managed services, the CNG shall support zero-touch provisioning to activate new services, starting from Internet access to voice and video services and shall be remotely manageable. In case of unmanaged services the user shall be able to configure the CNG by himself.", "cate": "functional", "id": "SecReq-198"}
{"requirement": "The system shall be able to input digits.", "cate": "functional", "id": "DOSSPRE-244"}
{"requirement": "The system shall display interfaces describing operations performed during processes", "cate": "functional", "id": "DOSSPRE-115"}
{"requirement": "The CNG shall support different IP address schemes and subnets on the same physical LAN port, and on different LAN ports, irrespective of routed or bridged mode of operation, allowing the direct addressability of CNDs from the NGN side in relation to data plane, control plane and management plane flows.", "cate": "functional", "id": "SecReq-147"}
{"requirement": "The system shall have inputs of WAVE audio file, message text, public key and private key. Functionality", "cate": "functional", "id": "DOSSPRE-402"}
{"requirement": "The system shall enable the detected cryptojacking domain or application to be logged, along with the date and time of detection.", "cate": "security", "id": "DOSSPRE-469"}
{"requirement": "If the card is aware of logical channels and supports at least one Supplementary Logical Channel, the OPEN shall process the command,", "cate": "functional", "id": "SecReq-437"}
{"requirement": "The system shall allow users to track case progress on previously reported cases.", "cate": "functional", "id": "DOSSPRE-280"}
{"requirement": "The system shall ensure that the system records shall be encrypted and stored in the cloud as cyphertext.", "cate": "security", "id": "DOSSPRE-797"}
{"requirement": "The system should time out after a set period of inactivity", "cate": "security", "id": "DOSSPRE-499"}
{"requirement": "The system shall send requests to clients to allow for consent of use of clients’ KYC information.", "cate": "functional", "id": "DOSSPRE-342"}
{"requirement": "The system shall allow a user to define the time segments", "cate": "functional", "id": "promise-16"}
{"requirement": "The system shall allow a user to have a functional account on the enterprise application", "cate": "functional", "id": "DOSSPRE-92"}
{"requirement": "Two-way, or mutual, authentication, where the card authenticates the terminal and the terminal authenticates the card for each transaction, must be performed for off-line transactions", "cate": "security", "id": "SecReq-308"}
{"requirement": "The system shall provide Two Factor Authentication.", "cate": "security", "id": "DOSSPRE-845"}
{"requirement": "The system shall be able to generate and send periodic logs the parent’s smartphone", "cate": "security", "id": "DOSSPRE-452"}
{"requirement": "The system shall be able to detect and combat both existing and new Malware.", "cate": "security", "id": "DOSSPRE-930"}
{"requirement": "The system shall use honeypot which records and analyses packets flowing through the network.  A honeypot is a system decoy which is used to make the attacker believe that he/she is attacking the intended system.", "cate": "security", "id": "DOSSPRE-688"}
{"requirement": "The system shall allow user to register for newsletters and surveys in the profile.", "cate": "functional", "id": "SRRP-31"}
{"requirement": "The CNG shall support mechanisms for authentication of wireless CNDs for local connectivity. Similar mechanisms may be also implemented for non-wireless devices.", "cate": "security", "id": "SecReq-136"}
{"requirement": "The system shall allow that the features be extracted when the user logs in and a similarity match done to check the authenticity of the user and if a match is successful the user will be granted access or denied in the event of a mismatch.", "cate": "security", "id": "DOSSPRE-475"}
{"requirement": "The static attributes of the system predict potential operational performance bottlenecks and future scalability problems early to allow for correction early.", "cate": "security", "id": "DOSSPRE-593"}
{"requirement": "The report of needed classes shall include (but not be limited to) classes to be offered  number of sections needed  number of labs needed  and room types needed.", "cate": "functional", "id": "promise-63"}
{"requirement": "\"On cards that support logical channels, if a MANAGE CHANNEL [open] is received:   If an Application is designated as implicitly selectable on the new Supplementary Logical Channel for the current card interface, that Application is implicitly selected on the newly opened Supplementary Logical Channel and runtime behavior requirements apply,   Otherwise the Application designated as implicitly selectable on the Basic Logical Channel for this card interface is implicitly selected on the newly opened Supplementary Logical Channel and runtime behavior requirements apply.\"", "cate": "functional", "id": "SecReq-473"}
{"requirement": "The system shall reduce the occurrence of failure in the system.", "cate": "security", "id": "DOSSPRE-739"}
{"requirement": "Data integrity scripts will be run on a weekly basis to verify the integrity of the database.", "cate": "security", "id": "promise-227"}
{"requirement": "The system shall enable users to classify messages as spam if misclassified as ham", "cate": "functional", "id": "DOSSPRE-191"}
{"requirement": "The system shall allow users to interact with the RFID and facial recognition-based-access control system.", "cate": "functional", "id": "DOSSPRE-174"}
{"requirement": "Any user who uses the system shall have a Logon ID and Password", "cate": "security", "id": "SRRP-92"}
{"requirement": "The system shall be able to interpret the analysis results", "cate": "functional", "id": "DOSSPRE-149"}
{"requirement": "The system shall be able to apply a classification algorithm for classification of the processed tweets matching with the labeled tweets in the tweet corpus.", "cate": "functional", "id": "DOSSPRE-57"}
{"requirement": "The System shall be able to allow students to view recommended careers for them.", "cate": "functional", "id": "DOSSPRE-302"}
{"requirement": "It should be possible for a service profile to be associated with each identity within a CPN subscription.", "cate": "functional", "id": "SecReq-56"}
{"requirement": "The system generated TOTP shall be a unique passcode that changes after an interval of 30 seconds.", "cate": "security", "id": "DOSSPRE-833"}
{"requirement": "The system shall be able to block internet connection to the computer doing port scanning.", "cate": "security", "id": "DOSSPRE-441"}
{"requirement": "The Application Provider is responsible for Returning receipts for load, install, delete, and extradition, according to the Card Issuer's policy.", "cate": "functional", "id": "SecReq-358"}
{"requirement": "The system shall allow that as the number of patient records increases with time and the capacity of the system to hold these records must also increase as the records increase.", "cate": "security", "id": "DOSSPRE-795"}
{"requirement": "It shall be possible for a single public identity to be associated with multiple CNDs where each association is allocated a unique private identity.", "cate": "functional", "id": "SecReq-57"}
{"requirement": "\"It is the responsibility of the Card Issuer or the Controlling Authority to set up the appropriate off-card procedures to comply with the governmental restrictions upon cryptography. Features to disable or restrict cryptography usage by Applications on a card are beyond the scope of this Specification.\"", "cate": "security", "id": "SecReq-400"}
{"requirement": "The Commissioner will be the only authorized user per league to adjust league settings.", "cate": "security", "id": "promise-318"}
{"requirement": "The system shall be able to keep reminders about a child", "cate": "functional", "id": "DOSSPRE-51"}
{"requirement": "Applications should Expose only data and resources that are necessary for proper application functionality", "cate": "security", "id": "SecReq-391"}
{"requirement": "A CPN-user attempting to invoke a CNG-mediated service shall be identified and authenticated by the CNG before being granted access to the service.", "cate": "security", "id": "SecReq-3"}
{"requirement": "The system shall produce a pop-up notification reporting the detected cryptojacking activity.", "cate": "functional", "id": "DOSSPRE-72"}
{"requirement": "The system shall allow a user to check with students laptop and university PC register and search for device matching the rogue node and corresponding student and student personal details.", "cate": "functional", "id": "DOSSPRE-284"}
{"requirement": "The system shall respond to users via voice synthesis and graphical displays.", "cate": "functional", "id": "DOSSPRE-332"}
{"requirement": "The system shall provide supervisors with ad hoc reports for decision making,’", "cate": "functional", "id": "DOSSPRE-196"}
{"requirement": "When applicable a Security Domain shall Request the OPEN to load, install, extradite, and delete card content,", "cate": "functional", "id": "SecReq-383"}
{"requirement": "The system shall prevent any media from being sent or received using Bluetooth.", "cate": "security", "id": "DOSSPRE-922"}
{"requirement": "The system is easy to maintain as it can easily be integrated with other systems, modified or reused on other different platforms", "cate": "security", "id": "DOSSPRE-723"}
{"requirement": "CNG shall be able to classify intra-LAN traffic that is simply bridged by the CNG itself within the CPN.", "cate": "functional", "id": "SecReq-189"}
{"requirement": "\"The Application Provider is responsible for Generating the keys for its own Security Domains or obtaining Security Domain keys from a trusted third party,\"", "cate": "security", "id": "SecReq-353"}
{"requirement": "The user of the software who is the administrator logs in and sets the software to run and give desired alerts from PCs scanning the server.", "cate": "functional", "id": "DOSSPRE-290"}
{"requirement": "A CND, as defined in clause 3, may use the CNG to access NGN services.", "cate": "functional", "id": "SecReq-118"}
{"requirement": "The system shall apply a classification algorithm to classify processed tweets matching with the labelled tweets in the tweets corpus.", "cate": "functional", "id": "DOSSPRE-412"}
{"requirement": "The CNG shall support use of one user identity on several terminals as well as to share one terminal with several identities.", "cate": "functional", "id": "SecReq-37"}
{"requirement": "The system shall   ensure that the client generates the symmetric key used for encryption by the server.", "cate": "functional", "id": "DOSSPRE-381"}
{"requirement": "System shall calculate the salary of each employee at the end of a month.", "cate": "functional", "id": "DOSSPRE-335"}
{"requirement": "The system finds indicators (patterns, attributes) of, or to exploit vulnerabilities known to exist, in the detected services / software versions", "cate": "security", "id": "DOSSPRE-772"}
{"requirement": "The system shall be built such that it is as secure as possible from malicious interference.", "cate": "security", "id": "promise-43"}
{"requirement": "The system shall allow background processes to be monitoring for any scan and relaying information to the registry about any unusual activities.", "cate": "security", "id": "DOSSPRE-756"}
{"requirement": "The system shall ensure that the login password is stored in encrypted format.", "cate": "security", "id": "DOSSPRE-505"}
{"requirement": "Authorized users shall be able to access NGN-based services using any NGN supported home device.", "cate": "functional", "id": "SecReq-119"}
{"requirement": "To load value into a slot of the CEP card securely, the load device establishes a connection between the issuer and the CEP card", "cate": "security", "id": "SecReq-215"}
{"requirement": "The system shall allow a member to spontaneously form a group of n signers using group public keys which associate the group members.", "cate": "security", "id": "DOSSPRE-893"}
{"requirement": "The run time environment shall responsible to establish communication services  between card and off-card entities", "cate": "functional", "id": "SecReq-336"}
{"requirement": "Facility of unique user number and Password in such a way that unauthorized user cannot log in", "cate": "security", "id": "SRRP-187"}
{"requirement": "The system shall allow for the creation of test-bed environment (web applications and/or websites that can be tested for penetration testing and hacking) where experiments should be conducted.", "cate": "functional", "id": "DOSSPRE-209"}
{"requirement": "The Application Provider is responsible for Obtaining pre-authorization for load, install, and extradition from the Card Issuer,", "cate": "functional", "id": "SecReq-357"}
{"requirement": "The system shall ensure that only authorised users are granted access.", "cate": "security", "id": "DOSSPRE-898"}
{"requirement": "Contain the details of a transaction between the initialize command for that transaction and the initialize command for the next transaction", "cate": "functional", "id": "SecReq-247"}
{"requirement": "The system shall blacklist any user that has done identity theft.", "cate": "security", "id": "DOSSPRE-818"}
{"requirement": "The runtime environment is responsible for Performing secure memory management", "cate": "security", "id": "SecReq-363"}
{"requirement": "The system shall allow to create and enforce secure coding practices through strictly identifying the sources of required data, identifying the data items and data structures required for the exchange.", "cate": "functional", "id": "DOSSPRE-252"}
{"requirement": "The system player shall play audio files.", "cate": "functional", "id": "DOSSPRE-217"}
{"requirement": "The system shall be able to detect fraudulent transactions in rea-time.", "cate": "security", "id": "DOSSPRE-908"}
{"requirement": "A CEP card may contain currencies that the load acquirer does not support. As a result, load devices must use the alphabetic issuer-supplied currency code and currency exponent from the CEP slot(s) to display the source amounts for the currency conversion transaction", "cate": "functional", "id": "SecReq-297"}
{"requirement": "The CEP application must contain data that indicates the presence of a linked financial institution. If a linked financial institution is established for the CEP application, then linked loads must be allowed and data in the application must indicate whether linked loads are supported", "cate": "functional", "id": "SecReq-292"}
{"requirement": "The system shall be maintainable as it can be integrated with other systems easily, can be modified or have its components reused on other platforms.", "cate": "security", "id": "DOSSPRE-819"}
{"requirement": "The website shall make its user aware of its information practices before collection data from them via a Privacy Policy  accessible on all pages of the website.", "cate": "security", "id": "promise-228"}
{"requirement": "The system shall be able to send an SMS and an Email to security when the detected face is not in the system’s database.", "cate": "functional", "id": "DOSSPRE-251"}
{"requirement": "The system shall be able to warn the network administrator about the possible occurrence of an intrusion attack and provide information regarding that attack.", "cate": "security", "id": "DOSSPRE-885"}
{"requirement": "The system shall  ensure the digital watermark agency is able to dispatch agents, collect and report the processed information from the visited hosts within the network.", "cate": "functional", "id": "DOSSPRE-385"}
{"requirement": "The system shall detect an accident upon impact and will automatically send an alert (SMS) to a designated phone.", "cate": "functional", "id": "DOSSPRE-362"}
{"requirement": "\"The runtime environment is responsible for Providing an interface to all Applications that ensures that the runtime environment security mechanisms cannot be bypassed, deactivated, corrupted or otherwise circumvented,\"", "cate": "security", "id": "SecReq-362"}
{"requirement": "The system’s listening for scanning is done while listening to the OS activities.", "cate": "security", "id": "DOSSPRE-758"}
{"requirement": "The system shall not require constant updating of its signature as it will be learning on its own and updating its signatures on its own.", "cate": "security", "id": "DOSSPRE-890"}
{"requirement": "The system shall be able to allow the user to generate their ECC public and private keys.  These keys are to be used for the encryption of the AES encryption key and also for PDP.", "cate": "security", "id": "DOSSPRE-719"}
{"requirement": "The CNG shall implement a privacy protection policy specifying as a minimum private and critical information.", "cate": "security", "id": "SecReq-8"}
{"requirement": "The system shall be able to allow the user to upload and download stored files.  The system shall provide a platform that allows the user to upload files for storage and also to retrieve the files by downloading them when required.", "cate": "functional", "id": "DOSSPRE-256"}
{"requirement": "The system must be scalable", "cate": "security", "id": "DOSSPRE-547"}
{"requirement": "The system should ensure only the authorized user is able to change the registered email address for receiving cryptojacking alerts.", "cate": "security", "id": "DOSSPRE-472"}
{"requirement": "The program coding should be well documented and laid out particularly to facilitate future upgrades and additional features being added at a later date.", "cate": "security", "id": "DOSSPRE-544"}
{"requirement": "If the card only supports the Basic Logical Channel and has no concept of logical channel support, the command shall be dispatched to the selected Application for processing.", "cate": "functional", "id": "SecReq-438"}
{"requirement": "The load device which supports only off-line PIN verification must support both the off-line PIN encryption method and the off-line PIN plain text verification method as defined in EMV", "cate": "security", "id": "SecReq-331"}
{"requirement": "Prior to submitting the lead to the enterprise system the leads washing functionality will assign the lead to an admissions rep.", "cate": "functional", "id": "promise-268"}
{"requirement": "Security domain shall ensure complete seperation of keys among the card issuers and other application providers", "cate": "security", "id": "SecReq-337"}
{"requirement": "The system shall have log in and log out capabilities which can be seen as the first line of security which most systems should possess for authentication and accountability purposes.", "cate": "security", "id": "DOSSPRE-901"}
{"requirement": "The CND shall be able to download and install client application services.", "cate": "functional", "id": "SecReq-130"}
{"requirement": "\"Secure memory management shall ensure that When more than one logical channel is supported, each concurrently selected Application's code and data (including transient session data) as well as the runtime environment itself and its data (including transient session data) is protected from unauthorized access from within the card,\"", "cate": "security", "id": "SecReq-365"}
{"requirement": "If the number of logical channels supported by the OPEN is not sufficient to open a new Supplementary Logical Channel, return the appropriate error.", "cate": "functional", "id": "SecReq-476"}
{"requirement": "The system must meet applicable regulatory requirements", "cate": "functional", "id": "DOSSPRE-119"}
{"requirement": "The system shall support at least 200 concurrently connected users.", "cate": "functional", "id": "DOSSPRE-125"}
{"requirement": "The system will ensure user validation will be done during login to insure that the user is valid and that the user only has access to his or her permission data.", "cate": "security", "id": "DOSSPRE-689"}
{"requirement": "Allow the user to check the integrity of stored data through the PDP NSR.", "cate": "security", "id": "DOSSPRE-424"}
{"requirement": "The system shall enforce security through the use of password protected user accounts", "cate": "security", "id": "DOSSPRE-503"}
{"requirement": "The load device also provides for verification of the identity of the cardholder (with either on-line or off-line PIN verification) and forwards verification data in the authorization request", "cate": "security", "id": "SecReq-221"}
{"requirement": "The system shall be monitoring and scanning the network", "cate": "functional", "id": "DOSSPRE-179"}
{"requirement": "The system adapts to all types of application and provides maturity, fault tolerance and recoverability.", "cate": "security", "id": "DOSSPRE-592"}
{"requirement": "The system shall notify customers of changes to its information policy.", "cate": "security", "id": "promise-229"}
{"requirement": "The system shall enable unique features to be extracted using datasets.", "cate": "functional", "id": "DOSSPRE-76"}
{"requirement": "The system is web based and therefore guarantees maximum availability of data to the cloud data owners.", "cate": "security", "id": "DOSSPRE-722"}
{"requirement": "The load acquirer needs to ensure that the issuer is the true owner of the card, and, in the case of an apparent failure of the load, the load acquirer needs the card presented to authenticate the failure", "cate": "security", "id": "SecReq-219"}
{"requirement": "\"Secure memory management shall ensure that The memory recovery process is secure and consistent in case of a loss of power or withdrawal of the card from the card reader while an operation is in progress,\"", "cate": "security", "id": "SecReq-367"}
{"requirement": "The system shall be able to compute construction cost estimate based on data and features fed by the cost engineer.", "cate": "functional", "id": "DOSSPRE-309"}
{"requirement": "The system shall be able to authenticate the username and password", "cate": "security", "id": "DOSSPRE-597"}
{"requirement": "Each user is to be configured with a unique User Name and a password that can be changed when it is necessary.", "cate": "security", "id": "DOSSPRE-651"}
{"requirement": "The system shall allow file type filtering to avoid the overloading of the normal flow information with unnecessary files.", "cate": "security", "id": "DOSSPRE-916"}
{"requirement": "The Basic Logical Channel is the permanently available interface to a GlobalPlatform card and shall be supported by the OPEN.", "cate": "functional", "id": "SecReq-449"}
{"requirement": "The system will be used by government officials to bring relevant information to the user unlike the normal web search where web information retrieval is difficult as hundreds of irrelevant documents are returned in response to a search query.", "cate": "functional", "id": "DOSSPRE-58"}
{"requirement": "The system shall provide a verification procedure, where the administrators will try to make contact with the specific bus in order to verify whether an accident has indeed taken place and the level of response required.", "cate": "functional", "id": "DOSSPRE-363"}
{"requirement": "The system shall be able to Recover unique identifiers of the node which was used to generate the node s unique ID/fingerprint upon registration when the owner entered/joined the university with it", "cate": "functional", "id": "DOSSPRE-30"}
{"requirement": "The system shall be able to block any illegitimate detections so as to render efficiently utilise system resources.", "cate": "security", "id": "DOSSPRE-590"}
{"requirement": "The system is deployed as an application on user machines thus it is cost-effective to maintain as it does not have many modules and online documentation including system documentation and test documentation for easy user acclimatization.", "cate": "security", "id": "DOSSPRE-630"}
{"requirement": "The system server shall be able to generate unique transaction IDs after every purchase or free download.", "cate": "functional", "id": "DOSSPRE-379"}
{"requirement": "The CNG may interact with the Resource and Admission Control Subsystem (RACS) as defined in ES 282 001 [9] to support remote real-time QoS control", "cate": "functional", "id": "SecReq-86"}
{"requirement": "The system shall allow the Submission and responding of complaints and alerts.", "cate": "functional", "id": "DOSSPRE-279"}
{"requirement": "The system�s back-end servers shall never display a customer�s password.  The customer�s password may be reset but never shown", "cate": "security", "id": "SRRP-77"}
{"requirement": "The system should be able to sniff the traffic to and from the network in real time’.", "cate": "security", "id": "DOSSPRE-566"}
{"requirement": "If a full or partial match is found and this Application is in the Life Cycle State LOCKED, continue searching through the GlobalPlatform Registry for a subsequent full or partial match. In the eventuality that this locked Application is already currently selected on the same Supplementary Logical Channel, the OPEN shall terminate this Application Session. If no subsequent full or partial match is found, the OPEN shall return the appropriate error to the off-card entity,", "cate": "functional", "id": "SecReq-492"}
{"requirement": "The CNG may use multiple tunnel connections for providing e.g. adequate QoS for the remote access user.", "cate": "functional", "id": "SecReq-46"}
{"requirement": "The system will have a very low False Negative Rate which means it be able to detect an actual vulnerability when it exists.", "cate": "security", "id": "DOSSPRE-679"}
{"requirement": "The system shall have the capability to inspect the SSL certificate of a given web application or a website.", "cate": "functional", "id": "DOSSPRE-326"}
{"requirement": "The system shall preserve the integrity of acquired forensic imagines by applying integrity checksums and hashes.", "cate": "security", "id": "DOSSPRE-698"}
{"requirement": "The system shall allow the administrator to register and create user accounts, the system shall capture user details like username, email address, phone number etc", "cate": "functional", "id": "DOSSPRE-187"}
{"requirement": "For each shot  the product shall notify the players whether the shot was a hit or miss.", "cate": "functional", "id": "promise-292"}
{"requirement": "The product shall allow an organizer to invite other employees to meetings.", "cate": "functional", "id": "promise-186"}
{"requirement": "The system shall enable data multiple replications.", "cate": "security", "id": "DOSSPRE-783"}
{"requirement": "The CNG and the CPN shall implement mechanisms to limit the visibility of the WAN side network and resources to authorized entities.", "cate": "security", "id": "SecReq-27"}
{"requirement": "The system shall not be vulnerable to the security attacks", "cate": "security", "id": "DOSSPRE-606"}
{"requirement": "The system shall allow a user to search and make a selection of nearby devices for handshake initiation.", "cate": "functional", "id": "DOSSPRE-203"}
{"requirement": "The cardholder must have an account relationship with the card issuer, and funds removed from the card are credited to the cardholder account only after the card issuer authenticates the card", "cate": "security", "id": "SecReq-225"}
{"requirement": "The system shall be able to be easily maintained and updated with new data that emerge since the spammers will be trying to bypass the filter with new tricks being employed.", "cate": "security", "id": "DOSSPRE-643"}
{"requirement": "The system shall be able to allow the user to check the integrity of stored data through the PDP functionality.", "cate": "security", "id": "DOSSPRE-721"}
{"requirement": "The system shall be able to log the IP address accordingly", "cate": "security", "id": "DOSSPRE-587"}
{"requirement": "The system mailbox is responsible for displaying the emails of the logged in user as well as all the spam emails and it will have a dashboard to navigate through the emails.", "cate": "functional", "id": "DOSSPRE-195"}
{"requirement": "The system shall be able to apply automatic recording of events and some incidents Security", "cate": "security", "id": "DOSSPRE-621"}
{"requirement": "The Card Issuer is responsible for Cryptographically authorizing load, install, and extradition to be performed by Application Providers.", "cate": "security", "id": "SecReq-352"}
{"requirement": "The system shall be able to detect spam messages and direct them to spam in real time", "cate": "security", "id": "DOSSPRE-638"}
{"requirement": "The system will be used at a national level offering reliability, however, it is hard to balance development time but it provides maturity, fault tolerance and recoverability.", "cate": "security", "id": "DOSSPRE-769"}
{"requirement": "System shall provide access only to legitimate users, resist unathorised users, accidental or unintended usage.", "cate": "security", "id": "DOSSPRE-747"}
{"requirement": "The system shall allow the user to check for data integrity using MD5 hash algorithm", "cate": "security", "id": "DOSSPRE-633"}
{"requirement": "The system shall be able to match current picture with database pictures", "cate": "functional", "id": "DOSSPRE-26"}
{"requirement": "The system shall ensure that confidential information can only be accessed to the right individuals.", "cate": "security", "id": "DOSSPRE-480"}
{"requirement": "Employees shall be identified by a 6 character password.", "cate": "security", "id": "DOSSPRE-782"}
{"requirement": "The system shall provide a common API for health information systems to update and read records.", "cate": "functional", "id": "DOSSPRE-130"}
{"requirement": "The system shall create a transaction sent to the Ethereum protocol.", "cate": "functional", "id": "DOSSPRE-349"}
{"requirement": "The system shall monitor CPU usage to detect spikes caused by cryptojacking by constantly reading the computer’s current CPU utilization percentage and compare it to the CPU usage baseline, and detect the extreme spikes or deviations from the usual.", "cate": "security", "id": "DOSSPRE-466"}
{"requirement": "The system shall enable block initiation and new block (record) addition onto Blockchain.", "cate": "functional", "id": "DOSSPRE-339"}
{"requirement": "The CND shall provide its registration identity, when it requires the registration to the network.", "cate": "functional", "id": "SecReq-123"}
{"requirement": "The system will allow employees with quick an efficient access to customer information.", "cate": "functional", "id": "SRRP-153"}
{"requirement": "The  system shall report the findings of the SSL certificate phase.", "cate": "functional", "id": "DOSSPRE-328"}
{"requirement": "STB or media gateways should be equipped with a programmable open API allowing the implementation of specific service logics.", "cate": "functional", "id": "SecReq-73"}
{"requirement": "The system shall be able to send phone location with a time period", "cate": "functional", "id": "DOSSPRE-45"}
{"requirement": "The system shall be able to enter new applicants into the system database", "cate": "functional", "id": "DOSSPRE-167"}
{"requirement": "The results from the scanning process must be reliable, which means minimum or no false positives", "cate": "security", "id": "DOSSPRE-549"}
{"requirement": "The system shall be able to display the punched digits.", "cate": "functional", "id": "DOSSPRE-245"}
{"requirement": "\"For all commands, if the command indicates a Supplementary Logical Channel that is not opened then:   If the card only supports the Basic Logical Channel and has no concept of logical channel support, the command shall be dispatched to the selected Application for processing.   If the card is aware of logical channels, the OPEN shall respond with the appropriate error. (This requirement may exclude the SELECT command, if the card supports opening of a logical channel using the SELECT command.)\"", "cate": "functional", "id": "SecReq-441"}
{"requirement": "The system login page is for already existing users where they provide their unique username and password for verification and once the details are verified they are redirected to mailbox.", "cate": "security", "id": "DOSSPRE-646"}
{"requirement": "Unload transactions do not require cardholder authentication. (However, an acquirer\u0083??s devices may be configured such that authentication is required for access.)", "cate": "security", "id": "SecReq-332"}
{"requirement": "The system shall store client KYC information in decentralised database using blockchain.", "cate": "functional", "id": "DOSSPRE-341"}
{"requirement": "The system shall  provide Two Factor Authentication.", "cate": "security", "id": "DOSSPRE-877"}
{"requirement": "The system shall never display a user’s password.  It shall always be echoed with special characters representing typed characters.", "cate": "security", "id": "DOSSPRE-518"}
{"requirement": "The system shall allow a user to view statistical report of the filter engine and possible sources of trouble over periods.", "cate": "functional", "id": "DOSSPRE-272"}
{"requirement": "The system shall show descriptions of work-flows and stages as outlined in the sequence diagram", "cate": "functional", "id": "DOSSPRE-116"}
{"requirement": "The system shall ensure the database containing keywords shall be protected against SQL Injection", "cate": "security", "id": "DOSSPRE-928"}
{"requirement": "The CEP card limits each slot to a maximum balance. The maximum balance for a slot is established when a currency is assigned to the slot, and is determined externally by the card issuer or by CEP card data which indicates a maximum balance in a reference currency. There is no requirement that all slot maximums have the same relative value, and there is no requirement for the card to maintain a maximum total value", "cate": "functional", "id": "SecReq-306"}
{"requirement": "The information entered is only altered by the user upon authentication being done to verify.", "cate": "security", "id": "DOSSPRE-497"}
{"requirement": "The system shall allow the radiologist to, encrypt and upload the images to the cloud.", "cate": "security", "id": "DOSSPRE-745"}
{"requirement": "The system shall give an update of balance left after every toll deduction by SMS reporting", "cate": "functional", "id": "DOSSPRE-78"}
{"requirement": "The system shall allow a user to display message on rogue note screen warning the student by name that port scanning is not allowed and this is automatically added to the student’s record if such an offence is repeated more than once.", "cate": "functional", "id": "DOSSPRE-285"}
{"requirement": "The system shall allow the user to access the start menu screen.", "cate": "functional", "id": "DOSSPRE-182"}
{"requirement": "The system shall allow a Program Administrator/Nursing Staff Member to move a student from one clinical lab section to another clinical lab section corresponding to the same clinical class.", "cate": "functional", "id": "promise-71"}
{"requirement": "The system comprises of different modules that operate hand-in-hand to accomplish the desired goal.", "cate": "functional", "id": "DOSSPRE-218"}
{"requirement": "The system shall provide a user with an interactive Email client that will allow them to send, receive and archive emails with destiny folder that will separate legitimate emails and illegitimate emails.", "cate": "functional", "id": "DOSSPRE-264"}
{"requirement": "The product shall be able to send meeting notifications via different kinds of end-user specified methods.", "cate": "functional", "id": "promise-198"}
{"requirement": "Script messages that conform to EMV specifications may be included as part of load, unload and currency exchange messages from the card issuer to the CEP card. An update key must be used when card parameters are changed. Script messages may be sent to the CEP card either before or after the credit for load, debit of unload and currency exchange commands", "cate": "functional", "id": "SecReq-299"}
{"requirement": "The system shall be able to display a report of needed classes for a given quarter for all cohorts of all programs for Program Administrators/Nursing Staff Members’ planning purposes.", "cate": "functional", "id": "promise-62"}
{"requirement": "The OPEN shall Ensure that application code has been signed by Application Providers represented on the card, if required.", "cate": "security", "id": "SecReq-378"}
{"requirement": "The system shall ensure that the hashing and extraction modules are easy to use and have a user manual incorporated in the system.", "cate": "functional", "id": "DOSSPRE-399"}
{"requirement": "At OP_READY state,Executable Load Files that were included in Immutable Persistent Memory shall be registered in the GlobalPlatform Registry", "cate": "functional", "id": "SecReq-419"}
{"requirement": "The service of the system must always be available whenever it is needed", "cate": "security", "id": "DOSSPRE-548"}
{"requirement": "The system shall allow administrator to view IP address.", "cate": "security", "id": "DOSSPRE-853"}
{"requirement": "The system will be divided into modules i.e downloader, trimmer, player to enhance the maintainability of the system and its troubleshooting", "cate": "security", "id": "DOSSPRE-683"}
{"requirement": "For commands that are dispatched to an Application, it is the responsibility of the Application to correctly reject commands that it does not recognize, expect or cannot process.", "cate": "functional", "id": "SecReq-442"}
{"requirement": "The system shall allow for error recovery.", "cate": "security", "id": "DOSSPRE-909"}
{"requirement": "The system should be able to provide visualization in terms of graphs.", "cate": "functional", "id": "DOSSPRE-132"}
{"requirement": "Contain the latest transaction count and amount of batches that have not been deleted from the POS device by the merchant or merchant acquirer", "cate": "functional", "id": "SecReq-246"}
{"requirement": "Off-line authentication must take place between a PSAM in the POS device and the CEP card for purchase and cancel last purchase transactions", "cate": "security", "id": "SecReq-213"}
{"requirement": "The system make use of stored procedures", "cate": "security", "id": "DOSSPRE-533"}
{"requirement": "The system shall report when a form of identity theft is noticed.", "cate": "security", "id": "DOSSPRE-817"}
{"requirement": "A GlobalPlatform card offers Entity authentication - in which the card or the off-card entity proves its authenticity to the other entity through a cryptographic exchange,", "cate": "security", "id": "SecReq-410"}
{"requirement": "If the CND contains an ISIM/UICC, it shall support the AKA authentication method (TS 187 001 [8])", "cate": "functional", "id": "SecReq-121"}
{"requirement": "The system shall enforce that all users login before they can access the system.", "cate": "security", "id": "DOSSPRE-911"}
{"requirement": "The OPEN shall Ensure that application code has been signed by the Controlling Authority represented on the card,", "cate": "security", "id": "SecReq-377"}
{"requirement": "All other commands (including the MANAGE CHANNEL commands on cards that are not aware of logical channels or SELECT commands not described in section 6.4.2.1.2 - Explicit Selection) are immediately dispatched to the Application currently selected on the Basic Logical Channel. The processing of the command by the Application is beyond the scope of this Specification.", "cate": "functional", "id": "SecReq-480"}
{"requirement": "Admin can manage all users and maintain their data securely He can update the details and day to day updating can be done by admin", "cate": "functional", "id": "SRRP-170"}
{"requirement": "The system shall implement authentication using PKI.", "cate": "security", "id": "DOSSPRE-732"}
{"requirement": "The system shall in the event that a watermarked image is submitted twice or more by different authors, the administrator shall be able to verify the legitimate owner of the image to protect the owner copyrights.", "cate": "security", "id": "DOSSPRE-693"}
{"requirement": "The system shall ensure that the central server remain unaffected when the institutes system fails.", "cate": "security", "id": "DOSSPRE-562"}
{"requirement": "The system shall allow monitoring of growth and healthcare issues pertaining to a baby and its mother.", "cate": "functional", "id": "DOSSPRE-317"}
{"requirement": "The system shall be able to clearly identify relevant protocols for the data exchange, document or reference the technical requirements for data exchange including: the source, data items, data structures, timing method, and protocols.", "cate": "functional", "id": "DOSSPRE-253"}
{"requirement": "The CNG shall support mechanisms for managing IPTV flows provided both in unicast and multicast mode.", "cate": "functional", "id": "SecReq-66"}
{"requirement": "The system components shall be expandable.", "cate": "security", "id": "DOSSPRE-554"}
{"requirement": "The CNG shall support mechanisms for secure authentication and communication with the remote management system.", "cate": "functional", "id": "SecReq-196"}
{"requirement": "The system shall ensure the exchange of data is between some target host computers on the same network and web-based application software.", "cate": "functional", "id": "DOSSPRE-107"}
{"requirement": "The system shall be able to show a section which displays the last time a user logged in the system and a summary of the activities they did on the system upon logging in.", "cate": "security", "id": "DOSSPRE-730"}
{"requirement": "The system shall allow the doctors to download, decrypt and decompress the images.", "cate": "functional", "id": "DOSSPRE-274"}
{"requirement": "The CNG may act as a proxy for handling messages (requests and responses) related to the remote access scenarios to and from the home.", "cate": "functional", "id": "SecReq-52"}
{"requirement": "The system shall be able to guide the agent’s movement by allowing the digital watermark agency to take note of the reports and to create a mutual knowledgebase .", "cate": "functional", "id": "DOSSPRE-386"}
{"requirement": "The system shall analyze the detected vulnerability", "cate": "functional", "id": "DOSSPRE-7"}
{"requirement": "The system shall have log in and logout capabilities which can be seen as the line of security which most systems should possess for authentication and accountability purposes.", "cate": "security", "id": "DOSSPRE-577"}
{"requirement": "A Program of Study shall consist of a program name and listing of required classes (both clinical and non-clinical) that must be completed.", "cate": "functional", "id": "promise-60"}
{"requirement": "Only authorized users shall have access to the portion of the system that interfaces with CampusConnect.", "cate": "security", "id": "promise-39"}
{"requirement": "The system shall provide compression ability so as to save data usage, time and storage space and also decompression option for the file to be presentable or readable to the end user.", "cate": "functional", "id": "DOSSPRE-239"}
{"requirement": "The system shall be used by the government officials to bring relevant information to the user unlike the normal web search.", "cate": "functional", "id": "DOSSPRE-413"}
{"requirement": "On detection of a message integrity error at the CNG the CNG shall discard the message.", "cate": "security", "id": "SecReq-16"}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add new classes to a sequence of classes", "cate": "functional", "id": "promise-52"}
{"requirement": "The system’s classification process shall classify identified Malware into its respective families.", "cate": "functional", "id": "DOSSPRE-416"}
{"requirement": "If a SELECT [by name] [next occurrence] is received, the search always begins from the entry following the currently selected Application on the Basic Logical Channel in the GlobalPlatform Registry,", "cate": "functional", "id": "SecReq-464"}
{"requirement": "The system server shall  be able to encrypt video content before it is downloaded.", "cate": "security", "id": "DOSSPRE-865"}
{"requirement": "The system shall allow a user to log into system and authenticated.", "cate": "security", "id": "DOSSPRE-734"}
{"requirement": "The system shall allow users to have their own user specific key that is generated by the machine and has been added to the list of keys for the MAC generation process", "cate": "security", "id": "DOSSPRE-526"}
{"requirement": "The CNG may allow secure dynamic firewall opening for remote access devices based on NGN authentication functions.", "cate": "functional", "id": "SecReq-47"}
{"requirement": "The system should be able to terminate transaction after ninety seconds of no response.", "cate": "functional", "id": "DOSSPRE-91"}
{"requirement": "The system shall provide security principles such as authentication.", "cate": "functional", "id": "DOSSPRE-226"}
{"requirement": "(e.g. VoIP phones, Video phones, STBs, etc).", "cate": "functional", "id": "SecReq-202"}
{"requirement": "The system ensures integration of all modules including theIntrusionD and memory acquisition modules as a proof of concept", "cate": "functional", "id": "DOSSPRE-237"}
{"requirement": "The system shall require the agents to report the detected images to the agency’s database.", "cate": "functional", "id": "DOSSPRE-389"}
{"requirement": "Standard NGN authentication, routing and connectivity should be used to establish remote access connectivity.", "cate": "functional", "id": "SecReq-45"}
{"requirement": "The system shall be able to display a printable summary for individual nursing students  which will include (but not be limited to) student name  student ID  admission date  classes  credits  GPA  and the cohort that the student is enrolled in.", "cate": "functional", "id": "promise-78"}
{"requirement": "The count and amount of the transactions in the batch must be protected by the S4 MAC,  This information is not part of the card issuer\u0083??s verification process", "cate": "security", "id": "SecReq-240"}
{"requirement": "The system shall ensure that in the event there are new attributes encountered, the anomaly detection part comes in, basing on the information the system already has, makes a prediction on the new data.", "cate": "functional", "id": "DOSSPRE-177"}
{"requirement": "The system shall be able to screening of blood to occur at the blood bank and results to be entered into the system", "cate": "functional", "id": "DOSSPRE-151"}
{"requirement": "Successful authentication is a prerequisite for the processing of any on-line or offline CEPS transaction", "cate": "security", "id": "SecReq-210"}
{"requirement": "The system shall show a panel for logs of the anomalies detected.", "cate": "security", "id": "DOSSPRE-892"}
{"requirement": "The CEP card may support multiple currencies. Each currency occupies a \u0083??slot\u0083?\u009d within the CEP. The slots are defined by the currency supported. The currency for an individual slot is determined during load or currency exchange. Currency exchange could apply to a single slot, and then only for the total balance", "cate": "functional", "id": "SecReq-303"}
{"requirement": "The number of possible values defining the packet priority and, by consequence, the number of queues managed in the upstream direction shall be coherent with the number of concurrent services (data, communication, entertainment) to be treated and supported.", "cate": "functional", "id": "SecReq-187"}
{"requirement": "\\tUser access should be limited to the permissions granted to their role(s) Each level in the PCG hierarchy will be assigned a role and users will be assigned to these roles. Access to functionality within RFS system is dependent on the privileges/permission assigned to the role..", "cate": "security", "id": "promise-320"}
{"requirement": "The system downloader shall allow trimming of each song into small parts.", "cate": "functional", "id": "DOSSPRE-211"}
{"requirement": "A Controlling Authority is responsible for Working with the Card Issuer to load generated keys into the Controlling Authority's Security Domain,", "cate": "security", "id": "SecReq-360"}
{"requirement": "The system shall ensure that each private key has to be encrypted with a password to keep it secure.", "cate": "security", "id": "DOSSPRE-906"}
{"requirement": "The system shall ensure that the public key is left open and accessible to the public domain.", "cate": "security", "id": "DOSSPRE-907"}
{"requirement": "The system shall have extraction modules that will be able to take out information from the image that has been created", "cate": "functional", "id": "DOSSPRE-136"}
{"requirement": "The system shall allow a user to view and update details.", "cate": "functional", "id": "DOSSPRE-221"}
{"requirement": "The system shall access a profile from which the PII is scraped and displayed on the graphical user interface.", "cate": "functional", "id": "DOSSPRE-87"}
{"requirement": "These totals are used by the merchant acquirer to ensure the integrity of the batch", "cate": "security", "id": "SecReq-239"}
{"requirement": "The system shall allow entering the name of the individual whose details and PII are to be searched.", "cate": "functional", "id": "DOSSPRE-82"}
{"requirement": "After investigation, if the merchant acquirer decides, based on scheme rules, to accept the transactions, a method must exist to settle them and forward them to the card issuer", "cate": "functional", "id": "SecReq-282"}
{"requirement": "A single currency cannot occupy more than one slot. The CEP card must not permit a slot to be assigned a currency if another slot in the CEP card has already been assigned to that currency", "cate": "functional", "id": "SecReq-305"}
{"requirement": "The system should be maintained properly so that it should be able to resolve any data conflicts and sustain at any condition.", "cate": "security", "id": "DOSSPRE-625"}
{"requirement": "The system shall deny access to unauthorised users to redistribute the copy they legally purchase.", "cate": "security", "id": "DOSSPRE-869"}
{"requirement": "The CNG and the Customer Network shall support the NGN services usage (e.g. voice communications, video communications, IPTV, entertainment, …) allowing the connection to the right service control platforms.", "cate": "functional", "id": "SecReq-150"}
{"requirement": "The ratings shall be from a scale of 1-10", "cate": "functional", "id": "promise-166"}
{"requirement": "The system shall analyse TCP, HTTP(S) and TLS web traffic, to detect network connections to known cryptocurrency mining pools or service providers such as BTC.com and coinhive.com '", "cate": "security", "id": "DOSSPRE-465"}
{"requirement": "The system shall offer high level security, as it shall give access to authorized users only,", "cate": "security", "id": "DOSSPRE-636"}
{"requirement": "The product shall have security.The product shall provide authentication  and authorization.", "cate": "security", "id": "promise-312"}
{"requirement": "The system shall allow adding of a new user and updating current ones.", "cate": "functional", "id": "DOSSPRE-79"}
{"requirement": "The system shall enable a user to have a functional account with the Twitter platform and create an application to access tokens.", "cate": "functional", "id": "DOSSPRE-138"}
{"requirement": "The system shall be maintainable by enforcing modularity which makes the system components loosely coupled such that they can be modified independently and then reintegrated into the system.", "cate": "security", "id": "DOSSPRE-462"}
{"requirement": "The product shall allow the player to position ships diagonally on their grid", "cate": "functional", "id": "promise-284"}
{"requirement": "The system shall be implemented for geo-fencing to ensure that the buses do not divert from their scheduled routes", "cate": "functional", "id": "DOSSPRE-365"}
{"requirement": "The system shall provide access control to the user interface.", "cate": "security", "id": "DOSSPRE-700"}
{"requirement": "The system shall allow a debit/credit card to be activated.", "cate": "functional", "id": "DOSSPRE-292"}
{"requirement": "The system should only grant access to legitimate users and in the defined stamp.", "cate": "security", "id": "DOSSPRE-603"}
{"requirement": "\"The contents of the GlobalPlatform Registry may be updated in response to:   An internal OPEN invoked action,   An authorized Application invoked action.\"", "cate": "functional", "id": "SecReq-505"}
{"requirement": "The system shall send child SMS to parent device", "cate": "functional", "id": "DOSSPRE-39"}
{"requirement": "The system shall be able to ensure the information provided include a unique username, password and some personal details which are needed to verify that the user is eligible to create an account.", "cate": "security", "id": "DOSSPRE-644"}
{"requirement": "All customer information will be stored on a secure database  accessible only to authorized personnel.", "cate": "security", "id": "promise-231"}
{"requirement": "The Card Issuer is responsible for Managing the application code loading and installing both on a Pre-Issuance and Post-Issuance basis", "cate": "functional", "id": "SecReq-351"}
{"requirement": "The system shall allow the results containing a list of IP addresses that have been singled out to be viewable on the web based platform.", "cate": "functional", "id": "DOSSPRE-208"}
{"requirement": "All credit card information will be secured on the server  and only accessible by authorized Izogn administrators.  Information will be encrypted in the database.", "cate": "security", "id": "promise-219"}
{"requirement": "The system shall enable user to select multiple options on the screen to search.", "cate": "functional", "id": "SRRP-19"}
{"requirement": "The system shall be able to filter harmful websites against URLs’ of known harmful websites. Access to known harmful websites shall not be permitted.", "cate": "security", "id": "DOSSPRE-451"}
{"requirement": "The system shall allow a user to block internet to the computer doing port scanning.", "cate": "security", "id": "DOSSPRE-753"}
{"requirement": "The system shall be able to extract raw data from Twitter in real-time.", "cate": "functional", "id": "DOSSPRE-410"}
{"requirement": "The issuer sends S2 to the load acquirer in the authorization response message", "cate": "security", "id": "SecReq-223"}
{"requirement": "In case of multicast flows the CNG shall keep a record of which devices are subscribed to which multicast group.", "cate": "functional", "id": "SecReq-67"}
{"requirement": "The system shall give the user an option to reset a forgotten password of an existing username by e-mail.", "cate": "security", "id": "DOSSPRE-776"}
{"requirement": "In this system the RFID system should be linked to facial recognition system so that it functions as one access control security system. Functionality", "cate": "functional", "id": "DOSSPRE-173"}
{"requirement": "The system shall perform user re-verification using AVS and distinct security questions.", "cate": "security", "id": "DOSSPRE-861"}
{"requirement": "The system should preserve the user’s privacy by not publishing the monitored network traffic, and not exposing the user’s registered email address.", "cate": "security", "id": "DOSSPRE-471"}
{"requirement": "The user shall be able to get driving directions to a selected property", "cate": "functional", "id": "promise-25"}
{"requirement": "The system shall have independent classes for databases so they can be maintained, tested and system improvements can be done easily", "cate": "security", "id": "DOSSPRE-439"}
{"requirement": "\"The Card Issuer is responsible for Determining policy with regards to card and Application Life Cycle management, velocity checking levels, privileges, and other security parameters,\"", "cate": "functional", "id": "SecReq-350"}
{"requirement": "A Global Services Application shall Perform internal security measures as required by the service.", "cate": "security", "id": "SecReq-390"}
{"requirement": "The system shall allow the user to encrypt/decrypt messages using AES algorithm", "cate": "security", "id": "DOSSPRE-632"}
{"requirement": "The CNG shall support a mechanism allowing the support of call forwarding toward non-IMS capable CNDs.", "cate": "functional", "id": "SecReq-165"}
{"requirement": "Permissions to access the system data should only be altered by the system’s data administrator.", "cate": "security", "id": "DOSSPRE-498"}
{"requirement": "The system will have a very low False Positive Rate so that it can correctly identify the false positive calls and differentiate them from the real vulnerability ones.", "cate": "security", "id": "DOSSPRE-678"}
{"requirement": "CNG shall support mechanisms for secure authentication and communication with the remote management system.", "cate": "functional", "id": "SecReq-101"}
{"requirement": "Each PSAM must maintain a transaction count, The unique PSAM ID and the transaction count are used during a conversation with a CEP card. The transaction count must not be reset during the life of the PSAM", "cate": "security", "id": "SecReq-243"}
{"requirement": "The system shall send a one-time password to the user phone for the completion of the login process", "cate": "security", "id": "DOSSPRE-631"}
{"requirement": "The system�s back-end databases shall be encrypted.", "cate": "security", "id": "SRRP-79"}
{"requirement": "On cards that support logical channels, if a MANAGE CHANNEL [close] is received, terminate the Application Session currently selected on the Supplementary Logical Channel indicated by the command and then close that logical channel. The Basic Logical Channel can never be closed.", "cate": "functional", "id": "SecReq-474"}
{"requirement": "The system shall allow automatic locking after connection is lost.", "cate": "security", "id": "DOSSPRE-842"}
{"requirement": "The system shall ensure that the originator of the log files that are required, recognizing the data items and data structures that are necessary for exchange.", "cate": "security", "id": "DOSSPRE-529"}
{"requirement": "The transaction data is validated by the smart contract.", "cate": "security", "id": "DOSSPRE-788"}
{"requirement": "The system shall enable retrieval of the watermark from the image and displaying the similarity of the original image and the watermarked image.", "cate": "functional", "id": "DOSSPRE-227"}
{"requirement": "The smart contract issues a token based on the ERC721 interface for Ethereum blockchain.", "cate": "functional", "id": "DOSSPRE-352"}
{"requirement": "The system shall be able to keep an inventory of the donated blood id and type", "cate": "functional", "id": "DOSSPRE-153"}
{"requirement": "\"When applicable a Security Domain shall Provide cryptographic protection services for its own Applications during their personalization and optionally during their subsequent operation,\"", "cate": "security", "id": "SecReq-382"}
{"requirement": "The system will deliver emails whenever there is internet connection to receive the emails with minimal downtimes", "cate": "security", "id": "DOSSPRE-639"}
{"requirement": "The system shall have imaging ability so as to make a copy of the information contained on the mobile device which will be used during the forensics process as the test data source", "cate": "functional", "id": "DOSSPRE-135"}
{"requirement": "Internally to the CPN, a CNG receiving private or other critical information (i.e. from a CND) should verify that the data was protected from unauthorised disclosure.", "cate": "security", "id": "SecReq-1"}
{"requirement": "The system should allow room for quick error recovery.", "cate": "security", "id": "DOSSPRE-766"}
{"requirement": "The POS device must ensure that it is dealing with an authentic card, and guarantee integrity of transactions and batches to the merchant acquirer", "cate": "security", "id": "SecReq-231"}
{"requirement": "On receipt of a valid (i.e. authorized) request for data stored in the CNG the CNG shall return the requested data to the requesting user.", "cate": "security", "id": "SecReq-18"}
{"requirement": "The CND/CNG shall support a mechanism allowing the user to manually modify the association between a public identity (e.g. phone number) and a specific private identity corresponding to a single customer device not provided with a UICC.", "cate": "functional", "id": "SecReq-208"}
{"requirement": "In the event of a system crash during a transaction the current transaction will either completed or not completed. This will be handled by an already existing database", "cate": "security", "id": "SRRP-110"}
{"requirement": "The system shall optionally allow the user to destroy the suspect’s details files or save them for future records in a secure database", "cate": "functional", "id": "DOSSPRE-25"}
{"requirement": "The system player fills the look-up table with required data.", "cate": "functional", "id": "DOSSPRE-212"}
{"requirement": "The system shall have a working environment which is the main screen which will allow the user to monitor the network.", "cate": "functional", "id": "DOSSPRE-134"}
{"requirement": "The system shall process files to be moved over to the other end of a communication channel that is from one machine to the other.", "cate": "functional", "id": "DOSSPRE-406"}
{"requirement": "The system shall show Logs investigator activity", "cate": "security", "id": "DOSSPRE-531"}
{"requirement": "The system must be able to deal with network threats on the computer it would be installed on.", "cate": "security", "id": "DOSSPRE-617"}
{"requirement": "The system shall allow the user to query the database", "cate": "functional", "id": "DOSSPRE-101"}
{"requirement": "The system shall be able to request for phone location by a SMS of parent device", "cate": "functional", "id": "DOSSPRE-43"}
{"requirement": "The system shall enable authorised reversal of actions.", "cate": "security", "id": "DOSSPRE-913"}
{"requirement": "The adjuster shall request a recycled parts audit of the collision estimate.", "cate": "functional", "id": "promise-153"}
{"requirement": "The system shall allow a user to register and log in.", "cate": "security", "id": "DOSSPRE-827"}
{"requirement": "The CNG shall support a mechanism allowing the support of call forking towards customer non-IMS capable devices.", "cate": "functional", "id": "SecReq-59"}
{"requirement": "The system shall collect suspicious traffic and ancillary information the describes or characterizes the traffic, identifying distinct network connections or associations (connectionless traffic) and including enough detail to assist criminal investigations and prosecutions", "cate": "functional", "id": "DOSSPRE-178"}
{"requirement": "Every user of the system shall be authenticated and authorized.", "cate": "security", "id": "promise-22"}
{"requirement": "The system shall allow users to call the nearest police station in situations of emergency using their live location.", "cate": "functional", "id": "DOSSPRE-281"}
{"requirement": "A suitably authorized CPN user (e.g. the system administrator) shall be able to install and activate NGN managed services without the intervention of the subscribing CPN user.", "cate": "functional", "id": "SecReq-103"}
{"requirement": "The system shall be able to analyse the captured packets", "cate": "functional", "id": "DOSSPRE-148"}
{"requirement": "The system shall allow a user to note hostname of rogue node as well as the SSID of the network it is connected to as to know from which section on campus is the attack being done.", "cate": "functional", "id": "DOSSPRE-283"}
{"requirement": "The system shall be able to retrieve criminal records from the database based on pictures taken", "cate": "functional", "id": "DOSSPRE-27"}
{"requirement": "Consumers must be able to load electronic value to their cards at any participating load device, regardless of the location, provided that the currency that is requested is supported by the acquirer and the card issuer", "cate": "functional", "id": "SecReq-326"}
{"requirement": "The CNG and the Customer Network shall assure the confidentiality, the integrity of signalling/control/media and management flows.", "cate": "functional", "id": "SecReq-152"}
{"requirement": "The system does not continuously interact with the database, it does seek student information from the university database only when the administrator requests.", "cate": "functional", "id": "DOSSPRE-288"}
{"requirement": "\"A Controlling Authority is responsible for Providing load file data block signatures according to its own security policy for integrity and source authenticity.\"", "cate": "security", "id": "SecReq-361"}
{"requirement": "One insurance company shall not be able to view another insurance companys claim data.", "cate": "security", "id": "promise-131"}
{"requirement": "The merchant acquirer validates the PSAM\u0083??s MACs prior to accepting the POS transactions for payment. In addition, selected data elements are validated to ensure correct processing by the POS device and its PSAM", "cate": "security", "id": "SecReq-279"}
{"requirement": "The system shall   ensure that the transaction ID, UUID and storage serial should be used for encryption by the server and decryption by the client.", "cate": "functional", "id": "DOSSPRE-380"}
{"requirement": "The CNG shall be able to classify intra-LAN traffic that is simply bridged by the CNG itself within the CPN.", "cate": "functional", "id": "SecReq-94"}
{"requirement": "The system shall ensure that, as a watermark is an essential part of data, it must continue even after signal processing and data manipulation including malicious operation that endeavors to remove the watermark.", "cate": "security", "id": "DOSSPRE-694"}
{"requirement": "The system shall use the organization’s standard virus protection software to help monitor threats to itself.", "cate": "security", "id": "promise-44"}
{"requirement": "The system shall allow a user to move email to or from spam folder.", "cate": "functional", "id": "DOSSPRE-271"}
{"requirement": "The system shall provide reports monthly regarding the anomalies detected.", "cate": "functional", "id": "DOSSPRE-390"}
{"requirement": "The system shall allow Network traffic monitoring in real-time by capturing incoming and outgoing TCP, HTTP(S) and TLS web traffic, in order to correlate it with configured cryptojacking blacklist.", "cate": "security", "id": "DOSSPRE-464"}
{"requirement": "The system shall be able to use PGP to maintain security of the log files", "cate": "security", "id": "DOSSPRE-520"}
{"requirement": "The system shall  enable buying patterns to be analysed.", "cate": "functional", "id": "DOSSPRE-378"}
{"requirement": "The system should offer a secure single sign-on platform, which will give access to different application that the user is entitled to access.", "cate": "security", "id": "DOSSPRE-536"}
{"requirement": "If the Application currently selected on the original Supplementary Logical Channel cannot be selected on the new Supplementary Logical Channel due to a multi-selection restriction, the new logical channel shall not be opened and the OPEN shall return the appropriate error,", "cate": "functional", "id": "SecReq-499"}
{"requirement": "The system shall be an E-government content management system", "cate": "functional", "id": "DOSSPRE-259"}
{"requirement": "The system should also be able to notify the user if there is any change in the conditions i.e. drop or rise that is any anomaly should be notified to the user of the system.", "cate": "functional", "id": "DOSSPRE-324"}
{"requirement": "The system shall enable face identification through details about that person if he/she is an employee.", "cate": "security", "id": "DOSSPRE-801"}
{"requirement": "The system shall be able to register wireless connection.", "cate": "functional", "id": "DOSSPRE-371"}
{"requirement": "The system shall block traffic to and from the network that is identified to be potentially malicious.", "cate": "security", "id": "DOSSPRE-886"}
{"requirement": "The concept of the Life Cycle of the card (see section 5.1 - Card Life Cycle) may be used to determine the security level of the communication between the card and an off-card entity.", "cate": "functional", "id": "SecReq-409"}
{"requirement": "The SECURED state may be used to enforce the relevant security policies of the security domain and applications", "cate": "security", "id": "SecReq-422"}
{"requirement": "The timing of payment to the merchant must be established between the merchant and the merchant acquirer", "cate": "functional", "id": "SecReq-260"}
{"requirement": "The system shall offer confidentiality through encryption with AES.", "cate": "security", "id": "DOSSPRE-874"}
{"requirement": "The system shall allow that if the mobile phone is not present, some authentications are done by the user to obtain access to the system", "cate": "security", "id": "DOSSPRE-449"}
{"requirement": "The system shall provide availability of the audit report to users", "cate": "security", "id": "DOSSPRE-522"}
{"requirement": "The system shall hash the passwords using HMAC", "cate": "security", "id": "DOSSPRE-824"}
{"requirement": "The system player shall be responsible for hashing the trimmed parts’ names.", "cate": "security", "id": "DOSSPRE-682"}
{"requirement": "The system shall  permit user credentials registration.", "cate": "functional", "id": "DOSSPRE-376"}
{"requirement": "The system shall be able to create reports from activity in the system.", "cate": "functional", "id": "DOSSPRE-81"}
{"requirement": "The system shall provide a user with the option to encrypt and decrypt data.", "cate": "security", "id": "DOSSPRE-779"}
{"requirement": "The system’s logistics are usually accessed hence its availability is guaranteed when and as required.", "cate": "security", "id": "DOSSPRE-582"}
{"requirement": "The system shall implement input validation to help in increasing fault tolerance and ultimately reliability.", "cate": "security", "id": "DOSSPRE-578"}
{"requirement": "If a supported scheme provider has a dispute resolution process, participate in that dispute resolution process with connecting processors to resolve any issues related to invalid transactions. These resolution processes should include a mechanism for repayment of funds associated with invalid transactions", "cate": "functional", "id": "SecReq-255"}
{"requirement": "The system must be able to connect to Twitter Streaming API.", "cate": "functional", "id": "DOSSPRE-139"}
{"requirement": "The system shall   provide authentication service for all users before they can be allowed to embed a watermark through use of an email client.", "cate": "security", "id": "DOSSPRE-839"}
{"requirement": "The system player shall be sends contents into the hidden folder.", "cate": "functional", "id": "DOSSPRE-214"}
{"requirement": "The system shall be able to open the door when the pin is correct", "cate": "security", "id": "DOSSPRE-447"}
{"requirement": "The system shall allow a user to push warning script to the rogue node.", "cate": "functional", "id": "DOSSPRE-282"}
{"requirement": "The system should maintain basic patient information and permissions on a central server.", "cate": "functional", "id": "DOSSPRE-126"}
{"requirement": "The system shall allow modification of the display.", "cate": "functional", "id": "promise-13"}
{"requirement": "If the card only supports the Basic Logical Channel and has no concept of logical channel support, the MANAGE CHANNEL command is dispatched to the currently selected Application. In this case, when a Security Domain is the currently selected Application, the command shall be rejected.", "cate": "functional", "id": "SecReq-472"}
{"requirement": "\"The Card Issuer is responsible for Working with Application Providers to create and initialize Security Domains other than the Issuer Security Domain,\"", "cate": "functional", "id": "SecReq-349"}
{"requirement": "The system shall learn how a spam and good email look like for future classification through the use if machine learning algorithms", "cate": "functional", "id": "DOSSPRE-185"}
{"requirement": "System can participate in chat with user and SERVER", "cate": "functional", "id": "SRRP-179"}
{"requirement": "\"If a full or partial match is found and this Application cannot be selected due to a multi-selection restriction or because the Application refuses selection (e.g. because it does not support the current card interface), continue searching through the GlobalPlatform Registry for a subsequent full or partial match. If no subsequent full or partial match is found, the OPEN shall return the appropriate error to the off-card entity,\"", "cate": "functional", "id": "SecReq-493"}
{"requirement": "The system shall provide a platform that allows the user to upload files for storage and also to retrieve the files by downloading them when required.", "cate": "functional", "id": "DOSSPRE-16"}
{"requirement": "Transmissions between host systems should be protected by MACs based on unique keys that are shared by the nodes involved", "cate": "security", "id": "SecReq-237"}
{"requirement": "The system shall be able to identify wrong input.", "cate": "security", "id": "DOSSPRE-900"}
{"requirement": "The system shall analyse the caught activities, check for any approved utilisation and afterwards give a warning to the framework head by transferring the data on the web.", "cate": "functional", "id": "DOSSPRE-375"}
{"requirement": "The system shall access personally, identifiable information to allow investigators to be able to reconstruct a criminal event after it happens, thereby securing the evidence.", "cate": "security", "id": "DOSSPRE-489"}
{"requirement": "The system shall be able to send a random screen shot of videos played in phone (forward by email only)", "cate": "functional", "id": "DOSSPRE-47"}
{"requirement": "The transaction’s digital signatures are validated by the Ethereum protocol.", "cate": "security", "id": "DOSSPRE-787"}
{"requirement": "If the leads score falls within the medium average then it will be set for manual verification by an Enrollment Coordinator through the eleads system.", "cate": "functional", "id": "promise-260"}
{"requirement": "The system shall enable Bitcoin transaction processing", "cate": "functional", "id": "DOSSPRE-64"}
{"requirement": "The system shall be able to de-fragment captured packets", "cate": "functional", "id": "DOSSPRE-147"}
{"requirement": "The Card Content changes including any type of data management (specifically Security Domain keys and data) shall not allowed in the CARD_LOCKED state.", "cate": "functional", "id": "SecReq-426"}
{"requirement": "At any time on an open Supplementary Logical Channel that has already contained a SELECT [by name] [first or only occurrence] command since the Supplementary Logical Channel was last opened, the OPEN may receive a request to select a next Application (SELECT [by name] [next occurrence] command) on this Supplementary Logical Channel. The OPEN shall determine if the requested AID matches or partially matches another entry within the GlobalPlatform Registry and whether this entry is selectable.", "cate": "functional", "id": "SecReq-485"}
{"requirement": "The system shall be able to close the session", "cate": "functional", "id": "DOSSPRE-103"}
{"requirement": "The system shall allow users to download files when they want to use them upon answering correctly the randomly generated questions from their profiles.", "cate": "security", "id": "DOSSPRE-807"}
{"requirement": "The system shall report the findings, after detecting and analysing the vulnerabilities", "cate": "functional", "id": "DOSSPRE-327"}
{"requirement": "The OPEN shall be responsible to maintain security and administration of the card and its content", "cate": "security", "id": "SecReq-415"}
{"requirement": "The system shall allow a user to listen for any port scan on university WIFI network.", "cate": "security", "id": "DOSSPRE-752"}
{"requirement": "The system should be able to allow the user to swipe his or her tag/card on the RFID reader and check if its valid or not", "cate": "functional", "id": "DOSSPRE-171"}
{"requirement": "The system shall look at port scanning only on the host it will be deployed on, this will devote all the listen to one part of the many policies in a computer", "cate": "functional", "id": "DOSSPRE-34"}
{"requirement": "The OPEN shall owns and maintains the Life Cycle information within the GlobalPlatform Registry", "cate": "functional", "id": "SecReq-414"}
{"requirement": "The system shall retain records for all babies a mother will have subsequently.", "cate": "functional", "id": "DOSSPRE-313"}
{"requirement": "The system shall monitor a baby’s growth.", "cate": "functional", "id": "DOSSPRE-314"}
{"requirement": "The system shall be able to detect motion within the camera feed and capture and image where motion is detected.", "cate": "functional", "id": "DOSSPRE-248"}
{"requirement": "The system should keep history of the transactions in a secure database.", "cate": "security", "id": "DOSSPRE-491"}
{"requirement": "The system’s hashing module shall use SHA-2 algorithm .", "cate": "functional", "id": "DOSSPRE-401"}
{"requirement": "The CNG shall be equipped with a WAN interface towards the NGN, implementing layer 1 and 2 functionalities (\"one-box\" solution).", "cate": "functional", "id": "SecReq-143"}
{"requirement": "System shall allow user input of Licence number/National I.D Number/Registration Number.", "cate": "functional", "id": "DOSSPRE-96"}
{"requirement": "In case of managed services, QoS rules applied by CNG shall be configurable by a remote management system", "cate": "functional", "id": "SecReq-192"}
{"requirement": "The proposed system shall be designed such that any glitch can be fixed in no time to restore service to users and it will allow adding functionality easily.", "cate": "security", "id": "DOSSPRE-717"}
{"requirement": "The system shall ensure that buzzer must ring if 3 consecutive wrong attempts are entered.", "cate": "functional", "id": "DOSSPRE-246"}
{"requirement": "The system shall ensure that the password is verifiable whenever they want to log in", "cate": "security", "id": "DOSSPRE-829"}
{"requirement": "The system shall forward phone call notifications of child device to an email account", "cate": "functional", "id": "DOSSPRE-42"}
{"requirement": "The system must allow scalability so as to perform legitimate modification of user data.", "cate": "security", "id": "DOSSPRE-588"}
{"requirement": "The system shall allow the administrator to log in to access the system.", "cate": "security", "id": "DOSSPRE-799"}
{"requirement": "A GlobalPlatform card offers Confidentiality - in which data being transmitted from the sending entity (the off-card entity or card) to the receiving entity (respectively the card or off-card entity) is not viewable by an unauthenticated entity.", "cate": "security", "id": "SecReq-412"}
{"requirement": "In all other cases the OPEN shall search the GlobalPlatform Registry for an Application that is marked as implicitly selectable on the Basic Logical Channel for the current card I/O interface (e.g. contact or contactless), and if this Application is not in the Life Cycle State LOCKED, it shall become the selected Application on the Basic Logical Channel. If this is an Application in the Life Cycle State LOCKED, the Application with the Final Application privilege shall become the selected Application on the Basic Logical Channel.", "cate": "functional", "id": "SecReq-457"}
{"requirement": "The system shall be able to display message on rogue note screen warning the student by name that port scanning is not allowed and this is automatically added to the student s record if such an offence is repeated more than once.", "cate": "functional", "id": "DOSSPRE-32"}
{"requirement": "Payment decisions are based on signature validations, scheme provider rules, and merchant and merchant acquirer agreements", "cate": "security", "id": "SecReq-281"}
{"requirement": "The terminal must generate a symmetric MACing key signature and send it to the merchant acquirer", "cate": "security", "id": "SecReq-315"}
{"requirement": "The system shall be scalable and able to handle growth in data flow leveraging the Twitter API capabilities.", "cate": "security", "id": "DOSSPRE-927"}
{"requirement": "The system shall be able to allocate an Examiner a Route to use once he finishes testing a learner driver in the Yard", "cate": "functional", "id": "DOSSPRE-163"}
{"requirement": "The system should use report –generating modules to produce reports that can be conveniently used by management in decision making.", "cate": "functional", "id": "DOSSPRE-198"}
{"requirement": "The system shall be able to save user profile of each user.", "cate": "functional", "id": "DOSSPRE-305"}
{"requirement": "The system shall allow the user to upload and download stored files.", "cate": "functional", "id": "DOSSPRE-15"}
{"requirement": "When the CNG detects replayed user and/or device credentials, the CNG shall stop the relevant processes.", "cate": "security", "id": "SecReq-7"}
{"requirement": "The system does not use much hardware and software, hence it is not costly to maintain the system and the system does not require maintenance regularly.", "cate": "security", "id": "DOSSPRE-571"}
{"requirement": "Only administrators can activate a pre-paid card.", "cate": "security", "id": "promise-223"}
{"requirement": "Secure memory management shall ensure that The previous contents of the memory is not accessible when that memory is reused,", "cate": "security", "id": "SecReq-366"}
{"requirement": "The system shall be able to allow cloud user to register and create an account.", "cate": "functional", "id": "DOSSPRE-254"}
{"requirement": "The system will stand in-between the client and the server, however, it is associated within the server’s architecture.", "cate": "security", "id": "DOSSPRE-668"}
{"requirement": "Contain the CA public RSA key, the PSAM\u0083??s private RSA key and optionally the certificates that the POS device uses to perform mutual authentication with the CEP card", "cate": "security", "id": "SecReq-244"}
{"requirement": "The system should be able to provide data for the current maximum number of tags presently two thousand for a period of thirty days in whatever format the user decides.", "cate": "security", "id": "DOSSPRE-628"}
{"requirement": "The system shall use RFID scanner to capture the details of every passenger upon boarding the bus.", "cate": "functional", "id": "DOSSPRE-360"}
{"requirement": "The system shall be able to pre-process the unstructured data into meaningful information and match with the existing keywords in the database.", "cate": "functional", "id": "DOSSPRE-411"}
{"requirement": "The system shall allow a user to view the progress of a baby from birth to postnatal visits.", "cate": "functional", "id": "DOSSPRE-316"}
{"requirement": "The Issuer Security Domain shall implement one Secure Channel Protocol.", "cate": "security", "id": "SecReq-395"}
{"requirement": "The system shall be able to secure uploaded files using AES algorithm with a 256-bit key.  The system shall automatically encrypt the files that will be uploaded by the user for storage using a 256-bit encryption key.", "cate": "security", "id": "DOSSPRE-720"}
{"requirement": "Where a CND invokes a session at the CNG the CNG shall record the association of session-id, invoking device identity and invoking user-id.", "cate": "security", "id": "SecReq-12"}
{"requirement": "The card must ensure that the transaction is performed by the same POS device as was used for the purchase being canceled, and that the amount of the cancellation is the same as the amount of the purchase, or, in the case of an incremental purchase, the same as the amount of the last step", "cate": "security", "id": "SecReq-233"}
{"requirement": "The dispatching mechanism will employ sms, blog chats and email", "cate": "functional", "id": "DOSSPRE-319"}
{"requirement": "The CNG and the CPN shall support adequate Quality of Service mechanisms (e.g. prioritize the traffic in the event that there is not sufficient bandwidth in the customer network in order to ensure the correct network performances to each traffic flow). To achieve this objective a number of functionalities shall be supported by CNG and/or CNDs, as defined in the following bullets. Most of the following set of requirements is defined adopting as a reference the Home Gateway Initiative (HGI) Release 1 Specification mentioned in clause 2 [6].", "cate": "functional", "id": "SecReq-84"}
{"requirement": "The system shall monitor motion through cameras.", "cate": "functional", "id": "DOSSPRE-69"}
{"requirement": "The system should be able to identify and trap user input error", "cate": "security", "id": "DOSSPRE-656"}
{"requirement": "The system shall allow the recipient to verify the signature using the group public key so that they will be convinced that it actually came from the organisation without the knowledge of the actual signer.", "cate": "security", "id": "DOSSPRE-895"}
{"requirement": "The system shall create an environment for embedding and extracting the watermark from an image.", "cate": "functional", "id": "DOSSPRE-19"}
{"requirement": "The system shall be maintainable as it is built with three modules with commands that avoid violating coding principles", "cate": "security", "id": "DOSSPRE-932"}
{"requirement": "The system shall use secure sockets in all transactions that include any confidential customer information.", "cate": "security", "id": "SRRP-70"}
{"requirement": "The system shall be able to allow the model as it learns new features it should also be able to learn in real-time from user actions like moving an email to spam and from spam folders interchangeably.", "cate": "functional", "id": "DOSSPRE-265"}
{"requirement": "The primary goal of the GlobalPlatform is to ensure the security and integrity of the card's components for the life of the card. These components are The runtime environment,The OPEN,The Issuer Security Domain,Supplementary Security Domains, The Applications.", "cate": "security", "id": "SecReq-345"}
{"requirement": "The system shall enable the administrator to log into the system and to upload the captured traffic data into the analysis system so as to be accessed by any other administrators available.", "cate": "security", "id": "DOSSPRE-672"}
{"requirement": "The System shall be able to calculate maximum soil water deficit.", "cate": "functional", "id": "DOSSPRE-295"}
{"requirement": "Only users with Update access must be able to initiate dispute requests.", "cate": "security", "id": "promise-93"}
{"requirement": "The interface will have to satisfy these objectives or requirements on any device and platform.", "cate": "functional", "id": "DOSSPRE-266"}
{"requirement": "The system shall allow the cryptojacking application to be terminated unless the user explicitly selects to ignore the cryptojacking application.", "cate": "security", "id": "DOSSPRE-468"}
{"requirement": "The card should use a unique diversified secret key, personalized into the card, to generate and authenticate transaction signatures", "cate": "security", "id": "SecReq-216"}
{"requirement": "The System shall maintain consistent security.  Any changes in user passwords and/or permissions should take affect in all parts of the System.", "cate": "security", "id": "promise-202"}
{"requirement": "The system shall ensure that the embedding module and scanning tool offer relatively good performance and resource behaviour due to the implemented design.", "cate": "functional", "id": "DOSSPRE-400"}
{"requirement": "The system shall  provide mechanisms for the security of online transactions.", "cate": "security", "id": "DOSSPRE-863"}
{"requirement": "The system shall allow a user to generate monthly reports which can be viewed by network admin when necessary.", "cate": "functional", "id": "DOSSPRE-286"}
{"requirement": "The system shall prevent malicious attacks including denial of service.", "cate": "security", "id": "promise-133"}
{"requirement": "The system shall be able to send email and sms alerts of fraudulent transactions.", "cate": "functional", "id": "DOSSPRE-405"}
{"requirement": "The system will permit user credentials registration.", "cate": "functional", "id": "DOSSPRE-291"}
{"requirement": "The system shall be able to detect faces in the captured image to see there are human faces within the image.", "cate": "functional", "id": "DOSSPRE-249"}
{"requirement": "The system shall apply a number of methods, such as regular maintenance, to facilitate reliability assurance of the system,", "cate": "security", "id": "DOSSPRE-433"}
{"requirement": "The system should allow only those who are authorized to used and access the system and they will have to log in first to use the system.", "cate": "security", "id": "DOSSPRE-574"}
{"requirement": "The system shall circumvent the electricity power cuts challenges by the use of UPS (uninterrupted power supply).", "cate": "security", "id": "DOSSPRE-478"}
{"requirement": "Perform the calculation required to generate a signature using the PSAM\u0083??s private RSA key, to allow the CEP card to validate the PSAM", "cate": "security", "id": "SecReq-245"}
{"requirement": "The system shall allow people to connect to their accounts after they initially register with the system and sign in to access it.", "cate": "security", "id": "DOSSPRE-805"}
{"requirement": "The CND should be able to communicate its services related capabilities to the CNG.", "cate": "functional", "id": "SecReq-131"}
{"requirement": "The system shall enable that when a request is made by the doctor/hospital a session is opened and a confirmation key is generated and sent to the doctor/patient via email which they then will use after receiving the correct requested blood.", "cate": "functional", "id": "DOSSPRE-154"}
{"requirement": "The system shall allow a user who has a Twitter account to create an application to access tokens.", "cate": "security", "id": "DOSSPRE-926"}
{"requirement": "Fit Criterion: Dr Susan Poslusny and Karen Sysol are the only people who shall have access to the final class section scheduling for the system that interfaces with CampusConnect.", "cate": "security", "id": "promise-40"}
{"requirement": "The system shall not leave any cookies on the customer�s computer containing any of the user�s confidential information.", "cate": "security", "id": "SRRP-74"}
