{"requirement": "The product shall ensure that it can only be accessed by authorized users.  The product will be able to distinguish between authorized and unauthorized users in all access attempts", "cate": "security", "id": 0}
{"requirement": "The system shall have a MDI form that allows for the viewing of the graph and the data table.", "cate": "functional", "id": 1}
{"requirement": "The system shall display Events in a vertical table by time.", "cate": "functional", "id": 2}
{"requirement": "The system shall display the Events in a graph by time.", "cate": "functional", "id": 3}
{"requirement": "The system shall display Events or Activities.", "cate": "functional", "id": 4}
{"requirement": "The display shall have two regions:  left 2/3 of the display is graphical  right 1/3 of the display is a data table", "cate": "functional", "id": 5}
{"requirement": "The data displayed in both the nodes within the graph and the rows in the table are MSEL Summary data", "cate": "functional", "id": 6}
{"requirement": "The table side of the display shall be split into 2 regions: sequential and temporal.", "cate": "functional", "id": 7}
{"requirement": "The top 1/4 of the table will hold events that are to occur sequentially.", "cate": "functional", "id": 8}
{"requirement": "The bottom 3/4 of the table will hold events that occur according to its relevance to current time.", "cate": "functional", "id": 9}
{"requirement": "The system shall color code events according to their variance from current time.", "cate": "functional", "id": 10}
{"requirement": "The system shall display data from the Sync Matrix 1.0 and Exercise Management Tool 1.0 applications", "cate": "functional", "id": 11}
{"requirement": "The system shall link Events back to either the Sync Matrix 1.0 or the Exercise Managment Tool 1.0 applications for modifications.", "cate": "functional", "id": 12}
{"requirement": "The system shall allow modification of the display.", "cate": "functional", "id": 13}
{"requirement": "The system shall offer a display of all the Events in the exercise.", "cate": "functional", "id": 14}
{"requirement": "The system shall filter data by: Venues and Key Events.", "cate": "functional", "id": 15}
{"requirement": "The system shall allow a user to define the time segments", "cate": "functional", "id": 16}
{"requirement": "The system shall display the local and exercise time in separate clocks", "cate": "functional", "id": 17}
{"requirement": "The system shall offer the ability to pause and resume the refresh of data.", "cate": "functional", "id": 18}
{"requirement": "The system shall provide charts for the Activity or Event actual versus assumed time.", "cate": "functional", "id": 19}
{"requirement": "The system shall provide a history report of changes made to the Activity or Event data", "cate": "functional", "id": 20}
{"requirement": "Only registered realtors shall be able to access the system.", "cate": "security", "id": 21}
{"requirement": "Every user of the system shall be authenticated and authorized.", "cate": "security", "id": 22}
{"requirement": "The product shall prevent its data from incorrect data being introduced.", "cate": "security", "id": 23}
{"requirement": "The system shall allow a real estate agent to query MLS information", "cate": "functional", "id": 24}
{"requirement": "The user shall be able to get driving directions to a selected property", "cate": "functional", "id": 25}
{"requirement": "The user shall be able to download appointments and contact information for clients", "cate": "functional", "id": 26}
{"requirement": "The system shall display clear property images in the search results", "cate": "functional", "id": 27}
{"requirement": "The system shall update or create new property listings in the MLS", "cate": "functional", "id": 28}
{"requirement": "Realtor shall be able to generate a CMA report based on property criteria", "cate": "functional", "id": 29}
{"requirement": "The system shall be able to call the seller or buyer to schedule an appointment", "cate": "functional", "id": 30}
{"requirement": "The realtor shall be notified of new client appointments after automatic synchronization with office system", "cate": "functional", "id": 31}
{"requirement": "The realtor shall be able to retrieve a map showing property locations for a specified area", "cate": "functional", "id": 32}
{"requirement": "The system shall notify the realtor when a seller or buyer responds to an appointment request", "cate": "functional", "id": 33}
{"requirement": "The product shall allow the user to save the property search results.", "cate": "functional", "id": 34}
{"requirement": "Only authorized users shall have access to clinical site information.", "cate": "security", "id": 35}
{"requirement": "Program Administrators/Nursing Staff Members are the only people who shall have access to clinical site details.", "cate": "security", "id": 36}
{"requirement": "Only authorized users shall have access to students’ personal information.", "cate": "security", "id": 37}
{"requirement": "Dr Susan Poslusny and Dr Julie Donalek are the only people who shall have access to students’ personal information.", "cate": "security", "id": 38}
{"requirement": "Only authorized users shall have access to the portion of the system that interfaces with CampusConnect.", "cate": "security", "id": 39}
{"requirement": "Fit Criterion: Dr Susan Poslusny and Karen Sysol are the only people who shall have access to the final class section scheduling for the system that interfaces with CampusConnect.", "cate": "security", "id": 40}
{"requirement": "The system shall have basic data integrity checking to reduce the possibility of incorrect or invalid data being introduced.", "cate": "security", "id": 41}
{"requirement": "The system shall protect private information in accordance with the organization’s information policy.", "cate": "security", "id": 42}
{"requirement": "The system shall be built such that it is as secure as possible from malicious interference.", "cate": "security", "id": 43}
{"requirement": "The system shall use the organization’s standard virus protection software to help monitor threats to itself.", "cate": "security", "id": 44}
{"requirement": "A cohort shall be associated to one Program of Study offered by the department.", "cate": "functional", "id": 45}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add a listing of students to a cohort.", "cate": "functional", "id": 46}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add a single student to a cohort", "cate": "functional", "id": 47}
{"requirement": "Students added to a cohort shall be eligible for the cohort’s Program of Study.", "cate": "functional", "id": 48}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to specify the preferred sequence of classes for a given cohort.", "cate": "functional", "id": 49}
{"requirement": "For each class within a sequence for a cohort  Program Administrators and Nursing Staff Members shall be able to specify which quarter that class will be offered.", "cate": "functional", "id": 50}
{"requirement": "For each class within a sequence for a cohort  Program Administrators and Nursing Staff Members shall be able to specify which quarter that class will be offered.", "cate": "functional", "id": 51}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add new classes to a sequence of classes", "cate": "functional", "id": 52}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add clinical classes or sections to a sequence of classes", "cate": "functional", "id": 53}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add a new cohort to the system  identified by start month and year.", "cate": "functional", "id": 54}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add new classes for the nursing department into the system.", "cate": "functional", "id": 55}
{"requirement": "A class shall be either a non-clinical class or a clinical class.", "cate": "functional", "id": 56}
{"requirement": "A non-clinical class shall specify the course name  lecture room requirements  and instructor needs.", "cate": "functional", "id": 57}
{"requirement": "A clinical class shall specify the course name  lecture room requirements  clinical site needs  lecture instructor needs  and clinical lab instructor needs.", "cate": "functional", "id": 58}
{"requirement": "Program Administrators/Nursing Staff Members shall be able to create a new Program of Study.", "cate": "functional", "id": 59}
{"requirement": "A Program of Study shall consist of a program name and listing of required classes (both clinical and non-clinical) that must be completed.", "cate": "functional", "id": 60}
{"requirement": "Program Administrators and Nursing Staff Members shall have the ability to specify which classes are required for a Program of Study", "cate": "functional", "id": 61}
{"requirement": "The system shall be able to display a report of needed classes for a given quarter for all cohorts of all programs for Program Administrators/Nursing Staff Members’ planning purposes.", "cate": "functional", "id": 62}
{"requirement": "The report of needed classes shall include (but not be limited to) classes to be offered  number of sections needed  number of labs needed  and room types needed.", "cate": "functional", "id": 63}
{"requirement": "Classes for a given cohort shall not conflict with regards to the time and day that they are offered.", "cate": "functional", "id": 64}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add a new clinical site into the system.", "cate": "functional", "id": 65}
{"requirement": "Clinical site information shall include (but not be limited to) the name of the site  contact person  and contact information.", "cate": "functional", "id": 66}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add a new clinical lab section for an existing clinical class into the System.", "cate": "functional", "id": 67}
{"requirement": "A clinical lab section shall include the clinical site name  the class  instructor  day and time of the lab.", "cate": "functional", "id": 68}
{"requirement": "Program Administrators and Nursing Staff Members shall be able to add a student who has registered for a clinical class to a clinical lab section for that class.", "cate": "functional", "id": 69}
{"requirement": "The system shall allow a Program Administrator or Nursing staff member to remove a student from a clinical lab section.", "cate": "functional", "id": 70}
{"requirement": "The system shall allow a Program Administrator/Nursing Staff Member to move a student from one clinical lab section to another clinical lab section corresponding to the same clinical class.", "cate": "functional", "id": 71}
{"requirement": "Program Administrators/Nursing Staff Members shall be able to cancel a clinical lab section only if there are no students registered for that clinical lab section.", "cate": "functional", "id": 72}
{"requirement": "A Program Administrator/Nursing Staff Member shall be able to add a new nursing student to the system.", "cate": "functional", "id": 73}
{"requirement": "A staff member shall have the ability to manage the progress of a part time student  which includes modifying their sequence of classes and timeline of classes.", "cate": "functional", "id": 74}
{"requirement": "The system shall be able to display a printable summary for individual cohorts  which will include the students enlisted  the Program of study  sequence of classes  cohort progress through the program  and timeline of completion.", "cate": "functional", "id": 75}
{"requirement": "The system shall be able to display a printable summary for individual clinical sites  which will include information on labs being held at that site for the given quarter (Clinical site  general information on labs held at that location  dates and times of all labs held there).", "cate": "functional", "id": 76}
{"requirement": "The system shall be able to display a printable summary for individual clinical labs  which will include (but not be limited to) class name  class number  lab section  listing of students enrolled  instructor  day(s)  time  and location.", "cate": "functional", "id": 77}
{"requirement": "The system shall be able to display a printable summary for individual nursing students  which will include (but not be limited to) student name  student ID  admission date  classes  credits  GPA  and the cohort that the student is enrolled in.", "cate": "functional", "id": 78}
{"requirement": "The system shall be able to display a printable summary of the system log.", "cate": "functional", "id": 79}
{"requirement": "The system shall contain contact information (e-mail and phone number) for all people relevant to the system  including (but not limited to) staff members  students  lecture instructors  clinical lab instructors  and clinical site administrators.", "cate": "functional", "id": 80}
{"requirement": "The system will use the stored e-mail addresses as a primary means of communicating information to affected parties.", "cate": "functional", "id": 81}
{"requirement": "The system will notify affected parties for routine communication purposes  including but not limited to informing students of upcoming offered classes (timeline) and what their schedule will be/shall be.", "cate": "functional", "id": 82}
{"requirement": "The system will notify affected parties when changes occur affecting clinicals  including but not limited to clinical section capacity changes  and clinical section cancellations.", "cate": "functional", "id": 83}
{"requirement": "The system will notify affected parties when changes occur affecting classes  including but not limited to class cancellations  class section detail changes  and changes to class offerings for a given quarter.", "cate": "functional", "id": 84}
{"requirement": "The system will notify affected parties when changes occur affecting cohorts  including but not limited to changes to the sequence for a cohort’s program of study and changes to a given week’s schedule (lab cancelled this week due to instructor illness).", "cate": "functional", "id": 85}
{"requirement": "The system will notify affected parties when changes occur affecting specific students  including but not limited to changing a student’s status from full time to part time and moving a student to a different clinical section.", "cate": "functional", "id": 86}
{"requirement": "Program Administrators/Nursing Staff Members shall have the ability to modify information relating to cohorts  including cohort identifier  program of study  preferred sequence of classes and quarters that a cohort will be taking specific classes.", "cate": "functional", "id": 87}
{"requirement": "Program Administrators/Nursing Staff Members shall have the ability to modify information relating to a Program of Study within the Nursing Department  including the Program of study name  and required classes for that Program of Study.", "cate": "functional", "id": 88}
{"requirement": "Program Administrators/Nursing Staff Members shall have the ability to modify information relating to a Clinical Site  including the clinical site name  site contact person  contact information  and address.", "cate": "functional", "id": 89}
{"requirement": "Program Administrators/Nursing Staff Members shall have the ability to modify information relating to a Clinical Lab Section  including the clinical site name  the department/section for the lab  the class  instructor  day and time of lab  and contact information.", "cate": "functional", "id": 90}
{"requirement": "Program Administrators/Nursing Staff Members shall have the ability to modify information relating to a Nursing Student  including student ID  student name  phone number  e-mail  status (full time or part time)  and program of study.", "cate": "functional", "id": 91}
{"requirement": "The Disputes application shall ensure that only users with the appropriate access level are allowed to initiate dispute requests.", "cate": "security", "id": 92}
{"requirement": "Only users with Update access must be able to initiate dispute requests.", "cate": "security", "id": 93}
{"requirement": "The Disputes application shall ensure that only authorized users are allowed to logon to the application.", "cate": "security", "id": 94}
{"requirement": "All authorized users  once authenticated must be able to logon to the Disputes System", "cate": "security", "id": 95}
{"requirement": "The Disputes System shall generate a User Report that details any new users that have been added and any changes to an existing user’s access level.  The report will be reviewed for auditing purposes.", "cate": "security", "id": 96}
{"requirement": "All additions of new users and modifications to user’s access shall be recorded on the User Report.", "cate": "security", "id": 97}
{"requirement": "If a user account is revoked  it can only be re-instantiated by the System Administrator.", "cate": "security", "id": 98}
{"requirement": "Only the System Administrator shall be able to reset a revoked user logon account", "cate": "security", "id": 99}
{"requirement": "The Disputes application shall manipulate and view business data. Users will not have direct access to data files or databases.", "cate": "security", "id": 100}
{"requirement": "All updates to data files or database must be initiated from the Disputes System.", "cate": "security", "id": 101}
{"requirement": "The Disputes System must be accessible by both internal and external users.", "cate": "functional", "id": 102}
{"requirement": "The Disputes System must prevent users from accessing any dispute cases that do not belong to their cardholder base.", "cate": "functional", "id": 103}
{"requirement": "The Disputes System will facilitate direct data entry of a dispute case via a user interface that supports real time responses to the users.", "cate": "functional", "id": 104}
{"requirement": "The Disputes System must provide different levels of access with regard to disputes case initiation and follow-up actions.", "cate": "functional", "id": 105}
{"requirement": "The Disputes System shall provide view access capability for authorized users of the application.", "cate": "functional", "id": 106}
{"requirement": "The Disputes System shall provide update access capability for authorized users of the application.", "cate": "functional", "id": 107}
{"requirement": "The Disputes System must allow the users to select disputable transactions (based on the age of the transaction) from a user interface and initiate a dispute (ticket retrieval request or chargeback notification) on the selected transaction.", "cate": "functional", "id": 108}
{"requirement": "The Disputes System must provide the user the ability to initiate a single dispute case on multiple transactions that belong to a single merchant.", "cate": "functional", "id": 109}
{"requirement": "The Disputes System will provide the user the ability to create or initiate a ticket retrieval request.   As part of ticket retrieval creation process the system must prompt the user to enter all the required information to create the ticket retrieval request.  The ticket retrieval request is a document that is sent to merchant inquiring the validity of a transaction.", "cate": "functional", "id": 110}
{"requirement": "The Disputes System must allow the user to create three unique types of ticket retrieval requests.  The three types of ticket retrieval requests are (1) Request for original receipt (2) Request for a copy of the receipt or (3) Request for a portfolio. A portfolio consists of documentation that would provide proof of a purchase such as the documentation that is received from a car rental agency that is more than a sales receipt.", "cate": "functional", "id": 111}
{"requirement": "The Disputes System must prevent external users from requesting original receipts. Requests for original receipts are restricted to internal users.", "cate": "functional", "id": 112}
{"requirement": "The Disputes System must provide a confirmation to the user upon the creation of ticket retrieval request that contains the following information; the dispute case number  the type of retrieval requested (copy  original or portfolio)  and the date that the merchant response is due.", "cate": "functional", "id": 113}
{"requirement": "The Disputes System shall allow the user to create or initiate a chargeback request.  The system must prompt the user to enter the required information to initiate a chargeback request. The chargeback request results in a printed chargeback notification that is sent to merchant indicating that their account will be charged back if no proof is provided that the disputed transaction is valid.", "cate": "functional", "id": 114}
{"requirement": "The Disputes System must provide a confirmation to the user upon the creation of a chargeback request. The confirmation must contain the following information; the dispute case number  the type of chargeback requested (pending or immediate)  and the date that the merchant response is due.", "cate": "functional", "id": 115}
{"requirement": "The Disputes System shall prevent the creation of duplicate dispute requests 100\\% of the time.", "cate": "functional", "id": 116}
{"requirement": "The Disputes System shall accurately provide a list of possible reason codes for a given transaction.  The list of possible reason codes must be derived based on the type of transaction and the industry that the merchant belongs to  according to the business rules defined for the Disputes System.", "cate": "functional", "id": 117}
{"requirement": "The Disputes System must provide the ability to view existing dispute cases.", "cate": "functional", "id": 118}
{"requirement": "The Disputes System must provide Search functionality.  The search method must include the ability to search by (1) the dispute case number  (2) the merchant account number  (3) the cardmember account number and (4) the issuer number.  In addition to the above criteria  the search functionality must further allow the user to limit the results of the search by a date range  the type of dispute (ticket retrieval request or chargeback notification)  the case status (open  closed or all) and the dispute reason code.", "cate": "functional", "id": 119}
{"requirement": "A list of all disputes cases that meet the entered search criteria must be provided to the user.  The list of cases must differentiate the type and/or status of the case by color -coding the line item in the list.  For example all open cases will be yellow and all closed cases will be gray.", "cate": "functional", "id": 120}
{"requirement": "The Disputes System shall provide the users the ability to view the history of all activities that have occurred on the dispute case.", "cate": "functional", "id": 121}
{"requirement": "The Dispute System shall provide the users with the ability to follow up on a dispute case via follow-up actions.  The list of available follow up actions for a given dispute case must be filtered by the status of the case and the access level of the user.", "cate": "functional", "id": 122}
{"requirement": "The Disputes System shall record the name of the user and the date for any activity that creates or modifies the disputes case in the system.  A detailed history of the actions taken on the case  including the date and the user that performed the action must be maintained for auditing purposes.", "cate": "functional", "id": 123}
{"requirement": "For any systematic (non-user initiated) action that occurs on a case such as the disputes aging process  a case activity will be generated.  Upon the next logon the user that initiated the dispute case must be notified that a systematic action has occurred on the dispute case.", "cate": "functional", "id": 124}
{"requirement": "All letter requests must be formatted according to guidelines specified by the Print Letter Utility system.", "cate": "functional", "id": 125}
{"requirement": "Any disputes cases that have been closed for over 6 months must be purged from the online disputes database.", "cate": "functional", "id": 126}
{"requirement": "Only adjusters can request recycled parts audit reports. No users without an adjuster role shall request recycled parts audits.", "cate": "security", "id": 127}
{"requirement": "Only adjusters with a supervisor role can update preferred repair facility ratings. Users without the supervisor role cannot access the repair facility ratings.", "cate": "security", "id": 128}
{"requirement": "Only collision estimators shall search for recycled parts.  Users without the collision estimator role shall not have access to the search for recycled parts.", "cate": "security", "id": 129}
{"requirement": "Only valid data shall be entered into the system.  No invalid data shall be entered into the system.", "cate": "security", "id": 130}
{"requirement": "One insurance company shall not be able to view another insurance companys claim data.", "cate": "security", "id": 131}
{"requirement": "The product shall free of computer viruses.", "cate": "security", "id": 132}
{"requirement": "The system shall prevent malicious attacks including denial of service.", "cate": "security", "id": 133}
{"requirement": "The user shall search for the preferred repair facility using vehicle  vehicle location  and radius in miles", "cate": "functional", "id": 134}
{"requirement": "The vehicle data shall include vehicle year  make  and model", "cate": "functional", "id": 135}
{"requirement": "The vehicle location shall include street address  city  state  and zipcode", "cate": "functional", "id": 136}
{"requirement": "The system shall resolve the zipcode for the street address  city  and state if zipcode is unknown.", "cate": "functional", "id": 137}
{"requirement": "The search radius shall be between 1 and 30 miles", "cate": "functional", "id": 138}
{"requirement": "The system shall locate the preferred repair facility with the highest ratings for the input criteria", "cate": "functional", "id": 139}
{"requirement": "The adjuster shall enter the preferred repair facility on the estimate assignment.", "cate": "functional", "id": 140}
{"requirement": "The adjuster shall be able to override the preferred repair facitlity on the estimate assignment.", "cate": "functional", "id": 141}
{"requirement": "The preferred repair facility shall be returned to the user.", "cate": "functional", "id": 142}
{"requirement": "The system shall return a list of repair facilities within the radius if the preferred repair facility cannot be determined.", "cate": "functional", "id": 143}
{"requirement": "The estimator shall search for available recycled parts using damaged vehicle parts information.", "cate": "functional", "id": 144}
{"requirement": "The estimator shall search for available recycled parts using a list of preferred parts suppliers.", "cate": "functional", "id": 145}
{"requirement": "The system shall search for available recycled parts for the supplied vehicle parts and suppliers.", "cate": "functional", "id": 146}
{"requirement": "The estimator shall search by zipcode with a radius of 30 miles if no parts are found for the preferred parts suppliers", "cate": "functional", "id": 147}
{"requirement": "The system shall retain the available recycled parts and suppliers returned from the search.", "cate": "functional", "id": 148}
{"requirement": "The available recycled parts information and their suppliers shall be returned to the user.", "cate": "functional", "id": 149}
{"requirement": "The estimator shall apply selected recycled parts to the collision estimate.", "cate": "functional", "id": 150}
{"requirement": "The estimator shall not apply recycled parts to the collision estimate if no available parts are returned.", "cate": "functional", "id": 151}
{"requirement": "The adjuster shall review the collision estimate.", "cate": "functional", "id": 152}
{"requirement": "The adjuster shall request a recycled parts audit of the collision estimate.", "cate": "functional", "id": 153}
{"requirement": "The recycled parts search results provided to the estimator shall be retrieved by the system.", "cate": "functional", "id": 154}
{"requirement": "The system shall generate an audit report based on the available recycled parts and the collision estimate.", "cate": "functional", "id": 155}
{"requirement": "The audit report shall include the total number of recycled parts used in the estimate.", "cate": "functional", "id": 156}
{"requirement": "The audit report shall include the number of available recycled parts from the original search results.", "cate": "functional", "id": 157}
{"requirement": "The audit report shall include the percentage of available recycled parts used in the estimate", "cate": "functional", "id": 158}
{"requirement": "The audit report shall include the total score of the audit which sums the indivual line items.", "cate": "functional", "id": 159}
{"requirement": "The audit report shall be displayed to the user.", "cate": "functional", "id": 160}
{"requirement": "The audit report shall be available to other adjusters at later points in time.", "cate": "functional", "id": 161}
{"requirement": "The user shall select to view the preferred repair facility ratings.", "cate": "functional", "id": 162}
{"requirement": "The current repair facility ratings shall be displayed to the user.", "cate": "functional", "id": 163}
{"requirement": "The system will display a blank set of ratings if there are not ratings yet defined.", "cate": "functional", "id": 164}
{"requirement": "The user shall enter new ratings based on the audit report", "cate": "functional", "id": 165}
{"requirement": "The ratings shall be from a scale of 1-10", "cate": "functional", "id": 166}
{"requirement": "The ratings shall include categories for attempted use of recycled parts and actual use of recycled parts", "cate": "functional", "id": 167}
{"requirement": "The user shall select to save the preferred repair facility ratings.", "cate": "functional", "id": 168}
{"requirement": "The preferred repair facility ratings shall be saved by the system.", "cate": "functional", "id": 169}
{"requirement": "The product shall ensure that only company employees or external users with company-approved user IDs may have product access.  100\\% of all logons shall be by either company employees or external users with company-approved user IDs.", "cate": "security", "id": 170}
{"requirement": "Only managers are able to perform search queries for reservations by user.  100\\% of all search queries for reservations by user shall be from logons of only management logons.", "cate": "security", "id": 171}
{"requirement": "The product shall ensure that the database’s data corresponds to the data entered by the user.  Each conference room reservation in the system will contain the same information as was entered by the user.", "cate": "security", "id": 172}
{"requirement": "The product shall prevent the input of malicious data.  The product and/or adjacent hardware/software systems’ data shall remain 100\\% uncorrupted each time malicious data is input into the product.", "cate": "security", "id": 173}
{"requirement": "The product shall have the ability to receive automatic software updates as new threats emerge.  100\\% of customers will be able to receive automatic software updates transmitted to the installed product.", "cate": "security", "id": 174}
{"requirement": "The product shall record meeting entries.", "cate": "functional", "id": 175}
{"requirement": "The product will notify employees of meeting invitations.", "cate": "functional", "id": 176}
{"requirement": "The product shall have the ability to send meeting reminders to employees.", "cate": "functional", "id": 177}
{"requirement": "The product shall assign the organizers contact information to each meeting they create.", "cate": "functional", "id": 178}
{"requirement": "The product will record meeting acknowledgements.", "cate": "functional", "id": 179}
{"requirement": "The product shall store new conference rooms.", "cate": "functional", "id": 180}
{"requirement": "The product shall update existing conference rooms.", "cate": "functional", "id": 181}
{"requirement": "The product will be able to delete conference rooms.", "cate": "functional", "id": 182}
{"requirement": "The product shall be able to store new room equipment.", "cate": "functional", "id": 183}
{"requirement": "The product will update existing room equipment.", "cate": "functional", "id": 184}
{"requirement": "The product shall be able to delete room equipment.", "cate": "functional", "id": 185}
{"requirement": "The product shall allow an organizer to invite other employees to meetings.", "cate": "functional", "id": 186}
{"requirement": "Each time a conference room is reserved  the conference room schedule shall be updated to reflect the time and date of the reservation.", "cate": "functional", "id": 187}
{"requirement": "The product shall record the transportation status of equipment reserved.", "cate": "functional", "id": 188}
{"requirement": "The product shall display a map of the company building showing conference room locations.", "cate": "functional", "id": 189}
{"requirement": "The product shall record updated meeting agendas.", "cate": "functional", "id": 190}
{"requirement": "The product shall send a meeting confirmation to the meeting organizer.", "cate": "functional", "id": 191}
{"requirement": "The product shall display room equipment according to search parameters.", "cate": "functional", "id": 192}
{"requirement": "The product shall display conference rooms according to search parameters.", "cate": "functional", "id": 193}
{"requirement": "The product shall record different meeting types.", "cate": "functional", "id": 194}
{"requirement": "The product shall record all the equipment that has been reserved.", "cate": "functional", "id": 195}
{"requirement": "The product shall notify building personnel of equipment transport requests.", "cate": "functional", "id": 196}
{"requirement": "The product will allow priviledged users to view meeting schedules in multiple reporting views.", "cate": "functional", "id": 197}
{"requirement": "The product shall be able to send meeting notifications via different kinds of end-user specified methods.", "cate": "functional", "id": 198}
{"requirement": "The product shall have a customizable Look and Feel.", "cate": "functional", "id": 199}
{"requirement": "The product shall have an intuitive user interface.", "cate": "functional", "id": 200}
{"requirement": "The product will display an available status for unreserved conference rooms.", "cate": "functional", "id": 201}
{"requirement": "The System shall maintain consistent security.  Any changes in user passwords and/or permissions should take affect in all parts of the System.", "cate": "security", "id": 202}
{"requirement": "The System shall granularly control access rights to all major subsystems.  It should be possible to assign access rights to all subsystems independently.", "cate": "security", "id": 203}
{"requirement": "The System shall allow generation of Inventory Quantity Adjustment documents on demand.", "cate": "functional", "id": 204}
{"requirement": "The System shall allow on demand generation of all Inventory Quantity Adjustment documents since certain point of time.", "cate": "functional", "id": 205}
{"requirement": "The IQA subsystem shall take into account current inventory status and adjust inventory of substitutionary ingredients accordingly.", "cate": "functional", "id": 206}
{"requirement": "The System shall allow entering  storing and modifying product formulas.", "cate": "functional", "id": 207}
{"requirement": "Product formulas shall allow use of semi-products  which have own formulas.", "cate": "functional", "id": 208}
{"requirement": "Product formula ingredients shall allow defining substitutionary ingredients.", "cate": "functional", "id": 209}
{"requirement": "Product formula substitutionary ingredients shall be entered automatically by the PFE subsystem.", "cate": "functional", "id": 210}
{"requirement": "Formula substitutionary ingredients shall be kept in persisted order", "cate": "functional", "id": 211}
{"requirement": "Product shall allow entering  storing and modifying product menus used by POS terminals.", "cate": "functional", "id": 212}
{"requirement": "PME Subsystem shall allow building product menus based on the list of products kept in the accounting system.", "cate": "functional", "id": 213}
{"requirement": "PME Subsystem shall allow keeping submenus within menus and products within submenus in a managed and persisted order.", "cate": "functional", "id": 214}
{"requirement": "PME Subsystem shall allow for a product to exist in more than one submenu", "cate": "functional", "id": 215}
{"requirement": "The RMS System shall have Windows XP look and feel and use GUI futures making its use intuitive.", "cate": "functional", "id": 216}
{"requirement": "The System shall generate Inventory Quantity Adjustment document based on product daily sales data and product formulas.", "cate": "functional", "id": 217}
{"requirement": "The System shall generate Inventory Quantity Adjustment document automatically when daily Product Sales data is available.", "cate": "functional", "id": 218}
{"requirement": "All credit card information will be secured on the server  and only accessible by authorized Izogn administrators.  Information will be encrypted in the database.", "cate": "security", "id": 219}
{"requirement": "Only registered customers can purchase streaming movies.", "cate": "security", "id": 220}
{"requirement": "A customer can only stream a movie if they purchased it  and are within the 2 day viewing period.", "cate": "security", "id": 221}
{"requirement": "Only authorized personnel can access customer records in the database.", "cate": "security", "id": 222}
{"requirement": "Only administrators can activate a pre-paid card.", "cate": "security", "id": 223}
{"requirement": "Only authorized personnel can access sales information.", "cate": "security", "id": 224}
{"requirement": "The website shall prevent its data from being corrupted when incorrect data is entered in.", "cate": "security", "id": 225}
{"requirement": "The website shall protect itself from intentional abuse  and notify the administrator at all occurrences.", "cate": "security", "id": 226}
{"requirement": "Data integrity scripts will be run on a weekly basis to verify the integrity of the database.", "cate": "security", "id": 227}
{"requirement": "The website shall make its user aware of its information practices before collection data from them via a Privacy Policy  accessible on all pages of the website.", "cate": "security", "id": 228}
{"requirement": "The system shall notify customers of changes to its information policy.", "cate": "security", "id": 229}
{"requirement": "The system shall reveal private information only in compliance with the organization’s information policy.", "cate": "security", "id": 230}
{"requirement": "All customer information will be stored on a secure database  accessible only to authorized personnel.", "cate": "security", "id": 231}
{"requirement": "All credit card information will be encrypted in the database.", "cate": "security", "id": 232}
{"requirement": "The streaming server will have anti-virus software to prevent infection of malicious viruses.", "cate": "security", "id": 233}
{"requirement": "The website will allow customers to search for movies by title  actor  or director.", "cate": "functional", "id": 234}
{"requirement": "viewing a movie details  the website will display the movies description  actor  and director entered in by the administrator.", "cate": "functional", "id": 235}
{"requirement": "Website shall request  and authorize credit card payment before allowing a user to stream a movie.", "cate": "functional", "id": 236}
{"requirement": "shall be able to stream purchased movie via Windows Media Player  for up to 2 days aftere purchase date.", "cate": "functional", "id": 237}
{"requirement": "Website shall allow customers to browse movies by categories entered in by izogn administrator.", "cate": "functional", "id": 238}
{"requirement": "Website shall allow customers to view reviews of selected movies by other customers.", "cate": "functional", "id": 239}
{"requirement": "Website shall allow customers to add their own movie review for a selected movie.", "cate": "functional", "id": 240}
{"requirement": "Website shall allow the Izogn administrator to approve a review posted by a customer.", "cate": "functional", "id": 241}
{"requirement": "System will allow customers to pay for a streaming movie with a pre-paid card.", "cate": "functional", "id": 242}
{"requirement": "Website shall allow customers to purchase pre-paid cards of $5  $10  or $20 value either by credit card or mail-in payment option.", "cate": "functional", "id": 243}
{"requirement": "System shall automatically update the main page of the website every Friday  and show the 4 latest movies that have been added to the website.", "cate": "functional", "id": 244}
{"requirement": "System shall allow users to update their billing and contact information via the “My Account” section of the website.", "cate": "functional", "id": 245}
{"requirement": "Pre-paid cards shall be distributed via email  or via a printed paper card.", "cate": "functional", "id": 246}
{"requirement": "Only registered customers can purchase streaming movies.", "cate": "functional", "id": 247}
{"requirement": "Movies can only be streamed if the customer has purchased a movie  and is within the 2-day time period to stream the movie.", "cate": "functional", "id": 248}
{"requirement": "Website must be able to support free trial periods with various parameters set by the Izogn Manager.", "cate": "functional", "id": 249}
{"requirement": "All streaming movie sales will be logged in the database  and accessible by the administrator.", "cate": "functional", "id": 250}
{"requirement": "All registered customer information shall be stored and maintained in the database  even after the customer cancels their account.", "cate": "functional", "id": 251}
{"requirement": "Daily usage statistics should be logged  and accessible by the administrator.", "cate": "functional", "id": 252}
{"requirement": "The owner shall have free access to all of the streaming movies.", "cate": "functional", "id": 253}
{"requirement": "The vendor will verify the invalid lead.", "cate": "functional", "id": 254}
{"requirement": "Vendor will submit a credit validation record to be applied to the enterprise billing system.", "cate": "functional", "id": 255}
{"requirement": "If a lead is scored to the high range the system will supply the lead data and score to the enterprise system.", "cate": "functional", "id": 256}
{"requirement": "The leads washing functionality will validate all leads received by the web service for valid data", "cate": "functional", "id": 257}
{"requirement": "The leads washing functionality will insert all leads captured by the web service.", "cate": "functional", "id": 258}
{"requirement": "If the leads score falls within the high average score then it will be process by the ARA functionality.", "cate": "functional", "id": 259}
{"requirement": "If the leads score falls within the medium average then it will be set for manual verification by an Enrollment Coordinator through the eleads system.", "cate": "functional", "id": 260}
{"requirement": "If the leads score falls within the low average then it will be returned to the supplying vendor", "cate": "functional", "id": 261}
{"requirement": "The leads washing functionality will compile both contact and academic scoring information for a total score.", "cate": "functional", "id": 262}
{"requirement": "The leads washing functionality will use the parameters supplied by corporate and schools to score part of the lead.", "cate": "functional", "id": 263}
{"requirement": "The leads washing functionality will return the lead data supplied to the vendor along with the reason of rejection.", "cate": "functional", "id": 264}
{"requirement": "The leads washing functionality will have an interface in which lead data parameters can be maintained.", "cate": "functional", "id": 265}
{"requirement": "The leads washing functionality will verify the users authentication and rights to make parameter updates.", "cate": "functional", "id": 266}
{"requirement": "The leads washing functionality will store any potential lead duplicates returned by the enterprise system.", "cate": "functional", "id": 267}
{"requirement": "Prior to submitting the lead to the enterprise system the leads washing functionality will assign the lead to an admissions rep.", "cate": "functional", "id": 268}
{"requirement": "The leads washing functionality shall receive a period list of available reps from the enterprise system.", "cate": "functional", "id": 269}
{"requirement": "The product shall provide players no access to information that might reveal the identity of another player", "cate": "security", "id": 270}
{"requirement": "The product shall maintain a list of players.", "cate": "functional", "id": 271}
{"requirement": "The product shall allow a user to identify himself or herself as a player.", "cate": "functional", "id": 272}
{"requirement": "Once a game has been initiated  the product shall make the players assigned to the game unavailable for selection from the list of players.", "cate": "functional", "id": 273}
{"requirement": "The product shall allow a user to remove himself or herself from the list of players at any time.", "cate": "functional", "id": 274}
{"requirement": "The product shall make inactive players unavailable for selection from the list of players.", "cate": "functional", "id": 275}
{"requirement": "The product shall remove players who have been inactive for 24 hours from the list of players.", "cate": "functional", "id": 276}
{"requirement": "The product shall allow a player to initiate a game by selecting another available player from the list of players.", "cate": "functional", "id": 277}
{"requirement": "Once a game is initiated  the product shall display a defensive grid to each player", "cate": "functional", "id": 278}
{"requirement": "Once a game is initiated  the product shall display an offensive grid to each player.", "cate": "functional", "id": 279}
{"requirement": "The product shall prevent a player from viewing the offensive or defensive grids of the other player.", "cate": "functional", "id": 280}
{"requirement": "Once a game is initiated  the product shall allow each player to position their 5 ships on their respective defensive grids.", "cate": "functional", "id": 281}
{"requirement": "The product shall allow a player to position ships horizontally on their grid.", "cate": "functional", "id": 282}
{"requirement": "The product shall allow the player to position ships vertically on their grid.", "cate": "functional", "id": 283}
{"requirement": "The product shall allow the player to position ships diagonally on their grid", "cate": "functional", "id": 284}
{"requirement": "The product shall prevent the player from overlapping ships on their grid.", "cate": "functional", "id": 285}
{"requirement": "When both players have positioned their 5 ships on their defensive grids  the product shall define the status of each player for the first turn.", "cate": "functional", "id": 286}
{"requirement": "For each turn  the product shall identify one player as offensive status and one player as defensive status.", "cate": "functional", "id": 287}
{"requirement": "The product shall maintain the status of each player for a turn  either offensive or defensive.", "cate": "functional", "id": 288}
{"requirement": "At the start of each turn  the product shall notify each player of his or her status.", "cate": "functional", "id": 289}
{"requirement": "For each turn  the product shall allow the offensive player to define a shot.", "cate": "functional", "id": 290}
{"requirement": "For each shot  the product shall examine the defensive grid of the defensive player to determine whether the shot was a hit or miss.", "cate": "functional", "id": 291}
{"requirement": "For each shot  the product shall notify the players whether the shot was a hit or miss.", "cate": "functional", "id": 292}
{"requirement": "For each shot  the product shall mark the shot as a hit or miss on the defensive grid of the defensive player.", "cate": "functional", "id": 293}
{"requirement": "For each shot  the product shall mark the shot as a hit or miss on the offensive grid of the offensive player.", "cate": "functional", "id": 294}
{"requirement": "When the hit results in sinking a ship  the product shall notify the players that the ship was sunk.", "cate": "functional", "id": 295}
{"requirement": "When the hit results in sinking a ship  the product shall mark the ship as sunk on the defensive grid of the defensive player.", "cate": "functional", "id": 296}
{"requirement": "When the hit results in sinking a ship  the product shall indicate the type of ship sunk on the defensive grid of the defensive player.", "cate": "functional", "id": 297}
{"requirement": "When the hit results in sinking a ship  the product shall mark the ship as sunk on the offensive grid of the offensive player.", "cate": "functional", "id": 298}
{"requirement": "If the shot was marked as a hit  the product shall allow the offensive player to define a shot.", "cate": "functional", "id": 299}
{"requirement": "If the shot was marked as a miss  the product shall change the status of the offensive player to defensive", "cate": "functional", "id": 300}
{"requirement": "If the shot was marked as a miss  the product shall change the status of the defensive player to offensive", "cate": "functional", "id": 301}
{"requirement": "The product shall continue to assign turns until the game is ended.", "cate": "functional", "id": 302}
{"requirement": "The product shall end a game when a hit by the offensive player results in sinking the last of the defensive player’s ships  which had not been previously marked as sunk.", "cate": "functional", "id": 303}
{"requirement": "The product shall allow a player to end a game at any time during the game.", "cate": "functional", "id": 304}
{"requirement": "When a game is ended  the product shall notify the players that the game is ended.", "cate": "functional", "id": 305}
{"requirement": "The notification of the game ending will include the reason the game is ended (i.e.  a player has won the game or a player has ended the game).", "cate": "functional", "id": 306}
{"requirement": "When a game is ended  the product shall allow each player to identify himself or herself as an available player in the list of players.", "cate": "functional", "id": 307}
{"requirement": "When a game is ended  the product shall allow each player to remove himself or herself from the list of players.", "cate": "functional", "id": 308}
{"requirement": "The product shall ensure that only supervisors can advertise empty time slots.The product must ensure that supervisors are allowed to access advertise empty time slots.", "cate": "security", "id": 309}
{"requirement": "The product shall ensure that only supervisors can enter a caller’s schedule.The product must ensure that supervisors are allowed to access advertise empty time slots.", "cate": "security", "id": 310}
{"requirement": "The product shall ensure that only supervisors can view schedule of all callers.The product must ensure that supervisors are allowed to access advertise empty time slots.", "cate": "security", "id": 311}
{"requirement": "The product shall have security.The product shall provide authentication  and authorization.", "cate": "security", "id": 312}
{"requirement": "The product shall information Security. The product shall enable privacy by encryption WS-Security and Integrity Checking.", "cate": "security", "id": 313}
{"requirement": "The product shall have audit capabilities.The product shall store messages for a minimum of one year for audit and transaction tracking purposes.", "cate": "security", "id": 314}
{"requirement": "The system shall only be accessed by authorized Corporate Community Grants (CCR) employees. Users must be authenticated using their IBM intranet user name and password.", "cate": "security", "id": 315}
{"requirement": "The WCS system shall not allow automatic logins by any user. Cookies containing WCS login information about a user will not be stored on a user’s computer.", "cate": "security", "id": 316}
{"requirement": "Each team owner will need to use a username and password in order to be authenticated to reach the team owner’s page", "cate": "security", "id": 317}
{"requirement": "The Commissioner will be the only authorized user per league to adjust league settings.", "cate": "security", "id": 318}
{"requirement": "\\tOnly authorized user shall access the RFS system. ONLY users that exist in the UAS system  with the RFS system assigned to their role(s)  shall access the RFS system and use it.", "cate": "security", "id": 319}
{"requirement": "\\tUser access should be limited to the permissions granted to their role(s) Each level in the PCG hierarchy will be assigned a role and users will be assigned to these roles. Access to functionality within RFS system is dependent on the privileges/permission assigned to the role..", "cate": "security", "id": 320}
